RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
/**
 * @file reg_esp32_soc.h
 * @brief ESP32 / ESP32-S3 SoC MMIO Register Maps
 * @copyright Clean-room proprietary implementation. Zero GPL/Apache code.
 */

#ifndef REG_ESP32_SOC_H
#define REG_ESP32_SOC_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_1_TypeDef;
#define ESP32_UNIT_1 ((ESP32_UNIT_1_TypeDef *)(0x3FF40000UL + 1 * 0x400UL))

#define ESP32_UNIT_1_BIT_0 (1UL << 0)
#define ESP32_UNIT_1_BIT_1 (1UL << 1)
#define ESP32_UNIT_1_BIT_2 (1UL << 2)
#define ESP32_UNIT_1_BIT_3 (1UL << 3)
#define ESP32_UNIT_1_BIT_4 (1UL << 4)
#define ESP32_UNIT_1_BIT_5 (1UL << 5)
#define ESP32_UNIT_1_BIT_6 (1UL << 6)
#define ESP32_UNIT_1_BIT_7 (1UL << 7)
#define ESP32_UNIT_1_BIT_8 (1UL << 8)
#define ESP32_UNIT_1_BIT_9 (1UL << 9)
#define ESP32_UNIT_1_BIT_10 (1UL << 10)
#define ESP32_UNIT_1_BIT_11 (1UL << 11)
#define ESP32_UNIT_1_BIT_12 (1UL << 12)
#define ESP32_UNIT_1_BIT_13 (1UL << 13)
#define ESP32_UNIT_1_BIT_14 (1UL << 14)
#define ESP32_UNIT_1_BIT_15 (1UL << 15)
#define ESP32_UNIT_1_BIT_16 (1UL << 16)
#define ESP32_UNIT_1_BIT_17 (1UL << 17)
#define ESP32_UNIT_1_BIT_18 (1UL << 18)
#define ESP32_UNIT_1_BIT_19 (1UL << 19)
#define ESP32_UNIT_1_BIT_20 (1UL << 20)
#define ESP32_UNIT_1_BIT_21 (1UL << 21)
#define ESP32_UNIT_1_BIT_22 (1UL << 22)
#define ESP32_UNIT_1_BIT_23 (1UL << 23)
#define ESP32_UNIT_1_BIT_24 (1UL << 24)
#define ESP32_UNIT_1_BIT_25 (1UL << 25)
#define ESP32_UNIT_1_BIT_26 (1UL << 26)
#define ESP32_UNIT_1_BIT_27 (1UL << 27)
#define ESP32_UNIT_1_BIT_28 (1UL << 28)
#define ESP32_UNIT_1_BIT_29 (1UL << 29)
#define ESP32_UNIT_1_BIT_30 (1UL << 30)
#define ESP32_UNIT_1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_2_TypeDef;
#define ESP32_UNIT_2 ((ESP32_UNIT_2_TypeDef *)(0x3FF40000UL + 2 * 0x400UL))

#define ESP32_UNIT_2_BIT_0 (1UL << 0)
#define ESP32_UNIT_2_BIT_1 (1UL << 1)
#define ESP32_UNIT_2_BIT_2 (1UL << 2)
#define ESP32_UNIT_2_BIT_3 (1UL << 3)
#define ESP32_UNIT_2_BIT_4 (1UL << 4)
#define ESP32_UNIT_2_BIT_5 (1UL << 5)
#define ESP32_UNIT_2_BIT_6 (1UL << 6)
#define ESP32_UNIT_2_BIT_7 (1UL << 7)
#define ESP32_UNIT_2_BIT_8 (1UL << 8)
#define ESP32_UNIT_2_BIT_9 (1UL << 9)
#define ESP32_UNIT_2_BIT_10 (1UL << 10)
#define ESP32_UNIT_2_BIT_11 (1UL << 11)
#define ESP32_UNIT_2_BIT_12 (1UL << 12)
#define ESP32_UNIT_2_BIT_13 (1UL << 13)
#define ESP32_UNIT_2_BIT_14 (1UL << 14)
#define ESP32_UNIT_2_BIT_15 (1UL << 15)
#define ESP32_UNIT_2_BIT_16 (1UL << 16)
#define ESP32_UNIT_2_BIT_17 (1UL << 17)
#define ESP32_UNIT_2_BIT_18 (1UL << 18)
#define ESP32_UNIT_2_BIT_19 (1UL << 19)
#define ESP32_UNIT_2_BIT_20 (1UL << 20)
#define ESP32_UNIT_2_BIT_21 (1UL << 21)
#define ESP32_UNIT_2_BIT_22 (1UL << 22)
#define ESP32_UNIT_2_BIT_23 (1UL << 23)
#define ESP32_UNIT_2_BIT_24 (1UL << 24)
#define ESP32_UNIT_2_BIT_25 (1UL << 25)
#define ESP32_UNIT_2_BIT_26 (1UL << 26)
#define ESP32_UNIT_2_BIT_27 (1UL << 27)
#define ESP32_UNIT_2_BIT_28 (1UL << 28)
#define ESP32_UNIT_2_BIT_29 (1UL << 29)
#define ESP32_UNIT_2_BIT_30 (1UL << 30)
#define ESP32_UNIT_2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_3_TypeDef;
#define ESP32_UNIT_3 ((ESP32_UNIT_3_TypeDef *)(0x3FF40000UL + 3 * 0x400UL))

#define ESP32_UNIT_3_BIT_0 (1UL << 0)
#define ESP32_UNIT_3_BIT_1 (1UL << 1)
#define ESP32_UNIT_3_BIT_2 (1UL << 2)
#define ESP32_UNIT_3_BIT_3 (1UL << 3)
#define ESP32_UNIT_3_BIT_4 (1UL << 4)
#define ESP32_UNIT_3_BIT_5 (1UL << 5)
#define ESP32_UNIT_3_BIT_6 (1UL << 6)
#define ESP32_UNIT_3_BIT_7 (1UL << 7)
#define ESP32_UNIT_3_BIT_8 (1UL << 8)
#define ESP32_UNIT_3_BIT_9 (1UL << 9)
#define ESP32_UNIT_3_BIT_10 (1UL << 10)
#define ESP32_UNIT_3_BIT_11 (1UL << 11)
#define ESP32_UNIT_3_BIT_12 (1UL << 12)
#define ESP32_UNIT_3_BIT_13 (1UL << 13)
#define ESP32_UNIT_3_BIT_14 (1UL << 14)
#define ESP32_UNIT_3_BIT_15 (1UL << 15)
#define ESP32_UNIT_3_BIT_16 (1UL << 16)
#define ESP32_UNIT_3_BIT_17 (1UL << 17)
#define ESP32_UNIT_3_BIT_18 (1UL << 18)
#define ESP32_UNIT_3_BIT_19 (1UL << 19)
#define ESP32_UNIT_3_BIT_20 (1UL << 20)
#define ESP32_UNIT_3_BIT_21 (1UL << 21)
#define ESP32_UNIT_3_BIT_22 (1UL << 22)
#define ESP32_UNIT_3_BIT_23 (1UL << 23)
#define ESP32_UNIT_3_BIT_24 (1UL << 24)
#define ESP32_UNIT_3_BIT_25 (1UL << 25)
#define ESP32_UNIT_3_BIT_26 (1UL << 26)
#define ESP32_UNIT_3_BIT_27 (1UL << 27)
#define ESP32_UNIT_3_BIT_28 (1UL << 28)
#define ESP32_UNIT_3_BIT_29 (1UL << 29)
#define ESP32_UNIT_3_BIT_30 (1UL << 30)
#define ESP32_UNIT_3_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_4_TypeDef;
#define ESP32_UNIT_4 ((ESP32_UNIT_4_TypeDef *)(0x3FF40000UL + 4 * 0x400UL))

#define ESP32_UNIT_4_BIT_0 (1UL << 0)
#define ESP32_UNIT_4_BIT_1 (1UL << 1)
#define ESP32_UNIT_4_BIT_2 (1UL << 2)
#define ESP32_UNIT_4_BIT_3 (1UL << 3)
#define ESP32_UNIT_4_BIT_4 (1UL << 4)
#define ESP32_UNIT_4_BIT_5 (1UL << 5)
#define ESP32_UNIT_4_BIT_6 (1UL << 6)
#define ESP32_UNIT_4_BIT_7 (1UL << 7)
#define ESP32_UNIT_4_BIT_8 (1UL << 8)
#define ESP32_UNIT_4_BIT_9 (1UL << 9)
#define ESP32_UNIT_4_BIT_10 (1UL << 10)
#define ESP32_UNIT_4_BIT_11 (1UL << 11)
#define ESP32_UNIT_4_BIT_12 (1UL << 12)
#define ESP32_UNIT_4_BIT_13 (1UL << 13)
#define ESP32_UNIT_4_BIT_14 (1UL << 14)
#define ESP32_UNIT_4_BIT_15 (1UL << 15)
#define ESP32_UNIT_4_BIT_16 (1UL << 16)
#define ESP32_UNIT_4_BIT_17 (1UL << 17)
#define ESP32_UNIT_4_BIT_18 (1UL << 18)
#define ESP32_UNIT_4_BIT_19 (1UL << 19)
#define ESP32_UNIT_4_BIT_20 (1UL << 20)
#define ESP32_UNIT_4_BIT_21 (1UL << 21)
#define ESP32_UNIT_4_BIT_22 (1UL << 22)
#define ESP32_UNIT_4_BIT_23 (1UL << 23)
#define ESP32_UNIT_4_BIT_24 (1UL << 24)
#define ESP32_UNIT_4_BIT_25 (1UL << 25)
#define ESP32_UNIT_4_BIT_26 (1UL << 26)
#define ESP32_UNIT_4_BIT_27 (1UL << 27)
#define ESP32_UNIT_4_BIT_28 (1UL << 28)
#define ESP32_UNIT_4_BIT_29 (1UL << 29)
#define ESP32_UNIT_4_BIT_30 (1UL << 30)
#define ESP32_UNIT_4_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_5_TypeDef;
#define ESP32_UNIT_5 ((ESP32_UNIT_5_TypeDef *)(0x3FF40000UL + 5 * 0x400UL))

#define ESP32_UNIT_5_BIT_0 (1UL << 0)
#define ESP32_UNIT_5_BIT_1 (1UL << 1)
#define ESP32_UNIT_5_BIT_2 (1UL << 2)
#define ESP32_UNIT_5_BIT_3 (1UL << 3)
#define ESP32_UNIT_5_BIT_4 (1UL << 4)
#define ESP32_UNIT_5_BIT_5 (1UL << 5)
#define ESP32_UNIT_5_BIT_6 (1UL << 6)
#define ESP32_UNIT_5_BIT_7 (1UL << 7)
#define ESP32_UNIT_5_BIT_8 (1UL << 8)
#define ESP32_UNIT_5_BIT_9 (1UL << 9)
#define ESP32_UNIT_5_BIT_10 (1UL << 10)
#define ESP32_UNIT_5_BIT_11 (1UL << 11)
#define ESP32_UNIT_5_BIT_12 (1UL << 12)
#define ESP32_UNIT_5_BIT_13 (1UL << 13)
#define ESP32_UNIT_5_BIT_14 (1UL << 14)
#define ESP32_UNIT_5_BIT_15 (1UL << 15)
#define ESP32_UNIT_5_BIT_16 (1UL << 16)
#define ESP32_UNIT_5_BIT_17 (1UL << 17)
#define ESP32_UNIT_5_BIT_18 (1UL << 18)
#define ESP32_UNIT_5_BIT_19 (1UL << 19)
#define ESP32_UNIT_5_BIT_20 (1UL << 20)
#define ESP32_UNIT_5_BIT_21 (1UL << 21)
#define ESP32_UNIT_5_BIT_22 (1UL << 22)
#define ESP32_UNIT_5_BIT_23 (1UL << 23)
#define ESP32_UNIT_5_BIT_24 (1UL << 24)
#define ESP32_UNIT_5_BIT_25 (1UL << 25)
#define ESP32_UNIT_5_BIT_26 (1UL << 26)
#define ESP32_UNIT_5_BIT_27 (1UL << 27)
#define ESP32_UNIT_5_BIT_28 (1UL << 28)
#define ESP32_UNIT_5_BIT_29 (1UL << 29)
#define ESP32_UNIT_5_BIT_30 (1UL << 30)
#define ESP32_UNIT_5_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_6_TypeDef;
#define ESP32_UNIT_6 ((ESP32_UNIT_6_TypeDef *)(0x3FF40000UL + 6 * 0x400UL))

