RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_6_BIT_0 (1UL << 0)
#define ESP32_UNIT_6_BIT_1 (1UL << 1)
#define ESP32_UNIT_6_BIT_2 (1UL << 2)
#define ESP32_UNIT_6_BIT_3 (1UL << 3)
#define ESP32_UNIT_6_BIT_4 (1UL << 4)
#define ESP32_UNIT_6_BIT_5 (1UL << 5)
#define ESP32_UNIT_6_BIT_6 (1UL << 6)
#define ESP32_UNIT_6_BIT_7 (1UL << 7)
#define ESP32_UNIT_6_BIT_8 (1UL << 8)
#define ESP32_UNIT_6_BIT_9 (1UL << 9)
#define ESP32_UNIT_6_BIT_10 (1UL << 10)
#define ESP32_UNIT_6_BIT_11 (1UL << 11)
#define ESP32_UNIT_6_BIT_12 (1UL << 12)
#define ESP32_UNIT_6_BIT_13 (1UL << 13)
#define ESP32_UNIT_6_BIT_14 (1UL << 14)
#define ESP32_UNIT_6_BIT_15 (1UL << 15)
#define ESP32_UNIT_6_BIT_16 (1UL << 16)
#define ESP32_UNIT_6_BIT_17 (1UL << 17)
#define ESP32_UNIT_6_BIT_18 (1UL << 18)
#define ESP32_UNIT_6_BIT_19 (1UL << 19)
#define ESP32_UNIT_6_BIT_20 (1UL << 20)
#define ESP32_UNIT_6_BIT_21 (1UL << 21)
#define ESP32_UNIT_6_BIT_22 (1UL << 22)
#define ESP32_UNIT_6_BIT_23 (1UL << 23)
#define ESP32_UNIT_6_BIT_24 (1UL << 24)
#define ESP32_UNIT_6_BIT_25 (1UL << 25)
#define ESP32_UNIT_6_BIT_26 (1UL << 26)
#define ESP32_UNIT_6_BIT_27 (1UL << 27)
#define ESP32_UNIT_6_BIT_28 (1UL << 28)
#define ESP32_UNIT_6_BIT_29 (1UL << 29)
#define ESP32_UNIT_6_BIT_30 (1UL << 30)
#define ESP32_UNIT_6_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_7_TypeDef;
#define ESP32_UNIT_7 ((ESP32_UNIT_7_TypeDef *)(0x3FF40000UL + 7 * 0x400UL))

#define ESP32_UNIT_7_BIT_0 (1UL << 0)
#define ESP32_UNIT_7_BIT_1 (1UL << 1)
#define ESP32_UNIT_7_BIT_2 (1UL << 2)
#define ESP32_UNIT_7_BIT_3 (1UL << 3)
#define ESP32_UNIT_7_BIT_4 (1UL << 4)
#define ESP32_UNIT_7_BIT_5 (1UL << 5)
#define ESP32_UNIT_7_BIT_6 (1UL << 6)
#define ESP32_UNIT_7_BIT_7 (1UL << 7)
#define ESP32_UNIT_7_BIT_8 (1UL << 8)
#define ESP32_UNIT_7_BIT_9 (1UL << 9)
#define ESP32_UNIT_7_BIT_10 (1UL << 10)
#define ESP32_UNIT_7_BIT_11 (1UL << 11)
#define ESP32_UNIT_7_BIT_12 (1UL << 12)
#define ESP32_UNIT_7_BIT_13 (1UL << 13)
#define ESP32_UNIT_7_BIT_14 (1UL << 14)
#define ESP32_UNIT_7_BIT_15 (1UL << 15)
#define ESP32_UNIT_7_BIT_16 (1UL << 16)
#define ESP32_UNIT_7_BIT_17 (1UL << 17)
#define ESP32_UNIT_7_BIT_18 (1UL << 18)
#define ESP32_UNIT_7_BIT_19 (1UL << 19)
#define ESP32_UNIT_7_BIT_20 (1UL << 20)
#define ESP32_UNIT_7_BIT_21 (1UL << 21)
#define ESP32_UNIT_7_BIT_22 (1UL << 22)
#define ESP32_UNIT_7_BIT_23 (1UL << 23)
#define ESP32_UNIT_7_BIT_24 (1UL << 24)
#define ESP32_UNIT_7_BIT_25 (1UL << 25)
#define ESP32_UNIT_7_BIT_26 (1UL << 26)
#define ESP32_UNIT_7_BIT_27 (1UL << 27)
#define ESP32_UNIT_7_BIT_28 (1UL << 28)
#define ESP32_UNIT_7_BIT_29 (1UL << 29)
#define ESP32_UNIT_7_BIT_30 (1UL << 30)
#define ESP32_UNIT_7_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_8_TypeDef;
#define ESP32_UNIT_8 ((ESP32_UNIT_8_TypeDef *)(0x3FF40000UL + 8 * 0x400UL))

#define ESP32_UNIT_8_BIT_0 (1UL << 0)
#define ESP32_UNIT_8_BIT_1 (1UL << 1)
#define ESP32_UNIT_8_BIT_2 (1UL << 2)
#define ESP32_UNIT_8_BIT_3 (1UL << 3)
#define ESP32_UNIT_8_BIT_4 (1UL << 4)
#define ESP32_UNIT_8_BIT_5 (1UL << 5)
#define ESP32_UNIT_8_BIT_6 (1UL << 6)
#define ESP32_UNIT_8_BIT_7 (1UL << 7)
#define ESP32_UNIT_8_BIT_8 (1UL << 8)
#define ESP32_UNIT_8_BIT_9 (1UL << 9)
#define ESP32_UNIT_8_BIT_10 (1UL << 10)
#define ESP32_UNIT_8_BIT_11 (1UL << 11)
#define ESP32_UNIT_8_BIT_12 (1UL << 12)
#define ESP32_UNIT_8_BIT_13 (1UL << 13)
#define ESP32_UNIT_8_BIT_14 (1UL << 14)
#define ESP32_UNIT_8_BIT_15 (1UL << 15)
#define ESP32_UNIT_8_BIT_16 (1UL << 16)
#define ESP32_UNIT_8_BIT_17 (1UL << 17)
#define ESP32_UNIT_8_BIT_18 (1UL << 18)
#define ESP32_UNIT_8_BIT_19 (1UL << 19)
#define ESP32_UNIT_8_BIT_20 (1UL << 20)
#define ESP32_UNIT_8_BIT_21 (1UL << 21)
#define ESP32_UNIT_8_BIT_22 (1UL << 22)
#define ESP32_UNIT_8_BIT_23 (1UL << 23)
#define ESP32_UNIT_8_BIT_24 (1UL << 24)
#define ESP32_UNIT_8_BIT_25 (1UL << 25)
#define ESP32_UNIT_8_BIT_26 (1UL << 26)
#define ESP32_UNIT_8_BIT_27 (1UL << 27)
#define ESP32_UNIT_8_BIT_28 (1UL << 28)
#define ESP32_UNIT_8_BIT_29 (1UL << 29)
#define ESP32_UNIT_8_BIT_30 (1UL << 30)
#define ESP32_UNIT_8_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_9_TypeDef;
#define ESP32_UNIT_9 ((ESP32_UNIT_9_TypeDef *)(0x3FF40000UL + 9 * 0x400UL))

#define ESP32_UNIT_9_BIT_0 (1UL << 0)
#define ESP32_UNIT_9_BIT_1 (1UL << 1)
#define ESP32_UNIT_9_BIT_2 (1UL << 2)
#define ESP32_UNIT_9_BIT_3 (1UL << 3)
#define ESP32_UNIT_9_BIT_4 (1UL << 4)
#define ESP32_UNIT_9_BIT_5 (1UL << 5)
#define ESP32_UNIT_9_BIT_6 (1UL << 6)
#define ESP32_UNIT_9_BIT_7 (1UL << 7)
#define ESP32_UNIT_9_BIT_8 (1UL << 8)
#define ESP32_UNIT_9_BIT_9 (1UL << 9)
#define ESP32_UNIT_9_BIT_10 (1UL << 10)
#define ESP32_UNIT_9_BIT_11 (1UL << 11)
#define ESP32_UNIT_9_BIT_12 (1UL << 12)
#define ESP32_UNIT_9_BIT_13 (1UL << 13)
#define ESP32_UNIT_9_BIT_14 (1UL << 14)
#define ESP32_UNIT_9_BIT_15 (1UL << 15)
#define ESP32_UNIT_9_BIT_16 (1UL << 16)
#define ESP32_UNIT_9_BIT_17 (1UL << 17)
#define ESP32_UNIT_9_BIT_18 (1UL << 18)
#define ESP32_UNIT_9_BIT_19 (1UL << 19)
#define ESP32_UNIT_9_BIT_20 (1UL << 20)
#define ESP32_UNIT_9_BIT_21 (1UL << 21)
#define ESP32_UNIT_9_BIT_22 (1UL << 22)
#define ESP32_UNIT_9_BIT_23 (1UL << 23)
#define ESP32_UNIT_9_BIT_24 (1UL << 24)
#define ESP32_UNIT_9_BIT_25 (1UL << 25)
#define ESP32_UNIT_9_BIT_26 (1UL << 26)
#define ESP32_UNIT_9_BIT_27 (1UL << 27)
#define ESP32_UNIT_9_BIT_28 (1UL << 28)
#define ESP32_UNIT_9_BIT_29 (1UL << 29)
#define ESP32_UNIT_9_BIT_30 (1UL << 30)
#define ESP32_UNIT_9_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_10_TypeDef;
#define ESP32_UNIT_10 ((ESP32_UNIT_10_TypeDef *)(0x3FF40000UL + 10 * 0x400UL))

#define ESP32_UNIT_10_BIT_0 (1UL << 0)
#define ESP32_UNIT_10_BIT_1 (1UL << 1)
#define ESP32_UNIT_10_BIT_2 (1UL << 2)
#define ESP32_UNIT_10_BIT_3 (1UL << 3)
#define ESP32_UNIT_10_BIT_4 (1UL << 4)
#define ESP32_UNIT_10_BIT_5 (1UL << 5)
#define ESP32_UNIT_10_BIT_6 (1UL << 6)
#define ESP32_UNIT_10_BIT_7 (1UL << 7)
#define ESP32_UNIT_10_BIT_8 (1UL << 8)
#define ESP32_UNIT_10_BIT_9 (1UL << 9)
#define ESP32_UNIT_10_BIT_10 (1UL << 10)
#define ESP32_UNIT_10_BIT_11 (1UL << 11)
#define ESP32_UNIT_10_BIT_12 (1UL << 12)
#define ESP32_UNIT_10_BIT_13 (1UL << 13)
#define ESP32_UNIT_10_BIT_14 (1UL << 14)
#define ESP32_UNIT_10_BIT_15 (1UL << 15)
#define ESP32_UNIT_10_BIT_16 (1UL << 16)
#define ESP32_UNIT_10_BIT_17 (1UL << 17)
#define ESP32_UNIT_10_BIT_18 (1UL << 18)
#define ESP32_UNIT_10_BIT_19 (1UL << 19)
#define ESP32_UNIT_10_BIT_20 (1UL << 20)
#define ESP32_UNIT_10_BIT_21 (1UL << 21)
#define ESP32_UNIT_10_BIT_22 (1UL << 22)
#define ESP32_UNIT_10_BIT_23 (1UL << 23)
#define ESP32_UNIT_10_BIT_24 (1UL << 24)
#define ESP32_UNIT_10_BIT_25 (1UL << 25)
#define ESP32_UNIT_10_BIT_26 (1UL << 26)
#define ESP32_UNIT_10_BIT_27 (1UL << 27)
#define ESP32_UNIT_10_BIT_28 (1UL << 28)
#define ESP32_UNIT_10_BIT_29 (1UL << 29)
#define ESP32_UNIT_10_BIT_30 (1UL << 30)
#define ESP32_UNIT_10_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_11_TypeDef;
#define ESP32_UNIT_11 ((ESP32_UNIT_11_TypeDef *)(0x3FF40000UL + 11 * 0x400UL))

#define ESP32_UNIT_11_BIT_0 (1UL << 0)
#define ESP32_UNIT_11_BIT_1 (1UL << 1)
#define ESP32_UNIT_11_BIT_2 (1UL << 2)
#define ESP32_UNIT_11_BIT_3 (1UL << 3)
#define ESP32_UNIT_11_BIT_4 (1UL << 4)
#define ESP32_UNIT_11_BIT_5 (1UL << 5)
#define ESP32_UNIT_11_BIT_6 (1UL << 6)
#define ESP32_UNIT_11_BIT_7 (1UL << 7)
#define ESP32_UNIT_11_BIT_8 (1UL << 8)
#define ESP32_UNIT_11_BIT_9 (1UL << 9)
#define ESP32_UNIT_11_BIT_10 (1UL << 10)
#define ESP32_UNIT_11_BIT_11 (1UL << 11)
#define ESP32_UNIT_11_BIT_12 (1UL << 12)
#define ESP32_UNIT_11_BIT_13 (1UL << 13)
#define ESP32_UNIT_11_BIT_14 (1UL << 14)
#define ESP32_UNIT_11_BIT_15 (1UL << 15)
#define ESP32_UNIT_11_BIT_16 (1UL << 16)
#define ESP32_UNIT_11_BIT_17 (1UL << 17)
#define ESP32_UNIT_11_BIT_18 (1UL << 18)
#define ESP32_UNIT_11_BIT_19 (1UL << 19)
#define ESP32_UNIT_11_BIT_20 (1UL << 20)
#define ESP32_UNIT_11_BIT_21 (1UL << 21)
#define ESP32_UNIT_11_BIT_22 (1UL << 22)
#define ESP32_UNIT_11_BIT_23 (1UL << 23)
#define ESP32_UNIT_11_BIT_24 (1UL << 24)
#define ESP32_UNIT_11_BIT_25 (1UL << 25)
#define ESP32_UNIT_11_BIT_26 (1UL << 26)
#define ESP32_UNIT_11_BIT_27 (1UL << 27)
#define ESP32_UNIT_11_BIT_28 (1UL << 28)
#define ESP32_UNIT_11_BIT_29 (1UL << 29)
#define ESP32_UNIT_11_BIT_30 (1UL << 30)
#define ESP32_UNIT_11_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_12_TypeDef;
#define ESP32_UNIT_12 ((ESP32_UNIT_12_TypeDef *)(0x3FF40000UL + 12 * 0x400UL))

