RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_12_BIT_0 (1UL << 0)
#define ESP32_UNIT_12_BIT_1 (1UL << 1)
#define ESP32_UNIT_12_BIT_2 (1UL << 2)
#define ESP32_UNIT_12_BIT_3 (1UL << 3)
#define ESP32_UNIT_12_BIT_4 (1UL << 4)
#define ESP32_UNIT_12_BIT_5 (1UL << 5)
#define ESP32_UNIT_12_BIT_6 (1UL << 6)
#define ESP32_UNIT_12_BIT_7 (1UL << 7)
#define ESP32_UNIT_12_BIT_8 (1UL << 8)
#define ESP32_UNIT_12_BIT_9 (1UL << 9)
#define ESP32_UNIT_12_BIT_10 (1UL << 10)
#define ESP32_UNIT_12_BIT_11 (1UL << 11)
#define ESP32_UNIT_12_BIT_12 (1UL << 12)
#define ESP32_UNIT_12_BIT_13 (1UL << 13)
#define ESP32_UNIT_12_BIT_14 (1UL << 14)
#define ESP32_UNIT_12_BIT_15 (1UL << 15)
#define ESP32_UNIT_12_BIT_16 (1UL << 16)
#define ESP32_UNIT_12_BIT_17 (1UL << 17)
#define ESP32_UNIT_12_BIT_18 (1UL << 18)
#define ESP32_UNIT_12_BIT_19 (1UL << 19)
#define ESP32_UNIT_12_BIT_20 (1UL << 20)
#define ESP32_UNIT_12_BIT_21 (1UL << 21)
#define ESP32_UNIT_12_BIT_22 (1UL << 22)
#define ESP32_UNIT_12_BIT_23 (1UL << 23)
#define ESP32_UNIT_12_BIT_24 (1UL << 24)
#define ESP32_UNIT_12_BIT_25 (1UL << 25)
#define ESP32_UNIT_12_BIT_26 (1UL << 26)
#define ESP32_UNIT_12_BIT_27 (1UL << 27)
#define ESP32_UNIT_12_BIT_28 (1UL << 28)
#define ESP32_UNIT_12_BIT_29 (1UL << 29)
#define ESP32_UNIT_12_BIT_30 (1UL << 30)
#define ESP32_UNIT_12_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_13_TypeDef;
#define ESP32_UNIT_13 ((ESP32_UNIT_13_TypeDef *)(0x3FF40000UL + 13 * 0x400UL))

#define ESP32_UNIT_13_BIT_0 (1UL << 0)
#define ESP32_UNIT_13_BIT_1 (1UL << 1)
#define ESP32_UNIT_13_BIT_2 (1UL << 2)
#define ESP32_UNIT_13_BIT_3 (1UL << 3)
#define ESP32_UNIT_13_BIT_4 (1UL << 4)
#define ESP32_UNIT_13_BIT_5 (1UL << 5)
#define ESP32_UNIT_13_BIT_6 (1UL << 6)
#define ESP32_UNIT_13_BIT_7 (1UL << 7)
#define ESP32_UNIT_13_BIT_8 (1UL << 8)
#define ESP32_UNIT_13_BIT_9 (1UL << 9)
#define ESP32_UNIT_13_BIT_10 (1UL << 10)
#define ESP32_UNIT_13_BIT_11 (1UL << 11)
#define ESP32_UNIT_13_BIT_12 (1UL << 12)
#define ESP32_UNIT_13_BIT_13 (1UL << 13)
#define ESP32_UNIT_13_BIT_14 (1UL << 14)
#define ESP32_UNIT_13_BIT_15 (1UL << 15)
#define ESP32_UNIT_13_BIT_16 (1UL << 16)
#define ESP32_UNIT_13_BIT_17 (1UL << 17)
#define ESP32_UNIT_13_BIT_18 (1UL << 18)
#define ESP32_UNIT_13_BIT_19 (1UL << 19)
#define ESP32_UNIT_13_BIT_20 (1UL << 20)
#define ESP32_UNIT_13_BIT_21 (1UL << 21)
#define ESP32_UNIT_13_BIT_22 (1UL << 22)
#define ESP32_UNIT_13_BIT_23 (1UL << 23)
#define ESP32_UNIT_13_BIT_24 (1UL << 24)
#define ESP32_UNIT_13_BIT_25 (1UL << 25)
#define ESP32_UNIT_13_BIT_26 (1UL << 26)
#define ESP32_UNIT_13_BIT_27 (1UL << 27)
#define ESP32_UNIT_13_BIT_28 (1UL << 28)
#define ESP32_UNIT_13_BIT_29 (1UL << 29)
#define ESP32_UNIT_13_BIT_30 (1UL << 30)
#define ESP32_UNIT_13_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_14_TypeDef;
#define ESP32_UNIT_14 ((ESP32_UNIT_14_TypeDef *)(0x3FF40000UL + 14 * 0x400UL))

#define ESP32_UNIT_14_BIT_0 (1UL << 0)
#define ESP32_UNIT_14_BIT_1 (1UL << 1)
#define ESP32_UNIT_14_BIT_2 (1UL << 2)
#define ESP32_UNIT_14_BIT_3 (1UL << 3)
#define ESP32_UNIT_14_BIT_4 (1UL << 4)
#define ESP32_UNIT_14_BIT_5 (1UL << 5)
#define ESP32_UNIT_14_BIT_6 (1UL << 6)
#define ESP32_UNIT_14_BIT_7 (1UL << 7)
#define ESP32_UNIT_14_BIT_8 (1UL << 8)
#define ESP32_UNIT_14_BIT_9 (1UL << 9)
#define ESP32_UNIT_14_BIT_10 (1UL << 10)
#define ESP32_UNIT_14_BIT_11 (1UL << 11)
#define ESP32_UNIT_14_BIT_12 (1UL << 12)
#define ESP32_UNIT_14_BIT_13 (1UL << 13)
#define ESP32_UNIT_14_BIT_14 (1UL << 14)
#define ESP32_UNIT_14_BIT_15 (1UL << 15)
#define ESP32_UNIT_14_BIT_16 (1UL << 16)
#define ESP32_UNIT_14_BIT_17 (1UL << 17)
#define ESP32_UNIT_14_BIT_18 (1UL << 18)
#define ESP32_UNIT_14_BIT_19 (1UL << 19)
#define ESP32_UNIT_14_BIT_20 (1UL << 20)
#define ESP32_UNIT_14_BIT_21 (1UL << 21)
#define ESP32_UNIT_14_BIT_22 (1UL << 22)
#define ESP32_UNIT_14_BIT_23 (1UL << 23)
#define ESP32_UNIT_14_BIT_24 (1UL << 24)
#define ESP32_UNIT_14_BIT_25 (1UL << 25)
#define ESP32_UNIT_14_BIT_26 (1UL << 26)
#define ESP32_UNIT_14_BIT_27 (1UL << 27)
#define ESP32_UNIT_14_BIT_28 (1UL << 28)
#define ESP32_UNIT_14_BIT_29 (1UL << 29)
#define ESP32_UNIT_14_BIT_30 (1UL << 30)
#define ESP32_UNIT_14_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_15_TypeDef;
#define ESP32_UNIT_15 ((ESP32_UNIT_15_TypeDef *)(0x3FF40000UL + 15 * 0x400UL))

#define ESP32_UNIT_15_BIT_0 (1UL << 0)
#define ESP32_UNIT_15_BIT_1 (1UL << 1)
#define ESP32_UNIT_15_BIT_2 (1UL << 2)
#define ESP32_UNIT_15_BIT_3 (1UL << 3)
#define ESP32_UNIT_15_BIT_4 (1UL << 4)
#define ESP32_UNIT_15_BIT_5 (1UL << 5)
#define ESP32_UNIT_15_BIT_6 (1UL << 6)
#define ESP32_UNIT_15_BIT_7 (1UL << 7)
#define ESP32_UNIT_15_BIT_8 (1UL << 8)
#define ESP32_UNIT_15_BIT_9 (1UL << 9)
#define ESP32_UNIT_15_BIT_10 (1UL << 10)
#define ESP32_UNIT_15_BIT_11 (1UL << 11)
#define ESP32_UNIT_15_BIT_12 (1UL << 12)
#define ESP32_UNIT_15_BIT_13 (1UL << 13)
#define ESP32_UNIT_15_BIT_14 (1UL << 14)
#define ESP32_UNIT_15_BIT_15 (1UL << 15)
#define ESP32_UNIT_15_BIT_16 (1UL << 16)
#define ESP32_UNIT_15_BIT_17 (1UL << 17)
#define ESP32_UNIT_15_BIT_18 (1UL << 18)
#define ESP32_UNIT_15_BIT_19 (1UL << 19)
#define ESP32_UNIT_15_BIT_20 (1UL << 20)
#define ESP32_UNIT_15_BIT_21 (1UL << 21)
#define ESP32_UNIT_15_BIT_22 (1UL << 22)
#define ESP32_UNIT_15_BIT_23 (1UL << 23)
#define ESP32_UNIT_15_BIT_24 (1UL << 24)
#define ESP32_UNIT_15_BIT_25 (1UL << 25)
#define ESP32_UNIT_15_BIT_26 (1UL << 26)
#define ESP32_UNIT_15_BIT_27 (1UL << 27)
#define ESP32_UNIT_15_BIT_28 (1UL << 28)
#define ESP32_UNIT_15_BIT_29 (1UL << 29)
#define ESP32_UNIT_15_BIT_30 (1UL << 30)
#define ESP32_UNIT_15_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_16_TypeDef;
#define ESP32_UNIT_16 ((ESP32_UNIT_16_TypeDef *)(0x3FF40000UL + 16 * 0x400UL))

#define ESP32_UNIT_16_BIT_0 (1UL << 0)
#define ESP32_UNIT_16_BIT_1 (1UL << 1)
#define ESP32_UNIT_16_BIT_2 (1UL << 2)
#define ESP32_UNIT_16_BIT_3 (1UL << 3)
#define ESP32_UNIT_16_BIT_4 (1UL << 4)
#define ESP32_UNIT_16_BIT_5 (1UL << 5)
#define ESP32_UNIT_16_BIT_6 (1UL << 6)
#define ESP32_UNIT_16_BIT_7 (1UL << 7)
#define ESP32_UNIT_16_BIT_8 (1UL << 8)
#define ESP32_UNIT_16_BIT_9 (1UL << 9)
#define ESP32_UNIT_16_BIT_10 (1UL << 10)
#define ESP32_UNIT_16_BIT_11 (1UL << 11)
#define ESP32_UNIT_16_BIT_12 (1UL << 12)
#define ESP32_UNIT_16_BIT_13 (1UL << 13)
#define ESP32_UNIT_16_BIT_14 (1UL << 14)
#define ESP32_UNIT_16_BIT_15 (1UL << 15)
#define ESP32_UNIT_16_BIT_16 (1UL << 16)
#define ESP32_UNIT_16_BIT_17 (1UL << 17)
#define ESP32_UNIT_16_BIT_18 (1UL << 18)
#define ESP32_UNIT_16_BIT_19 (1UL << 19)
#define ESP32_UNIT_16_BIT_20 (1UL << 20)
#define ESP32_UNIT_16_BIT_21 (1UL << 21)
#define ESP32_UNIT_16_BIT_22 (1UL << 22)
#define ESP32_UNIT_16_BIT_23 (1UL << 23)
#define ESP32_UNIT_16_BIT_24 (1UL << 24)
#define ESP32_UNIT_16_BIT_25 (1UL << 25)
#define ESP32_UNIT_16_BIT_26 (1UL << 26)
#define ESP32_UNIT_16_BIT_27 (1UL << 27)
#define ESP32_UNIT_16_BIT_28 (1UL << 28)
#define ESP32_UNIT_16_BIT_29 (1UL << 29)
#define ESP32_UNIT_16_BIT_30 (1UL << 30)
#define ESP32_UNIT_16_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_17_TypeDef;
#define ESP32_UNIT_17 ((ESP32_UNIT_17_TypeDef *)(0x3FF40000UL + 17 * 0x400UL))

#define ESP32_UNIT_17_BIT_0 (1UL << 0)
#define ESP32_UNIT_17_BIT_1 (1UL << 1)
#define ESP32_UNIT_17_BIT_2 (1UL << 2)
#define ESP32_UNIT_17_BIT_3 (1UL << 3)
#define ESP32_UNIT_17_BIT_4 (1UL << 4)
#define ESP32_UNIT_17_BIT_5 (1UL << 5)
#define ESP32_UNIT_17_BIT_6 (1UL << 6)
#define ESP32_UNIT_17_BIT_7 (1UL << 7)
#define ESP32_UNIT_17_BIT_8 (1UL << 8)
#define ESP32_UNIT_17_BIT_9 (1UL << 9)
#define ESP32_UNIT_17_BIT_10 (1UL << 10)
#define ESP32_UNIT_17_BIT_11 (1UL << 11)
#define ESP32_UNIT_17_BIT_12 (1UL << 12)
#define ESP32_UNIT_17_BIT_13 (1UL << 13)
#define ESP32_UNIT_17_BIT_14 (1UL << 14)
#define ESP32_UNIT_17_BIT_15 (1UL << 15)
#define ESP32_UNIT_17_BIT_16 (1UL << 16)
#define ESP32_UNIT_17_BIT_17 (1UL << 17)
#define ESP32_UNIT_17_BIT_18 (1UL << 18)
#define ESP32_UNIT_17_BIT_19 (1UL << 19)
#define ESP32_UNIT_17_BIT_20 (1UL << 20)
#define ESP32_UNIT_17_BIT_21 (1UL << 21)
#define ESP32_UNIT_17_BIT_22 (1UL << 22)
#define ESP32_UNIT_17_BIT_23 (1UL << 23)
#define ESP32_UNIT_17_BIT_24 (1UL << 24)
#define ESP32_UNIT_17_BIT_25 (1UL << 25)
#define ESP32_UNIT_17_BIT_26 (1UL << 26)
#define ESP32_UNIT_17_BIT_27 (1UL << 27)
#define ESP32_UNIT_17_BIT_28 (1UL << 28)
#define ESP32_UNIT_17_BIT_29 (1UL << 29)
#define ESP32_UNIT_17_BIT_30 (1UL << 30)
#define ESP32_UNIT_17_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_18_TypeDef;
#define ESP32_UNIT_18 ((ESP32_UNIT_18_TypeDef *)(0x3FF40000UL + 18 * 0x400UL))

#define ESP32_UNIT_18_BIT_0 (1UL << 0)
#define ESP32_UNIT_18_BIT_1 (1UL << 1)
#define ESP32_UNIT_18_BIT_2 (1UL << 2)
#define ESP32_UNIT_18_BIT_3 (1UL << 3)
#define ESP32_UNIT_18_BIT_4 (1UL << 4)
#define ESP32_UNIT_18_BIT_5 (1UL << 5)
#define ESP32_UNIT_18_BIT_6 (1UL << 6)
#define ESP32_UNIT_18_BIT_7 (1UL << 7)
#define ESP32_UNIT_18_BIT_8 (1UL << 8)
#define ESP32_UNIT_18_BIT_9 (1UL << 9)
#define ESP32_UNIT_18_BIT_10 (1UL << 10)
#define ESP32_UNIT_18_BIT_11 (1UL << 11)
#define ESP32_UNIT_18_BIT_12 (1UL << 12)
#define ESP32_UNIT_18_BIT_13 (1UL << 13)
#define ESP32_UNIT_18_BIT_14 (1UL << 14)
#define ESP32_UNIT_18_BIT_15 (1UL << 15)
#define ESP32_UNIT_18_BIT_16 (1UL << 16)
#define ESP32_UNIT_18_BIT_17 (1UL << 17)
#define ESP32_UNIT_18_BIT_18 (1UL << 18)
#define ESP32_UNIT_18_BIT_19 (1UL << 19)
#define ESP32_UNIT_18_BIT_20 (1UL << 20)
#define ESP32_UNIT_18_BIT_21 (1UL << 21)
#define ESP32_UNIT_18_BIT_22 (1UL << 22)
#define ESP32_UNIT_18_BIT_23 (1UL << 23)
#define ESP32_UNIT_18_BIT_24 (1UL << 24)
#define ESP32_UNIT_18_BIT_25 (1UL << 25)
#define ESP32_UNIT_18_BIT_26 (1UL << 26)
#define ESP32_UNIT_18_BIT_27 (1UL << 27)
#define ESP32_UNIT_18_BIT_28 (1UL << 28)
#define ESP32_UNIT_18_BIT_29 (1UL << 29)
#define ESP32_UNIT_18_BIT_30 (1UL << 30)
#define ESP32_UNIT_18_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_19_TypeDef;
#define ESP32_UNIT_19 ((ESP32_UNIT_19_TypeDef *)(0x3FF40000UL + 19 * 0x400UL))

#define ESP32_UNIT_19_BIT_0 (1UL << 0)
#define ESP32_UNIT_19_BIT_1 (1UL << 1)
#define ESP32_UNIT_19_BIT_2 (1UL << 2)
#define ESP32_UNIT_19_BIT_3 (1UL << 3)
#define ESP32_UNIT_19_BIT_4 (1UL << 4)
#define ESP32_UNIT_19_BIT_5 (1UL << 5)
#define ESP32_UNIT_19_BIT_6 (1UL << 6)
#define ESP32_UNIT_19_BIT_7 (1UL << 7)
#define ESP32_UNIT_19_BIT_8 (1UL << 8)
#define ESP32_UNIT_19_BIT_9 (1UL << 9)
#define ESP32_UNIT_19_BIT_10 (1UL << 10)
#define ESP32_UNIT_19_BIT_11 (1UL << 11)
#define ESP32_UNIT_19_BIT_12 (1UL << 12)
#define ESP32_UNIT_19_BIT_13 (1UL << 13)
#define ESP32_UNIT_19_BIT_14 (1UL << 14)
#define ESP32_UNIT_19_BIT_15 (1UL << 15)
#define ESP32_UNIT_19_BIT_16 (1UL << 16)
#define ESP32_UNIT_19_BIT_17 (1UL << 17)
#define ESP32_UNIT_19_BIT_18 (1UL << 18)
#define ESP32_UNIT_19_BIT_19 (1UL << 19)
#define ESP32_UNIT_19_BIT_20 (1UL << 20)
#define ESP32_UNIT_19_BIT_21 (1UL << 21)
#define ESP32_UNIT_19_BIT_22 (1UL << 22)
#define ESP32_UNIT_19_BIT_23 (1UL << 23)
#define ESP32_UNIT_19_BIT_24 (1UL << 24)
#define ESP32_UNIT_19_BIT_25 (1UL << 25)
#define ESP32_UNIT_19_BIT_26 (1UL << 26)
#define ESP32_UNIT_19_BIT_27 (1UL << 27)
#define ESP32_UNIT_19_BIT_28 (1UL << 28)
#define ESP32_UNIT_19_BIT_29 (1UL << 29)
#define ESP32_UNIT_19_BIT_30 (1UL << 30)
#define ESP32_UNIT_19_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_20_TypeDef;
#define ESP32_UNIT_20 ((ESP32_UNIT_20_TypeDef *)(0x3FF40000UL + 20 * 0x400UL))

#define ESP32_UNIT_20_BIT_0 (1UL << 0)
#define ESP32_UNIT_20_BIT_1 (1UL << 1)
#define ESP32_UNIT_20_BIT_2 (1UL << 2)
#define ESP32_UNIT_20_BIT_3 (1UL << 3)
#define ESP32_UNIT_20_BIT_4 (1UL << 4)
#define ESP32_UNIT_20_BIT_5 (1UL << 5)
#define ESP32_UNIT_20_BIT_6 (1UL << 6)
#define ESP32_UNIT_20_BIT_7 (1UL << 7)
#define ESP32_UNIT_20_BIT_8 (1UL << 8)
#define ESP32_UNIT_20_BIT_9 (1UL << 9)
#define ESP32_UNIT_20_BIT_10 (1UL << 10)
#define ESP32_UNIT_20_BIT_11 (1UL << 11)
#define ESP32_UNIT_20_BIT_12 (1UL << 12)
#define ESP32_UNIT_20_BIT_13 (1UL << 13)
#define ESP32_UNIT_20_BIT_14 (1UL << 14)
#define ESP32_UNIT_20_BIT_15 (1UL << 15)
#define ESP32_UNIT_20_BIT_16 (1UL << 16)
#define ESP32_UNIT_20_BIT_17 (1UL << 17)
#define ESP32_UNIT_20_BIT_18 (1UL << 18)
#define ESP32_UNIT_20_BIT_19 (1UL << 19)
#define ESP32_UNIT_20_BIT_20 (1UL << 20)
#define ESP32_UNIT_20_BIT_21 (1UL << 21)
#define ESP32_UNIT_20_BIT_22 (1UL << 22)
#define ESP32_UNIT_20_BIT_23 (1UL << 23)
#define ESP32_UNIT_20_BIT_24 (1UL << 24)
#define ESP32_UNIT_20_BIT_25 (1UL << 25)
#define ESP32_UNIT_20_BIT_26 (1UL << 26)
#define ESP32_UNIT_20_BIT_27 (1UL << 27)
#define ESP32_UNIT_20_BIT_28 (1UL << 28)
#define ESP32_UNIT_20_BIT_29 (1UL << 29)
#define ESP32_UNIT_20_BIT_30 (1UL << 30)
#define ESP32_UNIT_20_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_21_TypeDef;
#define ESP32_UNIT_21 ((ESP32_UNIT_21_TypeDef *)(0x3FF40000UL + 21 * 0x400UL))

#define ESP32_UNIT_21_BIT_0 (1UL << 0)
#define ESP32_UNIT_21_BIT_1 (1UL << 1)
#define ESP32_UNIT_21_BIT_2 (1UL << 2)
#define ESP32_UNIT_21_BIT_3 (1UL << 3)
#define ESP32_UNIT_21_BIT_4 (1UL << 4)
#define ESP32_UNIT_21_BIT_5 (1UL << 5)
#define ESP32_UNIT_21_BIT_6 (1UL << 6)
#define ESP32_UNIT_21_BIT_7 (1UL << 7)
#define ESP32_UNIT_21_BIT_8 (1UL << 8)
#define ESP32_UNIT_21_BIT_9 (1UL << 9)
#define ESP32_UNIT_21_BIT_10 (1UL << 10)
#define ESP32_UNIT_21_BIT_11 (1UL << 11)
#define ESP32_UNIT_21_BIT_12 (1UL << 12)
#define ESP32_UNIT_21_BIT_13 (1UL << 13)
#define ESP32_UNIT_21_BIT_14 (1UL << 14)
#define ESP32_UNIT_21_BIT_15 (1UL << 15)
#define ESP32_UNIT_21_BIT_16 (1UL << 16)
#define ESP32_UNIT_21_BIT_17 (1UL << 17)
#define ESP32_UNIT_21_BIT_18 (1UL << 18)
#define ESP32_UNIT_21_BIT_19 (1UL << 19)
#define ESP32_UNIT_21_BIT_20 (1UL << 20)
#define ESP32_UNIT_21_BIT_21 (1UL << 21)
#define ESP32_UNIT_21_BIT_22 (1UL << 22)
#define ESP32_UNIT_21_BIT_23 (1UL << 23)
#define ESP32_UNIT_21_BIT_24 (1UL << 24)
#define ESP32_UNIT_21_BIT_25 (1UL << 25)
#define ESP32_UNIT_21_BIT_26 (1UL << 26)
#define ESP32_UNIT_21_BIT_27 (1UL << 27)
#define ESP32_UNIT_21_BIT_28 (1UL << 28)
#define ESP32_UNIT_21_BIT_29 (1UL << 29)
#define ESP32_UNIT_21_BIT_30 (1UL << 30)
#define ESP32_UNIT_21_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_22_TypeDef;
#define ESP32_UNIT_22 ((ESP32_UNIT_22_TypeDef *)(0x3FF40000UL + 22 * 0x400UL))

#define ESP32_UNIT_22_BIT_0 (1UL << 0)
#define ESP32_UNIT_22_BIT_1 (1UL << 1)
#define ESP32_UNIT_22_BIT_2 (1UL << 2)
#define ESP32_UNIT_22_BIT_3 (1UL << 3)
#define ESP32_UNIT_22_BIT_4 (1UL << 4)
#define ESP32_UNIT_22_BIT_5 (1UL << 5)
#define ESP32_UNIT_22_BIT_6 (1UL << 6)
#define ESP32_UNIT_22_BIT_7 (1UL << 7)
#define ESP32_UNIT_22_BIT_8 (1UL << 8)
#define ESP32_UNIT_22_BIT_9 (1UL << 9)
#define ESP32_UNIT_22_BIT_10 (1UL << 10)
#define ESP32_UNIT_22_BIT_11 (1UL << 11)
#define ESP32_UNIT_22_BIT_12 (1UL << 12)
#define ESP32_UNIT_22_BIT_13 (1UL << 13)
#define ESP32_UNIT_22_BIT_14 (1UL << 14)
#define ESP32_UNIT_22_BIT_15 (1UL << 15)
#define ESP32_UNIT_22_BIT_16 (1UL << 16)
#define ESP32_UNIT_22_BIT_17 (1UL << 17)
#define ESP32_UNIT_22_BIT_18 (1UL << 18)
#define ESP32_UNIT_22_BIT_19 (1UL << 19)
#define ESP32_UNIT_22_BIT_20 (1UL << 20)
#define ESP32_UNIT_22_BIT_21 (1UL << 21)
#define ESP32_UNIT_22_BIT_22 (1UL << 22)
#define ESP32_UNIT_22_BIT_23 (1UL << 23)
#define ESP32_UNIT_22_BIT_24 (1UL << 24)
#define ESP32_UNIT_22_BIT_25 (1UL << 25)
#define ESP32_UNIT_22_BIT_26 (1UL << 26)
#define ESP32_UNIT_22_BIT_27 (1UL << 27)
#define ESP32_UNIT_22_BIT_28 (1UL << 28)
#define ESP32_UNIT_22_BIT_29 (1UL << 29)
#define ESP32_UNIT_22_BIT_30 (1UL << 30)
#define ESP32_UNIT_22_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_23_TypeDef;
#define ESP32_UNIT_23 ((ESP32_UNIT_23_TypeDef *)(0x3FF40000UL + 23 * 0x400UL))

