RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_23_BIT_0 (1UL << 0)
#define ESP32_UNIT_23_BIT_1 (1UL << 1)
#define ESP32_UNIT_23_BIT_2 (1UL << 2)
#define ESP32_UNIT_23_BIT_3 (1UL << 3)
#define ESP32_UNIT_23_BIT_4 (1UL << 4)
#define ESP32_UNIT_23_BIT_5 (1UL << 5)
#define ESP32_UNIT_23_BIT_6 (1UL << 6)
#define ESP32_UNIT_23_BIT_7 (1UL << 7)
#define ESP32_UNIT_23_BIT_8 (1UL << 8)
#define ESP32_UNIT_23_BIT_9 (1UL << 9)
#define ESP32_UNIT_23_BIT_10 (1UL << 10)
#define ESP32_UNIT_23_BIT_11 (1UL << 11)
#define ESP32_UNIT_23_BIT_12 (1UL << 12)
#define ESP32_UNIT_23_BIT_13 (1UL << 13)
#define ESP32_UNIT_23_BIT_14 (1UL << 14)
#define ESP32_UNIT_23_BIT_15 (1UL << 15)
#define ESP32_UNIT_23_BIT_16 (1UL << 16)
#define ESP32_UNIT_23_BIT_17 (1UL << 17)
#define ESP32_UNIT_23_BIT_18 (1UL << 18)
#define ESP32_UNIT_23_BIT_19 (1UL << 19)
#define ESP32_UNIT_23_BIT_20 (1UL << 20)
#define ESP32_UNIT_23_BIT_21 (1UL << 21)
#define ESP32_UNIT_23_BIT_22 (1UL << 22)
#define ESP32_UNIT_23_BIT_23 (1UL << 23)
#define ESP32_UNIT_23_BIT_24 (1UL << 24)
#define ESP32_UNIT_23_BIT_25 (1UL << 25)
#define ESP32_UNIT_23_BIT_26 (1UL << 26)
#define ESP32_UNIT_23_BIT_27 (1UL << 27)
#define ESP32_UNIT_23_BIT_28 (1UL << 28)
#define ESP32_UNIT_23_BIT_29 (1UL << 29)
#define ESP32_UNIT_23_BIT_30 (1UL << 30)
#define ESP32_UNIT_23_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_24_TypeDef;
#define ESP32_UNIT_24 ((ESP32_UNIT_24_TypeDef *)(0x3FF40000UL + 24 * 0x400UL))

#define ESP32_UNIT_24_BIT_0 (1UL << 0)
#define ESP32_UNIT_24_BIT_1 (1UL << 1)
#define ESP32_UNIT_24_BIT_2 (1UL << 2)
#define ESP32_UNIT_24_BIT_3 (1UL << 3)
#define ESP32_UNIT_24_BIT_4 (1UL << 4)
#define ESP32_UNIT_24_BIT_5 (1UL << 5)
#define ESP32_UNIT_24_BIT_6 (1UL << 6)
#define ESP32_UNIT_24_BIT_7 (1UL << 7)
#define ESP32_UNIT_24_BIT_8 (1UL << 8)
#define ESP32_UNIT_24_BIT_9 (1UL << 9)
#define ESP32_UNIT_24_BIT_10 (1UL << 10)
#define ESP32_UNIT_24_BIT_11 (1UL << 11)
#define ESP32_UNIT_24_BIT_12 (1UL << 12)
#define ESP32_UNIT_24_BIT_13 (1UL << 13)
#define ESP32_UNIT_24_BIT_14 (1UL << 14)
#define ESP32_UNIT_24_BIT_15 (1UL << 15)
#define ESP32_UNIT_24_BIT_16 (1UL << 16)
#define ESP32_UNIT_24_BIT_17 (1UL << 17)
#define ESP32_UNIT_24_BIT_18 (1UL << 18)
#define ESP32_UNIT_24_BIT_19 (1UL << 19)
#define ESP32_UNIT_24_BIT_20 (1UL << 20)
#define ESP32_UNIT_24_BIT_21 (1UL << 21)
#define ESP32_UNIT_24_BIT_22 (1UL << 22)
#define ESP32_UNIT_24_BIT_23 (1UL << 23)
#define ESP32_UNIT_24_BIT_24 (1UL << 24)
#define ESP32_UNIT_24_BIT_25 (1UL << 25)
#define ESP32_UNIT_24_BIT_26 (1UL << 26)
#define ESP32_UNIT_24_BIT_27 (1UL << 27)
#define ESP32_UNIT_24_BIT_28 (1UL << 28)
#define ESP32_UNIT_24_BIT_29 (1UL << 29)
#define ESP32_UNIT_24_BIT_30 (1UL << 30)
#define ESP32_UNIT_24_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_25_TypeDef;
#define ESP32_UNIT_25 ((ESP32_UNIT_25_TypeDef *)(0x3FF40000UL + 25 * 0x400UL))

#define ESP32_UNIT_25_BIT_0 (1UL << 0)
#define ESP32_UNIT_25_BIT_1 (1UL << 1)
#define ESP32_UNIT_25_BIT_2 (1UL << 2)
#define ESP32_UNIT_25_BIT_3 (1UL << 3)
#define ESP32_UNIT_25_BIT_4 (1UL << 4)
#define ESP32_UNIT_25_BIT_5 (1UL << 5)
#define ESP32_UNIT_25_BIT_6 (1UL << 6)
#define ESP32_UNIT_25_BIT_7 (1UL << 7)
#define ESP32_UNIT_25_BIT_8 (1UL << 8)
#define ESP32_UNIT_25_BIT_9 (1UL << 9)
#define ESP32_UNIT_25_BIT_10 (1UL << 10)
#define ESP32_UNIT_25_BIT_11 (1UL << 11)
#define ESP32_UNIT_25_BIT_12 (1UL << 12)
#define ESP32_UNIT_25_BIT_13 (1UL << 13)
#define ESP32_UNIT_25_BIT_14 (1UL << 14)
#define ESP32_UNIT_25_BIT_15 (1UL << 15)
#define ESP32_UNIT_25_BIT_16 (1UL << 16)
#define ESP32_UNIT_25_BIT_17 (1UL << 17)
#define ESP32_UNIT_25_BIT_18 (1UL << 18)
#define ESP32_UNIT_25_BIT_19 (1UL << 19)
#define ESP32_UNIT_25_BIT_20 (1UL << 20)
#define ESP32_UNIT_25_BIT_21 (1UL << 21)
#define ESP32_UNIT_25_BIT_22 (1UL << 22)
#define ESP32_UNIT_25_BIT_23 (1UL << 23)
#define ESP32_UNIT_25_BIT_24 (1UL << 24)
#define ESP32_UNIT_25_BIT_25 (1UL << 25)
#define ESP32_UNIT_25_BIT_26 (1UL << 26)
#define ESP32_UNIT_25_BIT_27 (1UL << 27)
#define ESP32_UNIT_25_BIT_28 (1UL << 28)
#define ESP32_UNIT_25_BIT_29 (1UL << 29)
#define ESP32_UNIT_25_BIT_30 (1UL << 30)
#define ESP32_UNIT_25_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_26_TypeDef;
#define ESP32_UNIT_26 ((ESP32_UNIT_26_TypeDef *)(0x3FF40000UL + 26 * 0x400UL))

#define ESP32_UNIT_26_BIT_0 (1UL << 0)
#define ESP32_UNIT_26_BIT_1 (1UL << 1)
#define ESP32_UNIT_26_BIT_2 (1UL << 2)
#define ESP32_UNIT_26_BIT_3 (1UL << 3)
#define ESP32_UNIT_26_BIT_4 (1UL << 4)
#define ESP32_UNIT_26_BIT_5 (1UL << 5)
#define ESP32_UNIT_26_BIT_6 (1UL << 6)
#define ESP32_UNIT_26_BIT_7 (1UL << 7)
#define ESP32_UNIT_26_BIT_8 (1UL << 8)
#define ESP32_UNIT_26_BIT_9 (1UL << 9)
#define ESP32_UNIT_26_BIT_10 (1UL << 10)
#define ESP32_UNIT_26_BIT_11 (1UL << 11)
#define ESP32_UNIT_26_BIT_12 (1UL << 12)
#define ESP32_UNIT_26_BIT_13 (1UL << 13)
#define ESP32_UNIT_26_BIT_14 (1UL << 14)
#define ESP32_UNIT_26_BIT_15 (1UL << 15)
#define ESP32_UNIT_26_BIT_16 (1UL << 16)
#define ESP32_UNIT_26_BIT_17 (1UL << 17)
#define ESP32_UNIT_26_BIT_18 (1UL << 18)
#define ESP32_UNIT_26_BIT_19 (1UL << 19)
#define ESP32_UNIT_26_BIT_20 (1UL << 20)
#define ESP32_UNIT_26_BIT_21 (1UL << 21)
#define ESP32_UNIT_26_BIT_22 (1UL << 22)
#define ESP32_UNIT_26_BIT_23 (1UL << 23)
#define ESP32_UNIT_26_BIT_24 (1UL << 24)
#define ESP32_UNIT_26_BIT_25 (1UL << 25)
#define ESP32_UNIT_26_BIT_26 (1UL << 26)
#define ESP32_UNIT_26_BIT_27 (1UL << 27)
#define ESP32_UNIT_26_BIT_28 (1UL << 28)
#define ESP32_UNIT_26_BIT_29 (1UL << 29)
#define ESP32_UNIT_26_BIT_30 (1UL << 30)
#define ESP32_UNIT_26_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_27_TypeDef;
#define ESP32_UNIT_27 ((ESP32_UNIT_27_TypeDef *)(0x3FF40000UL + 27 * 0x400UL))

#define ESP32_UNIT_27_BIT_0 (1UL << 0)
#define ESP32_UNIT_27_BIT_1 (1UL << 1)
#define ESP32_UNIT_27_BIT_2 (1UL << 2)
#define ESP32_UNIT_27_BIT_3 (1UL << 3)
#define ESP32_UNIT_27_BIT_4 (1UL << 4)
#define ESP32_UNIT_27_BIT_5 (1UL << 5)
#define ESP32_UNIT_27_BIT_6 (1UL << 6)
#define ESP32_UNIT_27_BIT_7 (1UL << 7)
#define ESP32_UNIT_27_BIT_8 (1UL << 8)
#define ESP32_UNIT_27_BIT_9 (1UL << 9)
#define ESP32_UNIT_27_BIT_10 (1UL << 10)
#define ESP32_UNIT_27_BIT_11 (1UL << 11)
#define ESP32_UNIT_27_BIT_12 (1UL << 12)
#define ESP32_UNIT_27_BIT_13 (1UL << 13)
#define ESP32_UNIT_27_BIT_14 (1UL << 14)
#define ESP32_UNIT_27_BIT_15 (1UL << 15)
#define ESP32_UNIT_27_BIT_16 (1UL << 16)
#define ESP32_UNIT_27_BIT_17 (1UL << 17)
#define ESP32_UNIT_27_BIT_18 (1UL << 18)
#define ESP32_UNIT_27_BIT_19 (1UL << 19)
#define ESP32_UNIT_27_BIT_20 (1UL << 20)
#define ESP32_UNIT_27_BIT_21 (1UL << 21)
#define ESP32_UNIT_27_BIT_22 (1UL << 22)
#define ESP32_UNIT_27_BIT_23 (1UL << 23)
#define ESP32_UNIT_27_BIT_24 (1UL << 24)
#define ESP32_UNIT_27_BIT_25 (1UL << 25)
#define ESP32_UNIT_27_BIT_26 (1UL << 26)
#define ESP32_UNIT_27_BIT_27 (1UL << 27)
#define ESP32_UNIT_27_BIT_28 (1UL << 28)
#define ESP32_UNIT_27_BIT_29 (1UL << 29)
#define ESP32_UNIT_27_BIT_30 (1UL << 30)
#define ESP32_UNIT_27_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_28_TypeDef;
#define ESP32_UNIT_28 ((ESP32_UNIT_28_TypeDef *)(0x3FF40000UL + 28 * 0x400UL))

#define ESP32_UNIT_28_BIT_0 (1UL << 0)
#define ESP32_UNIT_28_BIT_1 (1UL << 1)
#define ESP32_UNIT_28_BIT_2 (1UL << 2)
#define ESP32_UNIT_28_BIT_3 (1UL << 3)
#define ESP32_UNIT_28_BIT_4 (1UL << 4)
#define ESP32_UNIT_28_BIT_5 (1UL << 5)
#define ESP32_UNIT_28_BIT_6 (1UL << 6)
#define ESP32_UNIT_28_BIT_7 (1UL << 7)
#define ESP32_UNIT_28_BIT_8 (1UL << 8)
#define ESP32_UNIT_28_BIT_9 (1UL << 9)
#define ESP32_UNIT_28_BIT_10 (1UL << 10)
#define ESP32_UNIT_28_BIT_11 (1UL << 11)
#define ESP32_UNIT_28_BIT_12 (1UL << 12)
#define ESP32_UNIT_28_BIT_13 (1UL << 13)
#define ESP32_UNIT_28_BIT_14 (1UL << 14)
#define ESP32_UNIT_28_BIT_15 (1UL << 15)
#define ESP32_UNIT_28_BIT_16 (1UL << 16)
#define ESP32_UNIT_28_BIT_17 (1UL << 17)
#define ESP32_UNIT_28_BIT_18 (1UL << 18)
#define ESP32_UNIT_28_BIT_19 (1UL << 19)
#define ESP32_UNIT_28_BIT_20 (1UL << 20)
#define ESP32_UNIT_28_BIT_21 (1UL << 21)
#define ESP32_UNIT_28_BIT_22 (1UL << 22)
#define ESP32_UNIT_28_BIT_23 (1UL << 23)
#define ESP32_UNIT_28_BIT_24 (1UL << 24)
#define ESP32_UNIT_28_BIT_25 (1UL << 25)
#define ESP32_UNIT_28_BIT_26 (1UL << 26)
#define ESP32_UNIT_28_BIT_27 (1UL << 27)
#define ESP32_UNIT_28_BIT_28 (1UL << 28)
#define ESP32_UNIT_28_BIT_29 (1UL << 29)
#define ESP32_UNIT_28_BIT_30 (1UL << 30)
#define ESP32_UNIT_28_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_29_TypeDef;
#define ESP32_UNIT_29 ((ESP32_UNIT_29_TypeDef *)(0x3FF40000UL + 29 * 0x400UL))

#define ESP32_UNIT_29_BIT_0 (1UL << 0)
#define ESP32_UNIT_29_BIT_1 (1UL << 1)
#define ESP32_UNIT_29_BIT_2 (1UL << 2)
#define ESP32_UNIT_29_BIT_3 (1UL << 3)
#define ESP32_UNIT_29_BIT_4 (1UL << 4)
#define ESP32_UNIT_29_BIT_5 (1UL << 5)
#define ESP32_UNIT_29_BIT_6 (1UL << 6)
#define ESP32_UNIT_29_BIT_7 (1UL << 7)
#define ESP32_UNIT_29_BIT_8 (1UL << 8)
#define ESP32_UNIT_29_BIT_9 (1UL << 9)
#define ESP32_UNIT_29_BIT_10 (1UL << 10)
#define ESP32_UNIT_29_BIT_11 (1UL << 11)
#define ESP32_UNIT_29_BIT_12 (1UL << 12)
#define ESP32_UNIT_29_BIT_13 (1UL << 13)
#define ESP32_UNIT_29_BIT_14 (1UL << 14)
#define ESP32_UNIT_29_BIT_15 (1UL << 15)
#define ESP32_UNIT_29_BIT_16 (1UL << 16)
#define ESP32_UNIT_29_BIT_17 (1UL << 17)
#define ESP32_UNIT_29_BIT_18 (1UL << 18)
#define ESP32_UNIT_29_BIT_19 (1UL << 19)
#define ESP32_UNIT_29_BIT_20 (1UL << 20)
#define ESP32_UNIT_29_BIT_21 (1UL << 21)
#define ESP32_UNIT_29_BIT_22 (1UL << 22)
#define ESP32_UNIT_29_BIT_23 (1UL << 23)
#define ESP32_UNIT_29_BIT_24 (1UL << 24)
#define ESP32_UNIT_29_BIT_25 (1UL << 25)
#define ESP32_UNIT_29_BIT_26 (1UL << 26)
#define ESP32_UNIT_29_BIT_27 (1UL << 27)
#define ESP32_UNIT_29_BIT_28 (1UL << 28)
#define ESP32_UNIT_29_BIT_29 (1UL << 29)
#define ESP32_UNIT_29_BIT_30 (1UL << 30)
#define ESP32_UNIT_29_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_30_TypeDef;
#define ESP32_UNIT_30 ((ESP32_UNIT_30_TypeDef *)(0x3FF40000UL + 30 * 0x400UL))

#define ESP32_UNIT_30_BIT_0 (1UL << 0)
#define ESP32_UNIT_30_BIT_1 (1UL << 1)
#define ESP32_UNIT_30_BIT_2 (1UL << 2)
#define ESP32_UNIT_30_BIT_3 (1UL << 3)
#define ESP32_UNIT_30_BIT_4 (1UL << 4)
#define ESP32_UNIT_30_BIT_5 (1UL << 5)
#define ESP32_UNIT_30_BIT_6 (1UL << 6)
#define ESP32_UNIT_30_BIT_7 (1UL << 7)
#define ESP32_UNIT_30_BIT_8 (1UL << 8)
#define ESP32_UNIT_30_BIT_9 (1UL << 9)
#define ESP32_UNIT_30_BIT_10 (1UL << 10)
#define ESP32_UNIT_30_BIT_11 (1UL << 11)
#define ESP32_UNIT_30_BIT_12 (1UL << 12)
#define ESP32_UNIT_30_BIT_13 (1UL << 13)
#define ESP32_UNIT_30_BIT_14 (1UL << 14)
#define ESP32_UNIT_30_BIT_15 (1UL << 15)
#define ESP32_UNIT_30_BIT_16 (1UL << 16)
#define ESP32_UNIT_30_BIT_17 (1UL << 17)
#define ESP32_UNIT_30_BIT_18 (1UL << 18)
#define ESP32_UNIT_30_BIT_19 (1UL << 19)
#define ESP32_UNIT_30_BIT_20 (1UL << 20)
#define ESP32_UNIT_30_BIT_21 (1UL << 21)
#define ESP32_UNIT_30_BIT_22 (1UL << 22)
#define ESP32_UNIT_30_BIT_23 (1UL << 23)
#define ESP32_UNIT_30_BIT_24 (1UL << 24)
#define ESP32_UNIT_30_BIT_25 (1UL << 25)
#define ESP32_UNIT_30_BIT_26 (1UL << 26)
#define ESP32_UNIT_30_BIT_27 (1UL << 27)
#define ESP32_UNIT_30_BIT_28 (1UL << 28)
#define ESP32_UNIT_30_BIT_29 (1UL << 29)
#define ESP32_UNIT_30_BIT_30 (1UL << 30)
#define ESP32_UNIT_30_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_31_TypeDef;
#define ESP32_UNIT_31 ((ESP32_UNIT_31_TypeDef *)(0x3FF40000UL + 31 * 0x400UL))

#define ESP32_UNIT_31_BIT_0 (1UL << 0)
#define ESP32_UNIT_31_BIT_1 (1UL << 1)
#define ESP32_UNIT_31_BIT_2 (1UL << 2)
#define ESP32_UNIT_31_BIT_3 (1UL << 3)
#define ESP32_UNIT_31_BIT_4 (1UL << 4)
#define ESP32_UNIT_31_BIT_5 (1UL << 5)
#define ESP32_UNIT_31_BIT_6 (1UL << 6)
#define ESP32_UNIT_31_BIT_7 (1UL << 7)
#define ESP32_UNIT_31_BIT_8 (1UL << 8)
#define ESP32_UNIT_31_BIT_9 (1UL << 9)
#define ESP32_UNIT_31_BIT_10 (1UL << 10)
#define ESP32_UNIT_31_BIT_11 (1UL << 11)
#define ESP32_UNIT_31_BIT_12 (1UL << 12)
#define ESP32_UNIT_31_BIT_13 (1UL << 13)
#define ESP32_UNIT_31_BIT_14 (1UL << 14)
#define ESP32_UNIT_31_BIT_15 (1UL << 15)
#define ESP32_UNIT_31_BIT_16 (1UL << 16)
#define ESP32_UNIT_31_BIT_17 (1UL << 17)
#define ESP32_UNIT_31_BIT_18 (1UL << 18)
#define ESP32_UNIT_31_BIT_19 (1UL << 19)
#define ESP32_UNIT_31_BIT_20 (1UL << 20)
#define ESP32_UNIT_31_BIT_21 (1UL << 21)
#define ESP32_UNIT_31_BIT_22 (1UL << 22)
#define ESP32_UNIT_31_BIT_23 (1UL << 23)
#define ESP32_UNIT_31_BIT_24 (1UL << 24)
#define ESP32_UNIT_31_BIT_25 (1UL << 25)
#define ESP32_UNIT_31_BIT_26 (1UL << 26)
#define ESP32_UNIT_31_BIT_27 (1UL << 27)
#define ESP32_UNIT_31_BIT_28 (1UL << 28)
#define ESP32_UNIT_31_BIT_29 (1UL << 29)
#define ESP32_UNIT_31_BIT_30 (1UL << 30)
#define ESP32_UNIT_31_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_32_TypeDef;
#define ESP32_UNIT_32 ((ESP32_UNIT_32_TypeDef *)(0x3FF40000UL + 32 * 0x400UL))

#define ESP32_UNIT_32_BIT_0 (1UL << 0)
#define ESP32_UNIT_32_BIT_1 (1UL << 1)
#define ESP32_UNIT_32_BIT_2 (1UL << 2)
#define ESP32_UNIT_32_BIT_3 (1UL << 3)
#define ESP32_UNIT_32_BIT_4 (1UL << 4)
#define ESP32_UNIT_32_BIT_5 (1UL << 5)
#define ESP32_UNIT_32_BIT_6 (1UL << 6)
#define ESP32_UNIT_32_BIT_7 (1UL << 7)
#define ESP32_UNIT_32_BIT_8 (1UL << 8)
#define ESP32_UNIT_32_BIT_9 (1UL << 9)
#define ESP32_UNIT_32_BIT_10 (1UL << 10)
#define ESP32_UNIT_32_BIT_11 (1UL << 11)
#define ESP32_UNIT_32_BIT_12 (1UL << 12)
#define ESP32_UNIT_32_BIT_13 (1UL << 13)
#define ESP32_UNIT_32_BIT_14 (1UL << 14)
#define ESP32_UNIT_32_BIT_15 (1UL << 15)
#define ESP32_UNIT_32_BIT_16 (1UL << 16)
#define ESP32_UNIT_32_BIT_17 (1UL << 17)
#define ESP32_UNIT_32_BIT_18 (1UL << 18)
#define ESP32_UNIT_32_BIT_19 (1UL << 19)
#define ESP32_UNIT_32_BIT_20 (1UL << 20)
#define ESP32_UNIT_32_BIT_21 (1UL << 21)
#define ESP32_UNIT_32_BIT_22 (1UL << 22)
#define ESP32_UNIT_32_BIT_23 (1UL << 23)
#define ESP32_UNIT_32_BIT_24 (1UL << 24)
#define ESP32_UNIT_32_BIT_25 (1UL << 25)
#define ESP32_UNIT_32_BIT_26 (1UL << 26)
#define ESP32_UNIT_32_BIT_27 (1UL << 27)
#define ESP32_UNIT_32_BIT_28 (1UL << 28)
#define ESP32_UNIT_32_BIT_29 (1UL << 29)
#define ESP32_UNIT_32_BIT_30 (1UL << 30)
#define ESP32_UNIT_32_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_33_TypeDef;
#define ESP32_UNIT_33 ((ESP32_UNIT_33_TypeDef *)(0x3FF40000UL + 33 * 0x400UL))

