RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_33_BIT_0 (1UL << 0)
#define ESP32_UNIT_33_BIT_1 (1UL << 1)
#define ESP32_UNIT_33_BIT_2 (1UL << 2)
#define ESP32_UNIT_33_BIT_3 (1UL << 3)
#define ESP32_UNIT_33_BIT_4 (1UL << 4)
#define ESP32_UNIT_33_BIT_5 (1UL << 5)
#define ESP32_UNIT_33_BIT_6 (1UL << 6)
#define ESP32_UNIT_33_BIT_7 (1UL << 7)
#define ESP32_UNIT_33_BIT_8 (1UL << 8)
#define ESP32_UNIT_33_BIT_9 (1UL << 9)
#define ESP32_UNIT_33_BIT_10 (1UL << 10)
#define ESP32_UNIT_33_BIT_11 (1UL << 11)
#define ESP32_UNIT_33_BIT_12 (1UL << 12)
#define ESP32_UNIT_33_BIT_13 (1UL << 13)
#define ESP32_UNIT_33_BIT_14 (1UL << 14)
#define ESP32_UNIT_33_BIT_15 (1UL << 15)
#define ESP32_UNIT_33_BIT_16 (1UL << 16)
#define ESP32_UNIT_33_BIT_17 (1UL << 17)
#define ESP32_UNIT_33_BIT_18 (1UL << 18)
#define ESP32_UNIT_33_BIT_19 (1UL << 19)
#define ESP32_UNIT_33_BIT_20 (1UL << 20)
#define ESP32_UNIT_33_BIT_21 (1UL << 21)
#define ESP32_UNIT_33_BIT_22 (1UL << 22)
#define ESP32_UNIT_33_BIT_23 (1UL << 23)
#define ESP32_UNIT_33_BIT_24 (1UL << 24)
#define ESP32_UNIT_33_BIT_25 (1UL << 25)
#define ESP32_UNIT_33_BIT_26 (1UL << 26)
#define ESP32_UNIT_33_BIT_27 (1UL << 27)
#define ESP32_UNIT_33_BIT_28 (1UL << 28)
#define ESP32_UNIT_33_BIT_29 (1UL << 29)
#define ESP32_UNIT_33_BIT_30 (1UL << 30)
#define ESP32_UNIT_33_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_34_TypeDef;
#define ESP32_UNIT_34 ((ESP32_UNIT_34_TypeDef *)(0x3FF40000UL + 34 * 0x400UL))

#define ESP32_UNIT_34_BIT_0 (1UL << 0)
#define ESP32_UNIT_34_BIT_1 (1UL << 1)
#define ESP32_UNIT_34_BIT_2 (1UL << 2)
#define ESP32_UNIT_34_BIT_3 (1UL << 3)
#define ESP32_UNIT_34_BIT_4 (1UL << 4)
#define ESP32_UNIT_34_BIT_5 (1UL << 5)
#define ESP32_UNIT_34_BIT_6 (1UL << 6)
#define ESP32_UNIT_34_BIT_7 (1UL << 7)
#define ESP32_UNIT_34_BIT_8 (1UL << 8)
#define ESP32_UNIT_34_BIT_9 (1UL << 9)
#define ESP32_UNIT_34_BIT_10 (1UL << 10)
#define ESP32_UNIT_34_BIT_11 (1UL << 11)
#define ESP32_UNIT_34_BIT_12 (1UL << 12)
#define ESP32_UNIT_34_BIT_13 (1UL << 13)
#define ESP32_UNIT_34_BIT_14 (1UL << 14)
#define ESP32_UNIT_34_BIT_15 (1UL << 15)
#define ESP32_UNIT_34_BIT_16 (1UL << 16)
#define ESP32_UNIT_34_BIT_17 (1UL << 17)
#define ESP32_UNIT_34_BIT_18 (1UL << 18)
#define ESP32_UNIT_34_BIT_19 (1UL << 19)
#define ESP32_UNIT_34_BIT_20 (1UL << 20)
#define ESP32_UNIT_34_BIT_21 (1UL << 21)
#define ESP32_UNIT_34_BIT_22 (1UL << 22)
#define ESP32_UNIT_34_BIT_23 (1UL << 23)
#define ESP32_UNIT_34_BIT_24 (1UL << 24)
#define ESP32_UNIT_34_BIT_25 (1UL << 25)
#define ESP32_UNIT_34_BIT_26 (1UL << 26)
#define ESP32_UNIT_34_BIT_27 (1UL << 27)
#define ESP32_UNIT_34_BIT_28 (1UL << 28)
#define ESP32_UNIT_34_BIT_29 (1UL << 29)
#define ESP32_UNIT_34_BIT_30 (1UL << 30)
#define ESP32_UNIT_34_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_35_TypeDef;
#define ESP32_UNIT_35 ((ESP32_UNIT_35_TypeDef *)(0x3FF40000UL + 35 * 0x400UL))

#define ESP32_UNIT_35_BIT_0 (1UL << 0)
#define ESP32_UNIT_35_BIT_1 (1UL << 1)
#define ESP32_UNIT_35_BIT_2 (1UL << 2)
#define ESP32_UNIT_35_BIT_3 (1UL << 3)
#define ESP32_UNIT_35_BIT_4 (1UL << 4)
#define ESP32_UNIT_35_BIT_5 (1UL << 5)
#define ESP32_UNIT_35_BIT_6 (1UL << 6)
#define ESP32_UNIT_35_BIT_7 (1UL << 7)
#define ESP32_UNIT_35_BIT_8 (1UL << 8)
#define ESP32_UNIT_35_BIT_9 (1UL << 9)
#define ESP32_UNIT_35_BIT_10 (1UL << 10)
#define ESP32_UNIT_35_BIT_11 (1UL << 11)
#define ESP32_UNIT_35_BIT_12 (1UL << 12)
#define ESP32_UNIT_35_BIT_13 (1UL << 13)
#define ESP32_UNIT_35_BIT_14 (1UL << 14)
#define ESP32_UNIT_35_BIT_15 (1UL << 15)
#define ESP32_UNIT_35_BIT_16 (1UL << 16)
#define ESP32_UNIT_35_BIT_17 (1UL << 17)
#define ESP32_UNIT_35_BIT_18 (1UL << 18)
#define ESP32_UNIT_35_BIT_19 (1UL << 19)
#define ESP32_UNIT_35_BIT_20 (1UL << 20)
#define ESP32_UNIT_35_BIT_21 (1UL << 21)
#define ESP32_UNIT_35_BIT_22 (1UL << 22)
#define ESP32_UNIT_35_BIT_23 (1UL << 23)
#define ESP32_UNIT_35_BIT_24 (1UL << 24)
#define ESP32_UNIT_35_BIT_25 (1UL << 25)
#define ESP32_UNIT_35_BIT_26 (1UL << 26)
#define ESP32_UNIT_35_BIT_27 (1UL << 27)
#define ESP32_UNIT_35_BIT_28 (1UL << 28)
#define ESP32_UNIT_35_BIT_29 (1UL << 29)
#define ESP32_UNIT_35_BIT_30 (1UL << 30)
#define ESP32_UNIT_35_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_36_TypeDef;
#define ESP32_UNIT_36 ((ESP32_UNIT_36_TypeDef *)(0x3FF40000UL + 36 * 0x400UL))

#define ESP32_UNIT_36_BIT_0 (1UL << 0)
#define ESP32_UNIT_36_BIT_1 (1UL << 1)
#define ESP32_UNIT_36_BIT_2 (1UL << 2)
#define ESP32_UNIT_36_BIT_3 (1UL << 3)
#define ESP32_UNIT_36_BIT_4 (1UL << 4)
#define ESP32_UNIT_36_BIT_5 (1UL << 5)
#define ESP32_UNIT_36_BIT_6 (1UL << 6)
#define ESP32_UNIT_36_BIT_7 (1UL << 7)
#define ESP32_UNIT_36_BIT_8 (1UL << 8)
#define ESP32_UNIT_36_BIT_9 (1UL << 9)
#define ESP32_UNIT_36_BIT_10 (1UL << 10)
#define ESP32_UNIT_36_BIT_11 (1UL << 11)
#define ESP32_UNIT_36_BIT_12 (1UL << 12)
#define ESP32_UNIT_36_BIT_13 (1UL << 13)
#define ESP32_UNIT_36_BIT_14 (1UL << 14)
#define ESP32_UNIT_36_BIT_15 (1UL << 15)
#define ESP32_UNIT_36_BIT_16 (1UL << 16)
#define ESP32_UNIT_36_BIT_17 (1UL << 17)
#define ESP32_UNIT_36_BIT_18 (1UL << 18)
#define ESP32_UNIT_36_BIT_19 (1UL << 19)
#define ESP32_UNIT_36_BIT_20 (1UL << 20)
#define ESP32_UNIT_36_BIT_21 (1UL << 21)
#define ESP32_UNIT_36_BIT_22 (1UL << 22)
#define ESP32_UNIT_36_BIT_23 (1UL << 23)
#define ESP32_UNIT_36_BIT_24 (1UL << 24)
#define ESP32_UNIT_36_BIT_25 (1UL << 25)
#define ESP32_UNIT_36_BIT_26 (1UL << 26)
#define ESP32_UNIT_36_BIT_27 (1UL << 27)
#define ESP32_UNIT_36_BIT_28 (1UL << 28)
#define ESP32_UNIT_36_BIT_29 (1UL << 29)
#define ESP32_UNIT_36_BIT_30 (1UL << 30)
#define ESP32_UNIT_36_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_37_TypeDef;
#define ESP32_UNIT_37 ((ESP32_UNIT_37_TypeDef *)(0x3FF40000UL + 37 * 0x400UL))

#define ESP32_UNIT_37_BIT_0 (1UL << 0)
#define ESP32_UNIT_37_BIT_1 (1UL << 1)
#define ESP32_UNIT_37_BIT_2 (1UL << 2)
#define ESP32_UNIT_37_BIT_3 (1UL << 3)
#define ESP32_UNIT_37_BIT_4 (1UL << 4)
#define ESP32_UNIT_37_BIT_5 (1UL << 5)
#define ESP32_UNIT_37_BIT_6 (1UL << 6)
#define ESP32_UNIT_37_BIT_7 (1UL << 7)
#define ESP32_UNIT_37_BIT_8 (1UL << 8)
#define ESP32_UNIT_37_BIT_9 (1UL << 9)
#define ESP32_UNIT_37_BIT_10 (1UL << 10)
#define ESP32_UNIT_37_BIT_11 (1UL << 11)
#define ESP32_UNIT_37_BIT_12 (1UL << 12)
#define ESP32_UNIT_37_BIT_13 (1UL << 13)
#define ESP32_UNIT_37_BIT_14 (1UL << 14)
#define ESP32_UNIT_37_BIT_15 (1UL << 15)
#define ESP32_UNIT_37_BIT_16 (1UL << 16)
#define ESP32_UNIT_37_BIT_17 (1UL << 17)
#define ESP32_UNIT_37_BIT_18 (1UL << 18)
#define ESP32_UNIT_37_BIT_19 (1UL << 19)
#define ESP32_UNIT_37_BIT_20 (1UL << 20)
#define ESP32_UNIT_37_BIT_21 (1UL << 21)
#define ESP32_UNIT_37_BIT_22 (1UL << 22)
#define ESP32_UNIT_37_BIT_23 (1UL << 23)
#define ESP32_UNIT_37_BIT_24 (1UL << 24)
#define ESP32_UNIT_37_BIT_25 (1UL << 25)
#define ESP32_UNIT_37_BIT_26 (1UL << 26)
#define ESP32_UNIT_37_BIT_27 (1UL << 27)
#define ESP32_UNIT_37_BIT_28 (1UL << 28)
#define ESP32_UNIT_37_BIT_29 (1UL << 29)
#define ESP32_UNIT_37_BIT_30 (1UL << 30)
#define ESP32_UNIT_37_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_38_TypeDef;
#define ESP32_UNIT_38 ((ESP32_UNIT_38_TypeDef *)(0x3FF40000UL + 38 * 0x400UL))

#define ESP32_UNIT_38_BIT_0 (1UL << 0)
#define ESP32_UNIT_38_BIT_1 (1UL << 1)
#define ESP32_UNIT_38_BIT_2 (1UL << 2)
#define ESP32_UNIT_38_BIT_3 (1UL << 3)
#define ESP32_UNIT_38_BIT_4 (1UL << 4)
#define ESP32_UNIT_38_BIT_5 (1UL << 5)
#define ESP32_UNIT_38_BIT_6 (1UL << 6)
#define ESP32_UNIT_38_BIT_7 (1UL << 7)
#define ESP32_UNIT_38_BIT_8 (1UL << 8)
#define ESP32_UNIT_38_BIT_9 (1UL << 9)
#define ESP32_UNIT_38_BIT_10 (1UL << 10)
#define ESP32_UNIT_38_BIT_11 (1UL << 11)
#define ESP32_UNIT_38_BIT_12 (1UL << 12)
#define ESP32_UNIT_38_BIT_13 (1UL << 13)
#define ESP32_UNIT_38_BIT_14 (1UL << 14)
#define ESP32_UNIT_38_BIT_15 (1UL << 15)
#define ESP32_UNIT_38_BIT_16 (1UL << 16)
#define ESP32_UNIT_38_BIT_17 (1UL << 17)
#define ESP32_UNIT_38_BIT_18 (1UL << 18)
#define ESP32_UNIT_38_BIT_19 (1UL << 19)
#define ESP32_UNIT_38_BIT_20 (1UL << 20)
#define ESP32_UNIT_38_BIT_21 (1UL << 21)
#define ESP32_UNIT_38_BIT_22 (1UL << 22)
#define ESP32_UNIT_38_BIT_23 (1UL << 23)
#define ESP32_UNIT_38_BIT_24 (1UL << 24)
#define ESP32_UNIT_38_BIT_25 (1UL << 25)
#define ESP32_UNIT_38_BIT_26 (1UL << 26)
#define ESP32_UNIT_38_BIT_27 (1UL << 27)
#define ESP32_UNIT_38_BIT_28 (1UL << 28)
#define ESP32_UNIT_38_BIT_29 (1UL << 29)
#define ESP32_UNIT_38_BIT_30 (1UL << 30)
#define ESP32_UNIT_38_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_39_TypeDef;
#define ESP32_UNIT_39 ((ESP32_UNIT_39_TypeDef *)(0x3FF40000UL + 39 * 0x400UL))

#define ESP32_UNIT_39_BIT_0 (1UL << 0)
#define ESP32_UNIT_39_BIT_1 (1UL << 1)
#define ESP32_UNIT_39_BIT_2 (1UL << 2)
#define ESP32_UNIT_39_BIT_3 (1UL << 3)
#define ESP32_UNIT_39_BIT_4 (1UL << 4)
#define ESP32_UNIT_39_BIT_5 (1UL << 5)
#define ESP32_UNIT_39_BIT_6 (1UL << 6)
#define ESP32_UNIT_39_BIT_7 (1UL << 7)
#define ESP32_UNIT_39_BIT_8 (1UL << 8)
#define ESP32_UNIT_39_BIT_9 (1UL << 9)
#define ESP32_UNIT_39_BIT_10 (1UL << 10)
#define ESP32_UNIT_39_BIT_11 (1UL << 11)
#define ESP32_UNIT_39_BIT_12 (1UL << 12)
#define ESP32_UNIT_39_BIT_13 (1UL << 13)
#define ESP32_UNIT_39_BIT_14 (1UL << 14)
#define ESP32_UNIT_39_BIT_15 (1UL << 15)
#define ESP32_UNIT_39_BIT_16 (1UL << 16)
#define ESP32_UNIT_39_BIT_17 (1UL << 17)
#define ESP32_UNIT_39_BIT_18 (1UL << 18)
#define ESP32_UNIT_39_BIT_19 (1UL << 19)
#define ESP32_UNIT_39_BIT_20 (1UL << 20)
#define ESP32_UNIT_39_BIT_21 (1UL << 21)
#define ESP32_UNIT_39_BIT_22 (1UL << 22)
#define ESP32_UNIT_39_BIT_23 (1UL << 23)
#define ESP32_UNIT_39_BIT_24 (1UL << 24)
#define ESP32_UNIT_39_BIT_25 (1UL << 25)
#define ESP32_UNIT_39_BIT_26 (1UL << 26)
#define ESP32_UNIT_39_BIT_27 (1UL << 27)
#define ESP32_UNIT_39_BIT_28 (1UL << 28)
#define ESP32_UNIT_39_BIT_29 (1UL << 29)
#define ESP32_UNIT_39_BIT_30 (1UL << 30)
#define ESP32_UNIT_39_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_40_TypeDef;
#define ESP32_UNIT_40 ((ESP32_UNIT_40_TypeDef *)(0x3FF40000UL + 40 * 0x400UL))

#define ESP32_UNIT_40_BIT_0 (1UL << 0)
#define ESP32_UNIT_40_BIT_1 (1UL << 1)
#define ESP32_UNIT_40_BIT_2 (1UL << 2)
#define ESP32_UNIT_40_BIT_3 (1UL << 3)
#define ESP32_UNIT_40_BIT_4 (1UL << 4)
#define ESP32_UNIT_40_BIT_5 (1UL << 5)
#define ESP32_UNIT_40_BIT_6 (1UL << 6)
#define ESP32_UNIT_40_BIT_7 (1UL << 7)
#define ESP32_UNIT_40_BIT_8 (1UL << 8)
#define ESP32_UNIT_40_BIT_9 (1UL << 9)
#define ESP32_UNIT_40_BIT_10 (1UL << 10)
#define ESP32_UNIT_40_BIT_11 (1UL << 11)
#define ESP32_UNIT_40_BIT_12 (1UL << 12)
#define ESP32_UNIT_40_BIT_13 (1UL << 13)
#define ESP32_UNIT_40_BIT_14 (1UL << 14)
#define ESP32_UNIT_40_BIT_15 (1UL << 15)
#define ESP32_UNIT_40_BIT_16 (1UL << 16)
#define ESP32_UNIT_40_BIT_17 (1UL << 17)
#define ESP32_UNIT_40_BIT_18 (1UL << 18)
#define ESP32_UNIT_40_BIT_19 (1UL << 19)
#define ESP32_UNIT_40_BIT_20 (1UL << 20)
#define ESP32_UNIT_40_BIT_21 (1UL << 21)
#define ESP32_UNIT_40_BIT_22 (1UL << 22)
#define ESP32_UNIT_40_BIT_23 (1UL << 23)
#define ESP32_UNIT_40_BIT_24 (1UL << 24)
#define ESP32_UNIT_40_BIT_25 (1UL << 25)
#define ESP32_UNIT_40_BIT_26 (1UL << 26)
#define ESP32_UNIT_40_BIT_27 (1UL << 27)
#define ESP32_UNIT_40_BIT_28 (1UL << 28)
#define ESP32_UNIT_40_BIT_29 (1UL << 29)
#define ESP32_UNIT_40_BIT_30 (1UL << 30)
#define ESP32_UNIT_40_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_41_TypeDef;
#define ESP32_UNIT_41 ((ESP32_UNIT_41_TypeDef *)(0x3FF40000UL + 41 * 0x400UL))

