RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_41_BIT_0 (1UL << 0)
#define ESP32_UNIT_41_BIT_1 (1UL << 1)
#define ESP32_UNIT_41_BIT_2 (1UL << 2)
#define ESP32_UNIT_41_BIT_3 (1UL << 3)
#define ESP32_UNIT_41_BIT_4 (1UL << 4)
#define ESP32_UNIT_41_BIT_5 (1UL << 5)
#define ESP32_UNIT_41_BIT_6 (1UL << 6)
#define ESP32_UNIT_41_BIT_7 (1UL << 7)
#define ESP32_UNIT_41_BIT_8 (1UL << 8)
#define ESP32_UNIT_41_BIT_9 (1UL << 9)
#define ESP32_UNIT_41_BIT_10 (1UL << 10)
#define ESP32_UNIT_41_BIT_11 (1UL << 11)
#define ESP32_UNIT_41_BIT_12 (1UL << 12)
#define ESP32_UNIT_41_BIT_13 (1UL << 13)
#define ESP32_UNIT_41_BIT_14 (1UL << 14)
#define ESP32_UNIT_41_BIT_15 (1UL << 15)
#define ESP32_UNIT_41_BIT_16 (1UL << 16)
#define ESP32_UNIT_41_BIT_17 (1UL << 17)
#define ESP32_UNIT_41_BIT_18 (1UL << 18)
#define ESP32_UNIT_41_BIT_19 (1UL << 19)
#define ESP32_UNIT_41_BIT_20 (1UL << 20)
#define ESP32_UNIT_41_BIT_21 (1UL << 21)
#define ESP32_UNIT_41_BIT_22 (1UL << 22)
#define ESP32_UNIT_41_BIT_23 (1UL << 23)
#define ESP32_UNIT_41_BIT_24 (1UL << 24)
#define ESP32_UNIT_41_BIT_25 (1UL << 25)
#define ESP32_UNIT_41_BIT_26 (1UL << 26)
#define ESP32_UNIT_41_BIT_27 (1UL << 27)
#define ESP32_UNIT_41_BIT_28 (1UL << 28)
#define ESP32_UNIT_41_BIT_29 (1UL << 29)
#define ESP32_UNIT_41_BIT_30 (1UL << 30)
#define ESP32_UNIT_41_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_42_TypeDef;
#define ESP32_UNIT_42 ((ESP32_UNIT_42_TypeDef *)(0x3FF40000UL + 42 * 0x400UL))

#define ESP32_UNIT_42_BIT_0 (1UL << 0)
#define ESP32_UNIT_42_BIT_1 (1UL << 1)
#define ESP32_UNIT_42_BIT_2 (1UL << 2)
#define ESP32_UNIT_42_BIT_3 (1UL << 3)
#define ESP32_UNIT_42_BIT_4 (1UL << 4)
#define ESP32_UNIT_42_BIT_5 (1UL << 5)
#define ESP32_UNIT_42_BIT_6 (1UL << 6)
#define ESP32_UNIT_42_BIT_7 (1UL << 7)
#define ESP32_UNIT_42_BIT_8 (1UL << 8)
#define ESP32_UNIT_42_BIT_9 (1UL << 9)
#define ESP32_UNIT_42_BIT_10 (1UL << 10)
#define ESP32_UNIT_42_BIT_11 (1UL << 11)
#define ESP32_UNIT_42_BIT_12 (1UL << 12)
#define ESP32_UNIT_42_BIT_13 (1UL << 13)
#define ESP32_UNIT_42_BIT_14 (1UL << 14)
#define ESP32_UNIT_42_BIT_15 (1UL << 15)
#define ESP32_UNIT_42_BIT_16 (1UL << 16)
#define ESP32_UNIT_42_BIT_17 (1UL << 17)
#define ESP32_UNIT_42_BIT_18 (1UL << 18)
#define ESP32_UNIT_42_BIT_19 (1UL << 19)
#define ESP32_UNIT_42_BIT_20 (1UL << 20)
#define ESP32_UNIT_42_BIT_21 (1UL << 21)
#define ESP32_UNIT_42_BIT_22 (1UL << 22)
#define ESP32_UNIT_42_BIT_23 (1UL << 23)
#define ESP32_UNIT_42_BIT_24 (1UL << 24)
#define ESP32_UNIT_42_BIT_25 (1UL << 25)
#define ESP32_UNIT_42_BIT_26 (1UL << 26)
#define ESP32_UNIT_42_BIT_27 (1UL << 27)
#define ESP32_UNIT_42_BIT_28 (1UL << 28)
#define ESP32_UNIT_42_BIT_29 (1UL << 29)
#define ESP32_UNIT_42_BIT_30 (1UL << 30)
#define ESP32_UNIT_42_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_43_TypeDef;
#define ESP32_UNIT_43 ((ESP32_UNIT_43_TypeDef *)(0x3FF40000UL + 43 * 0x400UL))

#define ESP32_UNIT_43_BIT_0 (1UL << 0)
#define ESP32_UNIT_43_BIT_1 (1UL << 1)
#define ESP32_UNIT_43_BIT_2 (1UL << 2)
#define ESP32_UNIT_43_BIT_3 (1UL << 3)
#define ESP32_UNIT_43_BIT_4 (1UL << 4)
#define ESP32_UNIT_43_BIT_5 (1UL << 5)
#define ESP32_UNIT_43_BIT_6 (1UL << 6)
#define ESP32_UNIT_43_BIT_7 (1UL << 7)
#define ESP32_UNIT_43_BIT_8 (1UL << 8)
#define ESP32_UNIT_43_BIT_9 (1UL << 9)
#define ESP32_UNIT_43_BIT_10 (1UL << 10)
#define ESP32_UNIT_43_BIT_11 (1UL << 11)
#define ESP32_UNIT_43_BIT_12 (1UL << 12)
#define ESP32_UNIT_43_BIT_13 (1UL << 13)
#define ESP32_UNIT_43_BIT_14 (1UL << 14)
#define ESP32_UNIT_43_BIT_15 (1UL << 15)
#define ESP32_UNIT_43_BIT_16 (1UL << 16)
#define ESP32_UNIT_43_BIT_17 (1UL << 17)
#define ESP32_UNIT_43_BIT_18 (1UL << 18)
#define ESP32_UNIT_43_BIT_19 (1UL << 19)
#define ESP32_UNIT_43_BIT_20 (1UL << 20)
#define ESP32_UNIT_43_BIT_21 (1UL << 21)
#define ESP32_UNIT_43_BIT_22 (1UL << 22)
#define ESP32_UNIT_43_BIT_23 (1UL << 23)
#define ESP32_UNIT_43_BIT_24 (1UL << 24)
#define ESP32_UNIT_43_BIT_25 (1UL << 25)
#define ESP32_UNIT_43_BIT_26 (1UL << 26)
#define ESP32_UNIT_43_BIT_27 (1UL << 27)
#define ESP32_UNIT_43_BIT_28 (1UL << 28)
#define ESP32_UNIT_43_BIT_29 (1UL << 29)
#define ESP32_UNIT_43_BIT_30 (1UL << 30)
#define ESP32_UNIT_43_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_44_TypeDef;
#define ESP32_UNIT_44 ((ESP32_UNIT_44_TypeDef *)(0x3FF40000UL + 44 * 0x400UL))

#define ESP32_UNIT_44_BIT_0 (1UL << 0)
#define ESP32_UNIT_44_BIT_1 (1UL << 1)
#define ESP32_UNIT_44_BIT_2 (1UL << 2)
#define ESP32_UNIT_44_BIT_3 (1UL << 3)
#define ESP32_UNIT_44_BIT_4 (1UL << 4)
#define ESP32_UNIT_44_BIT_5 (1UL << 5)
#define ESP32_UNIT_44_BIT_6 (1UL << 6)
#define ESP32_UNIT_44_BIT_7 (1UL << 7)
#define ESP32_UNIT_44_BIT_8 (1UL << 8)
#define ESP32_UNIT_44_BIT_9 (1UL << 9)
#define ESP32_UNIT_44_BIT_10 (1UL << 10)
#define ESP32_UNIT_44_BIT_11 (1UL << 11)
#define ESP32_UNIT_44_BIT_12 (1UL << 12)
#define ESP32_UNIT_44_BIT_13 (1UL << 13)
#define ESP32_UNIT_44_BIT_14 (1UL << 14)
#define ESP32_UNIT_44_BIT_15 (1UL << 15)
#define ESP32_UNIT_44_BIT_16 (1UL << 16)
#define ESP32_UNIT_44_BIT_17 (1UL << 17)
#define ESP32_UNIT_44_BIT_18 (1UL << 18)
#define ESP32_UNIT_44_BIT_19 (1UL << 19)
#define ESP32_UNIT_44_BIT_20 (1UL << 20)
#define ESP32_UNIT_44_BIT_21 (1UL << 21)
#define ESP32_UNIT_44_BIT_22 (1UL << 22)
#define ESP32_UNIT_44_BIT_23 (1UL << 23)
#define ESP32_UNIT_44_BIT_24 (1UL << 24)
#define ESP32_UNIT_44_BIT_25 (1UL << 25)
#define ESP32_UNIT_44_BIT_26 (1UL << 26)
#define ESP32_UNIT_44_BIT_27 (1UL << 27)
#define ESP32_UNIT_44_BIT_28 (1UL << 28)
#define ESP32_UNIT_44_BIT_29 (1UL << 29)
#define ESP32_UNIT_44_BIT_30 (1UL << 30)
#define ESP32_UNIT_44_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_45_TypeDef;
#define ESP32_UNIT_45 ((ESP32_UNIT_45_TypeDef *)(0x3FF40000UL + 45 * 0x400UL))

#define ESP32_UNIT_45_BIT_0 (1UL << 0)
#define ESP32_UNIT_45_BIT_1 (1UL << 1)
#define ESP32_UNIT_45_BIT_2 (1UL << 2)
#define ESP32_UNIT_45_BIT_3 (1UL << 3)
#define ESP32_UNIT_45_BIT_4 (1UL << 4)
#define ESP32_UNIT_45_BIT_5 (1UL << 5)
#define ESP32_UNIT_45_BIT_6 (1UL << 6)
#define ESP32_UNIT_45_BIT_7 (1UL << 7)
#define ESP32_UNIT_45_BIT_8 (1UL << 8)
#define ESP32_UNIT_45_BIT_9 (1UL << 9)
#define ESP32_UNIT_45_BIT_10 (1UL << 10)
#define ESP32_UNIT_45_BIT_11 (1UL << 11)
#define ESP32_UNIT_45_BIT_12 (1UL << 12)
#define ESP32_UNIT_45_BIT_13 (1UL << 13)
#define ESP32_UNIT_45_BIT_14 (1UL << 14)
#define ESP32_UNIT_45_BIT_15 (1UL << 15)
#define ESP32_UNIT_45_BIT_16 (1UL << 16)
#define ESP32_UNIT_45_BIT_17 (1UL << 17)
#define ESP32_UNIT_45_BIT_18 (1UL << 18)
#define ESP32_UNIT_45_BIT_19 (1UL << 19)
#define ESP32_UNIT_45_BIT_20 (1UL << 20)
#define ESP32_UNIT_45_BIT_21 (1UL << 21)
#define ESP32_UNIT_45_BIT_22 (1UL << 22)
#define ESP32_UNIT_45_BIT_23 (1UL << 23)
#define ESP32_UNIT_45_BIT_24 (1UL << 24)
#define ESP32_UNIT_45_BIT_25 (1UL << 25)
#define ESP32_UNIT_45_BIT_26 (1UL << 26)
#define ESP32_UNIT_45_BIT_27 (1UL << 27)
#define ESP32_UNIT_45_BIT_28 (1UL << 28)
#define ESP32_UNIT_45_BIT_29 (1UL << 29)
#define ESP32_UNIT_45_BIT_30 (1UL << 30)
#define ESP32_UNIT_45_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_46_TypeDef;
#define ESP32_UNIT_46 ((ESP32_UNIT_46_TypeDef *)(0x3FF40000UL + 46 * 0x400UL))

