RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_46_BIT_0 (1UL << 0)
#define ESP32_UNIT_46_BIT_1 (1UL << 1)
#define ESP32_UNIT_46_BIT_2 (1UL << 2)
#define ESP32_UNIT_46_BIT_3 (1UL << 3)
#define ESP32_UNIT_46_BIT_4 (1UL << 4)
#define ESP32_UNIT_46_BIT_5 (1UL << 5)
#define ESP32_UNIT_46_BIT_6 (1UL << 6)
#define ESP32_UNIT_46_BIT_7 (1UL << 7)
#define ESP32_UNIT_46_BIT_8 (1UL << 8)
#define ESP32_UNIT_46_BIT_9 (1UL << 9)
#define ESP32_UNIT_46_BIT_10 (1UL << 10)
#define ESP32_UNIT_46_BIT_11 (1UL << 11)
#define ESP32_UNIT_46_BIT_12 (1UL << 12)
#define ESP32_UNIT_46_BIT_13 (1UL << 13)
#define ESP32_UNIT_46_BIT_14 (1UL << 14)
#define ESP32_UNIT_46_BIT_15 (1UL << 15)
#define ESP32_UNIT_46_BIT_16 (1UL << 16)
#define ESP32_UNIT_46_BIT_17 (1UL << 17)
#define ESP32_UNIT_46_BIT_18 (1UL << 18)
#define ESP32_UNIT_46_BIT_19 (1UL << 19)
#define ESP32_UNIT_46_BIT_20 (1UL << 20)
#define ESP32_UNIT_46_BIT_21 (1UL << 21)
#define ESP32_UNIT_46_BIT_22 (1UL << 22)
#define ESP32_UNIT_46_BIT_23 (1UL << 23)
#define ESP32_UNIT_46_BIT_24 (1UL << 24)
#define ESP32_UNIT_46_BIT_25 (1UL << 25)
#define ESP32_UNIT_46_BIT_26 (1UL << 26)
#define ESP32_UNIT_46_BIT_27 (1UL << 27)
#define ESP32_UNIT_46_BIT_28 (1UL << 28)
#define ESP32_UNIT_46_BIT_29 (1UL << 29)
#define ESP32_UNIT_46_BIT_30 (1UL << 30)
#define ESP32_UNIT_46_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_47_TypeDef;
#define ESP32_UNIT_47 ((ESP32_UNIT_47_TypeDef *)(0x3FF40000UL + 47 * 0x400UL))

#define ESP32_UNIT_47_BIT_0 (1UL << 0)
#define ESP32_UNIT_47_BIT_1 (1UL << 1)
#define ESP32_UNIT_47_BIT_2 (1UL << 2)
#define ESP32_UNIT_47_BIT_3 (1UL << 3)
#define ESP32_UNIT_47_BIT_4 (1UL << 4)
#define ESP32_UNIT_47_BIT_5 (1UL << 5)
#define ESP32_UNIT_47_BIT_6 (1UL << 6)
#define ESP32_UNIT_47_BIT_7 (1UL << 7)
#define ESP32_UNIT_47_BIT_8 (1UL << 8)
#define ESP32_UNIT_47_BIT_9 (1UL << 9)
#define ESP32_UNIT_47_BIT_10 (1UL << 10)
#define ESP32_UNIT_47_BIT_11 (1UL << 11)
#define ESP32_UNIT_47_BIT_12 (1UL << 12)
#define ESP32_UNIT_47_BIT_13 (1UL << 13)
#define ESP32_UNIT_47_BIT_14 (1UL << 14)
#define ESP32_UNIT_47_BIT_15 (1UL << 15)
#define ESP32_UNIT_47_BIT_16 (1UL << 16)
#define ESP32_UNIT_47_BIT_17 (1UL << 17)
#define ESP32_UNIT_47_BIT_18 (1UL << 18)
#define ESP32_UNIT_47_BIT_19 (1UL << 19)
#define ESP32_UNIT_47_BIT_20 (1UL << 20)
#define ESP32_UNIT_47_BIT_21 (1UL << 21)
#define ESP32_UNIT_47_BIT_22 (1UL << 22)
#define ESP32_UNIT_47_BIT_23 (1UL << 23)
#define ESP32_UNIT_47_BIT_24 (1UL << 24)
#define ESP32_UNIT_47_BIT_25 (1UL << 25)
#define ESP32_UNIT_47_BIT_26 (1UL << 26)
#define ESP32_UNIT_47_BIT_27 (1UL << 27)
#define ESP32_UNIT_47_BIT_28 (1UL << 28)
#define ESP32_UNIT_47_BIT_29 (1UL << 29)
#define ESP32_UNIT_47_BIT_30 (1UL << 30)
#define ESP32_UNIT_47_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_48_TypeDef;
#define ESP32_UNIT_48 ((ESP32_UNIT_48_TypeDef *)(0x3FF40000UL + 48 * 0x400UL))

#define ESP32_UNIT_48_BIT_0 (1UL << 0)
#define ESP32_UNIT_48_BIT_1 (1UL << 1)
#define ESP32_UNIT_48_BIT_2 (1UL << 2)
#define ESP32_UNIT_48_BIT_3 (1UL << 3)
#define ESP32_UNIT_48_BIT_4 (1UL << 4)
#define ESP32_UNIT_48_BIT_5 (1UL << 5)
#define ESP32_UNIT_48_BIT_6 (1UL << 6)
#define ESP32_UNIT_48_BIT_7 (1UL << 7)
#define ESP32_UNIT_48_BIT_8 (1UL << 8)
#define ESP32_UNIT_48_BIT_9 (1UL << 9)
#define ESP32_UNIT_48_BIT_10 (1UL << 10)
#define ESP32_UNIT_48_BIT_11 (1UL << 11)
#define ESP32_UNIT_48_BIT_12 (1UL << 12)
#define ESP32_UNIT_48_BIT_13 (1UL << 13)
#define ESP32_UNIT_48_BIT_14 (1UL << 14)
#define ESP32_UNIT_48_BIT_15 (1UL << 15)
#define ESP32_UNIT_48_BIT_16 (1UL << 16)
#define ESP32_UNIT_48_BIT_17 (1UL << 17)
#define ESP32_UNIT_48_BIT_18 (1UL << 18)
#define ESP32_UNIT_48_BIT_19 (1UL << 19)
#define ESP32_UNIT_48_BIT_20 (1UL << 20)
#define ESP32_UNIT_48_BIT_21 (1UL << 21)
#define ESP32_UNIT_48_BIT_22 (1UL << 22)
#define ESP32_UNIT_48_BIT_23 (1UL << 23)
#define ESP32_UNIT_48_BIT_24 (1UL << 24)
#define ESP32_UNIT_48_BIT_25 (1UL << 25)
#define ESP32_UNIT_48_BIT_26 (1UL << 26)
#define ESP32_UNIT_48_BIT_27 (1UL << 27)
#define ESP32_UNIT_48_BIT_28 (1UL << 28)
#define ESP32_UNIT_48_BIT_29 (1UL << 29)
#define ESP32_UNIT_48_BIT_30 (1UL << 30)
#define ESP32_UNIT_48_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_49_TypeDef;
#define ESP32_UNIT_49 ((ESP32_UNIT_49_TypeDef *)(0x3FF40000UL + 49 * 0x400UL))

#define ESP32_UNIT_49_BIT_0 (1UL << 0)
#define ESP32_UNIT_49_BIT_1 (1UL << 1)
#define ESP32_UNIT_49_BIT_2 (1UL << 2)
#define ESP32_UNIT_49_BIT_3 (1UL << 3)
#define ESP32_UNIT_49_BIT_4 (1UL << 4)
#define ESP32_UNIT_49_BIT_5 (1UL << 5)
#define ESP32_UNIT_49_BIT_6 (1UL << 6)
#define ESP32_UNIT_49_BIT_7 (1UL << 7)
#define ESP32_UNIT_49_BIT_8 (1UL << 8)
#define ESP32_UNIT_49_BIT_9 (1UL << 9)
#define ESP32_UNIT_49_BIT_10 (1UL << 10)
#define ESP32_UNIT_49_BIT_11 (1UL << 11)
#define ESP32_UNIT_49_BIT_12 (1UL << 12)
#define ESP32_UNIT_49_BIT_13 (1UL << 13)
#define ESP32_UNIT_49_BIT_14 (1UL << 14)
#define ESP32_UNIT_49_BIT_15 (1UL << 15)
#define ESP32_UNIT_49_BIT_16 (1UL << 16)
#define ESP32_UNIT_49_BIT_17 (1UL << 17)
#define ESP32_UNIT_49_BIT_18 (1UL << 18)
#define ESP32_UNIT_49_BIT_19 (1UL << 19)
#define ESP32_UNIT_49_BIT_20 (1UL << 20)
#define ESP32_UNIT_49_BIT_21 (1UL << 21)
#define ESP32_UNIT_49_BIT_22 (1UL << 22)
#define ESP32_UNIT_49_BIT_23 (1UL << 23)
#define ESP32_UNIT_49_BIT_24 (1UL << 24)
#define ESP32_UNIT_49_BIT_25 (1UL << 25)
#define ESP32_UNIT_49_BIT_26 (1UL << 26)
#define ESP32_UNIT_49_BIT_27 (1UL << 27)
#define ESP32_UNIT_49_BIT_28 (1UL << 28)
#define ESP32_UNIT_49_BIT_29 (1UL << 29)
#define ESP32_UNIT_49_BIT_30 (1UL << 30)
#define ESP32_UNIT_49_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_50_TypeDef;
#define ESP32_UNIT_50 ((ESP32_UNIT_50_TypeDef *)(0x3FF40000UL + 50 * 0x400UL))

#define ESP32_UNIT_50_BIT_0 (1UL << 0)
#define ESP32_UNIT_50_BIT_1 (1UL << 1)
#define ESP32_UNIT_50_BIT_2 (1UL << 2)
#define ESP32_UNIT_50_BIT_3 (1UL << 3)
#define ESP32_UNIT_50_BIT_4 (1UL << 4)
#define ESP32_UNIT_50_BIT_5 (1UL << 5)
#define ESP32_UNIT_50_BIT_6 (1UL << 6)
#define ESP32_UNIT_50_BIT_7 (1UL << 7)
#define ESP32_UNIT_50_BIT_8 (1UL << 8)
#define ESP32_UNIT_50_BIT_9 (1UL << 9)
#define ESP32_UNIT_50_BIT_10 (1UL << 10)
#define ESP32_UNIT_50_BIT_11 (1UL << 11)
#define ESP32_UNIT_50_BIT_12 (1UL << 12)
#define ESP32_UNIT_50_BIT_13 (1UL << 13)
#define ESP32_UNIT_50_BIT_14 (1UL << 14)
#define ESP32_UNIT_50_BIT_15 (1UL << 15)
#define ESP32_UNIT_50_BIT_16 (1UL << 16)
#define ESP32_UNIT_50_BIT_17 (1UL << 17)
#define ESP32_UNIT_50_BIT_18 (1UL << 18)
#define ESP32_UNIT_50_BIT_19 (1UL << 19)
#define ESP32_UNIT_50_BIT_20 (1UL << 20)
#define ESP32_UNIT_50_BIT_21 (1UL << 21)
#define ESP32_UNIT_50_BIT_22 (1UL << 22)
#define ESP32_UNIT_50_BIT_23 (1UL << 23)
#define ESP32_UNIT_50_BIT_24 (1UL << 24)
#define ESP32_UNIT_50_BIT_25 (1UL << 25)
#define ESP32_UNIT_50_BIT_26 (1UL << 26)
#define ESP32_UNIT_50_BIT_27 (1UL << 27)
#define ESP32_UNIT_50_BIT_28 (1UL << 28)
#define ESP32_UNIT_50_BIT_29 (1UL << 29)
#define ESP32_UNIT_50_BIT_30 (1UL << 30)
#define ESP32_UNIT_50_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_51_TypeDef;
#define ESP32_UNIT_51 ((ESP32_UNIT_51_TypeDef *)(0x3FF40000UL + 51 * 0x400UL))

