RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_51_BIT_0 (1UL << 0)
#define ESP32_UNIT_51_BIT_1 (1UL << 1)
#define ESP32_UNIT_51_BIT_2 (1UL << 2)
#define ESP32_UNIT_51_BIT_3 (1UL << 3)
#define ESP32_UNIT_51_BIT_4 (1UL << 4)
#define ESP32_UNIT_51_BIT_5 (1UL << 5)
#define ESP32_UNIT_51_BIT_6 (1UL << 6)
#define ESP32_UNIT_51_BIT_7 (1UL << 7)
#define ESP32_UNIT_51_BIT_8 (1UL << 8)
#define ESP32_UNIT_51_BIT_9 (1UL << 9)
#define ESP32_UNIT_51_BIT_10 (1UL << 10)
#define ESP32_UNIT_51_BIT_11 (1UL << 11)
#define ESP32_UNIT_51_BIT_12 (1UL << 12)
#define ESP32_UNIT_51_BIT_13 (1UL << 13)
#define ESP32_UNIT_51_BIT_14 (1UL << 14)
#define ESP32_UNIT_51_BIT_15 (1UL << 15)
#define ESP32_UNIT_51_BIT_16 (1UL << 16)
#define ESP32_UNIT_51_BIT_17 (1UL << 17)
#define ESP32_UNIT_51_BIT_18 (1UL << 18)
#define ESP32_UNIT_51_BIT_19 (1UL << 19)
#define ESP32_UNIT_51_BIT_20 (1UL << 20)
#define ESP32_UNIT_51_BIT_21 (1UL << 21)
#define ESP32_UNIT_51_BIT_22 (1UL << 22)
#define ESP32_UNIT_51_BIT_23 (1UL << 23)
#define ESP32_UNIT_51_BIT_24 (1UL << 24)
#define ESP32_UNIT_51_BIT_25 (1UL << 25)
#define ESP32_UNIT_51_BIT_26 (1UL << 26)
#define ESP32_UNIT_51_BIT_27 (1UL << 27)
#define ESP32_UNIT_51_BIT_28 (1UL << 28)
#define ESP32_UNIT_51_BIT_29 (1UL << 29)
#define ESP32_UNIT_51_BIT_30 (1UL << 30)
#define ESP32_UNIT_51_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_52_TypeDef;
#define ESP32_UNIT_52 ((ESP32_UNIT_52_TypeDef *)(0x3FF40000UL + 52 * 0x400UL))

#define ESP32_UNIT_52_BIT_0 (1UL << 0)
#define ESP32_UNIT_52_BIT_1 (1UL << 1)
#define ESP32_UNIT_52_BIT_2 (1UL << 2)
#define ESP32_UNIT_52_BIT_3 (1UL << 3)
#define ESP32_UNIT_52_BIT_4 (1UL << 4)
#define ESP32_UNIT_52_BIT_5 (1UL << 5)
#define ESP32_UNIT_52_BIT_6 (1UL << 6)
#define ESP32_UNIT_52_BIT_7 (1UL << 7)
#define ESP32_UNIT_52_BIT_8 (1UL << 8)
#define ESP32_UNIT_52_BIT_9 (1UL << 9)
#define ESP32_UNIT_52_BIT_10 (1UL << 10)
#define ESP32_UNIT_52_BIT_11 (1UL << 11)
#define ESP32_UNIT_52_BIT_12 (1UL << 12)
#define ESP32_UNIT_52_BIT_13 (1UL << 13)
#define ESP32_UNIT_52_BIT_14 (1UL << 14)
#define ESP32_UNIT_52_BIT_15 (1UL << 15)
#define ESP32_UNIT_52_BIT_16 (1UL << 16)
#define ESP32_UNIT_52_BIT_17 (1UL << 17)
#define ESP32_UNIT_52_BIT_18 (1UL << 18)
#define ESP32_UNIT_52_BIT_19 (1UL << 19)
#define ESP32_UNIT_52_BIT_20 (1UL << 20)
#define ESP32_UNIT_52_BIT_21 (1UL << 21)
#define ESP32_UNIT_52_BIT_22 (1UL << 22)
#define ESP32_UNIT_52_BIT_23 (1UL << 23)
#define ESP32_UNIT_52_BIT_24 (1UL << 24)
#define ESP32_UNIT_52_BIT_25 (1UL << 25)
#define ESP32_UNIT_52_BIT_26 (1UL << 26)
#define ESP32_UNIT_52_BIT_27 (1UL << 27)
#define ESP32_UNIT_52_BIT_28 (1UL << 28)
#define ESP32_UNIT_52_BIT_29 (1UL << 29)
#define ESP32_UNIT_52_BIT_30 (1UL << 30)
#define ESP32_UNIT_52_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_53_TypeDef;
#define ESP32_UNIT_53 ((ESP32_UNIT_53_TypeDef *)(0x3FF40000UL + 53 * 0x400UL))

#define ESP32_UNIT_53_BIT_0 (1UL << 0)
#define ESP32_UNIT_53_BIT_1 (1UL << 1)
#define ESP32_UNIT_53_BIT_2 (1UL << 2)
#define ESP32_UNIT_53_BIT_3 (1UL << 3)
#define ESP32_UNIT_53_BIT_4 (1UL << 4)
#define ESP32_UNIT_53_BIT_5 (1UL << 5)
#define ESP32_UNIT_53_BIT_6 (1UL << 6)
#define ESP32_UNIT_53_BIT_7 (1UL << 7)
#define ESP32_UNIT_53_BIT_8 (1UL << 8)
#define ESP32_UNIT_53_BIT_9 (1UL << 9)
#define ESP32_UNIT_53_BIT_10 (1UL << 10)
#define ESP32_UNIT_53_BIT_11 (1UL << 11)
#define ESP32_UNIT_53_BIT_12 (1UL << 12)
#define ESP32_UNIT_53_BIT_13 (1UL << 13)
#define ESP32_UNIT_53_BIT_14 (1UL << 14)
#define ESP32_UNIT_53_BIT_15 (1UL << 15)
#define ESP32_UNIT_53_BIT_16 (1UL << 16)
#define ESP32_UNIT_53_BIT_17 (1UL << 17)
#define ESP32_UNIT_53_BIT_18 (1UL << 18)
#define ESP32_UNIT_53_BIT_19 (1UL << 19)
#define ESP32_UNIT_53_BIT_20 (1UL << 20)
#define ESP32_UNIT_53_BIT_21 (1UL << 21)
#define ESP32_UNIT_53_BIT_22 (1UL << 22)
#define ESP32_UNIT_53_BIT_23 (1UL << 23)
#define ESP32_UNIT_53_BIT_24 (1UL << 24)
#define ESP32_UNIT_53_BIT_25 (1UL << 25)
#define ESP32_UNIT_53_BIT_26 (1UL << 26)
#define ESP32_UNIT_53_BIT_27 (1UL << 27)
#define ESP32_UNIT_53_BIT_28 (1UL << 28)
#define ESP32_UNIT_53_BIT_29 (1UL << 29)
#define ESP32_UNIT_53_BIT_30 (1UL << 30)
#define ESP32_UNIT_53_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_54_TypeDef;
#define ESP32_UNIT_54 ((ESP32_UNIT_54_TypeDef *)(0x3FF40000UL + 54 * 0x400UL))

#define ESP32_UNIT_54_BIT_0 (1UL << 0)
#define ESP32_UNIT_54_BIT_1 (1UL << 1)
#define ESP32_UNIT_54_BIT_2 (1UL << 2)
#define ESP32_UNIT_54_BIT_3 (1UL << 3)
#define ESP32_UNIT_54_BIT_4 (1UL << 4)
#define ESP32_UNIT_54_BIT_5 (1UL << 5)
#define ESP32_UNIT_54_BIT_6 (1UL << 6)
#define ESP32_UNIT_54_BIT_7 (1UL << 7)
#define ESP32_UNIT_54_BIT_8 (1UL << 8)
#define ESP32_UNIT_54_BIT_9 (1UL << 9)
#define ESP32_UNIT_54_BIT_10 (1UL << 10)
#define ESP32_UNIT_54_BIT_11 (1UL << 11)
#define ESP32_UNIT_54_BIT_12 (1UL << 12)
#define ESP32_UNIT_54_BIT_13 (1UL << 13)
#define ESP32_UNIT_54_BIT_14 (1UL << 14)
#define ESP32_UNIT_54_BIT_15 (1UL << 15)
#define ESP32_UNIT_54_BIT_16 (1UL << 16)
#define ESP32_UNIT_54_BIT_17 (1UL << 17)
#define ESP32_UNIT_54_BIT_18 (1UL << 18)
#define ESP32_UNIT_54_BIT_19 (1UL << 19)
#define ESP32_UNIT_54_BIT_20 (1UL << 20)
#define ESP32_UNIT_54_BIT_21 (1UL << 21)
#define ESP32_UNIT_54_BIT_22 (1UL << 22)
#define ESP32_UNIT_54_BIT_23 (1UL << 23)
#define ESP32_UNIT_54_BIT_24 (1UL << 24)
#define ESP32_UNIT_54_BIT_25 (1UL << 25)
#define ESP32_UNIT_54_BIT_26 (1UL << 26)
#define ESP32_UNIT_54_BIT_27 (1UL << 27)
#define ESP32_UNIT_54_BIT_28 (1UL << 28)
#define ESP32_UNIT_54_BIT_29 (1UL << 29)
#define ESP32_UNIT_54_BIT_30 (1UL << 30)
#define ESP32_UNIT_54_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_55_TypeDef;
#define ESP32_UNIT_55 ((ESP32_UNIT_55_TypeDef *)(0x3FF40000UL + 55 * 0x400UL))

#define ESP32_UNIT_55_BIT_0 (1UL << 0)
#define ESP32_UNIT_55_BIT_1 (1UL << 1)
#define ESP32_UNIT_55_BIT_2 (1UL << 2)
#define ESP32_UNIT_55_BIT_3 (1UL << 3)
#define ESP32_UNIT_55_BIT_4 (1UL << 4)
#define ESP32_UNIT_55_BIT_5 (1UL << 5)
#define ESP32_UNIT_55_BIT_6 (1UL << 6)
#define ESP32_UNIT_55_BIT_7 (1UL << 7)
#define ESP32_UNIT_55_BIT_8 (1UL << 8)
#define ESP32_UNIT_55_BIT_9 (1UL << 9)
#define ESP32_UNIT_55_BIT_10 (1UL << 10)
#define ESP32_UNIT_55_BIT_11 (1UL << 11)
#define ESP32_UNIT_55_BIT_12 (1UL << 12)
#define ESP32_UNIT_55_BIT_13 (1UL << 13)
#define ESP32_UNIT_55_BIT_14 (1UL << 14)
#define ESP32_UNIT_55_BIT_15 (1UL << 15)
#define ESP32_UNIT_55_BIT_16 (1UL << 16)
#define ESP32_UNIT_55_BIT_17 (1UL << 17)
#define ESP32_UNIT_55_BIT_18 (1UL << 18)
#define ESP32_UNIT_55_BIT_19 (1UL << 19)
#define ESP32_UNIT_55_BIT_20 (1UL << 20)
#define ESP32_UNIT_55_BIT_21 (1UL << 21)
#define ESP32_UNIT_55_BIT_22 (1UL << 22)
#define ESP32_UNIT_55_BIT_23 (1UL << 23)
#define ESP32_UNIT_55_BIT_24 (1UL << 24)
#define ESP32_UNIT_55_BIT_25 (1UL << 25)
#define ESP32_UNIT_55_BIT_26 (1UL << 26)
#define ESP32_UNIT_55_BIT_27 (1UL << 27)
#define ESP32_UNIT_55_BIT_28 (1UL << 28)
#define ESP32_UNIT_55_BIT_29 (1UL << 29)
#define ESP32_UNIT_55_BIT_30 (1UL << 30)
#define ESP32_UNIT_55_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_56_TypeDef;
#define ESP32_UNIT_56 ((ESP32_UNIT_56_TypeDef *)(0x3FF40000UL + 56 * 0x400UL))

