RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_56_BIT_0 (1UL << 0)
#define ESP32_UNIT_56_BIT_1 (1UL << 1)
#define ESP32_UNIT_56_BIT_2 (1UL << 2)
#define ESP32_UNIT_56_BIT_3 (1UL << 3)
#define ESP32_UNIT_56_BIT_4 (1UL << 4)
#define ESP32_UNIT_56_BIT_5 (1UL << 5)
#define ESP32_UNIT_56_BIT_6 (1UL << 6)
#define ESP32_UNIT_56_BIT_7 (1UL << 7)
#define ESP32_UNIT_56_BIT_8 (1UL << 8)
#define ESP32_UNIT_56_BIT_9 (1UL << 9)
#define ESP32_UNIT_56_BIT_10 (1UL << 10)
#define ESP32_UNIT_56_BIT_11 (1UL << 11)
#define ESP32_UNIT_56_BIT_12 (1UL << 12)
#define ESP32_UNIT_56_BIT_13 (1UL << 13)
#define ESP32_UNIT_56_BIT_14 (1UL << 14)
#define ESP32_UNIT_56_BIT_15 (1UL << 15)
#define ESP32_UNIT_56_BIT_16 (1UL << 16)
#define ESP32_UNIT_56_BIT_17 (1UL << 17)
#define ESP32_UNIT_56_BIT_18 (1UL << 18)
#define ESP32_UNIT_56_BIT_19 (1UL << 19)
#define ESP32_UNIT_56_BIT_20 (1UL << 20)
#define ESP32_UNIT_56_BIT_21 (1UL << 21)
#define ESP32_UNIT_56_BIT_22 (1UL << 22)
#define ESP32_UNIT_56_BIT_23 (1UL << 23)
#define ESP32_UNIT_56_BIT_24 (1UL << 24)
#define ESP32_UNIT_56_BIT_25 (1UL << 25)
#define ESP32_UNIT_56_BIT_26 (1UL << 26)
#define ESP32_UNIT_56_BIT_27 (1UL << 27)
#define ESP32_UNIT_56_BIT_28 (1UL << 28)
#define ESP32_UNIT_56_BIT_29 (1UL << 29)
#define ESP32_UNIT_56_BIT_30 (1UL << 30)
#define ESP32_UNIT_56_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_57_TypeDef;
#define ESP32_UNIT_57 ((ESP32_UNIT_57_TypeDef *)(0x3FF40000UL + 57 * 0x400UL))

#define ESP32_UNIT_57_BIT_0 (1UL << 0)
#define ESP32_UNIT_57_BIT_1 (1UL << 1)
#define ESP32_UNIT_57_BIT_2 (1UL << 2)
#define ESP32_UNIT_57_BIT_3 (1UL << 3)
#define ESP32_UNIT_57_BIT_4 (1UL << 4)
#define ESP32_UNIT_57_BIT_5 (1UL << 5)
#define ESP32_UNIT_57_BIT_6 (1UL << 6)
#define ESP32_UNIT_57_BIT_7 (1UL << 7)
#define ESP32_UNIT_57_BIT_8 (1UL << 8)
#define ESP32_UNIT_57_BIT_9 (1UL << 9)
#define ESP32_UNIT_57_BIT_10 (1UL << 10)
#define ESP32_UNIT_57_BIT_11 (1UL << 11)
#define ESP32_UNIT_57_BIT_12 (1UL << 12)
#define ESP32_UNIT_57_BIT_13 (1UL << 13)
#define ESP32_UNIT_57_BIT_14 (1UL << 14)
#define ESP32_UNIT_57_BIT_15 (1UL << 15)
#define ESP32_UNIT_57_BIT_16 (1UL << 16)
#define ESP32_UNIT_57_BIT_17 (1UL << 17)
#define ESP32_UNIT_57_BIT_18 (1UL << 18)
#define ESP32_UNIT_57_BIT_19 (1UL << 19)
#define ESP32_UNIT_57_BIT_20 (1UL << 20)
#define ESP32_UNIT_57_BIT_21 (1UL << 21)
#define ESP32_UNIT_57_BIT_22 (1UL << 22)
#define ESP32_UNIT_57_BIT_23 (1UL << 23)
#define ESP32_UNIT_57_BIT_24 (1UL << 24)
#define ESP32_UNIT_57_BIT_25 (1UL << 25)
#define ESP32_UNIT_57_BIT_26 (1UL << 26)
#define ESP32_UNIT_57_BIT_27 (1UL << 27)
#define ESP32_UNIT_57_BIT_28 (1UL << 28)
#define ESP32_UNIT_57_BIT_29 (1UL << 29)
#define ESP32_UNIT_57_BIT_30 (1UL << 30)
#define ESP32_UNIT_57_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_58_TypeDef;
#define ESP32_UNIT_58 ((ESP32_UNIT_58_TypeDef *)(0x3FF40000UL + 58 * 0x400UL))

#define ESP32_UNIT_58_BIT_0 (1UL << 0)
#define ESP32_UNIT_58_BIT_1 (1UL << 1)
#define ESP32_UNIT_58_BIT_2 (1UL << 2)
#define ESP32_UNIT_58_BIT_3 (1UL << 3)
#define ESP32_UNIT_58_BIT_4 (1UL << 4)
#define ESP32_UNIT_58_BIT_5 (1UL << 5)
#define ESP32_UNIT_58_BIT_6 (1UL << 6)
#define ESP32_UNIT_58_BIT_7 (1UL << 7)
#define ESP32_UNIT_58_BIT_8 (1UL << 8)
#define ESP32_UNIT_58_BIT_9 (1UL << 9)
#define ESP32_UNIT_58_BIT_10 (1UL << 10)
#define ESP32_UNIT_58_BIT_11 (1UL << 11)
#define ESP32_UNIT_58_BIT_12 (1UL << 12)
#define ESP32_UNIT_58_BIT_13 (1UL << 13)
#define ESP32_UNIT_58_BIT_14 (1UL << 14)
#define ESP32_UNIT_58_BIT_15 (1UL << 15)
#define ESP32_UNIT_58_BIT_16 (1UL << 16)
#define ESP32_UNIT_58_BIT_17 (1UL << 17)
#define ESP32_UNIT_58_BIT_18 (1UL << 18)
#define ESP32_UNIT_58_BIT_19 (1UL << 19)
#define ESP32_UNIT_58_BIT_20 (1UL << 20)
#define ESP32_UNIT_58_BIT_21 (1UL << 21)
#define ESP32_UNIT_58_BIT_22 (1UL << 22)
#define ESP32_UNIT_58_BIT_23 (1UL << 23)
#define ESP32_UNIT_58_BIT_24 (1UL << 24)
#define ESP32_UNIT_58_BIT_25 (1UL << 25)
#define ESP32_UNIT_58_BIT_26 (1UL << 26)
#define ESP32_UNIT_58_BIT_27 (1UL << 27)
#define ESP32_UNIT_58_BIT_28 (1UL << 28)
#define ESP32_UNIT_58_BIT_29 (1UL << 29)
#define ESP32_UNIT_58_BIT_30 (1UL << 30)
#define ESP32_UNIT_58_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_59_TypeDef;
#define ESP32_UNIT_59 ((ESP32_UNIT_59_TypeDef *)(0x3FF40000UL + 59 * 0x400UL))

#define ESP32_UNIT_59_BIT_0 (1UL << 0)
#define ESP32_UNIT_59_BIT_1 (1UL << 1)
#define ESP32_UNIT_59_BIT_2 (1UL << 2)
#define ESP32_UNIT_59_BIT_3 (1UL << 3)
#define ESP32_UNIT_59_BIT_4 (1UL << 4)
#define ESP32_UNIT_59_BIT_5 (1UL << 5)
#define ESP32_UNIT_59_BIT_6 (1UL << 6)
#define ESP32_UNIT_59_BIT_7 (1UL << 7)
#define ESP32_UNIT_59_BIT_8 (1UL << 8)
#define ESP32_UNIT_59_BIT_9 (1UL << 9)
#define ESP32_UNIT_59_BIT_10 (1UL << 10)
#define ESP32_UNIT_59_BIT_11 (1UL << 11)
#define ESP32_UNIT_59_BIT_12 (1UL << 12)
#define ESP32_UNIT_59_BIT_13 (1UL << 13)
#define ESP32_UNIT_59_BIT_14 (1UL << 14)
#define ESP32_UNIT_59_BIT_15 (1UL << 15)
#define ESP32_UNIT_59_BIT_16 (1UL << 16)
#define ESP32_UNIT_59_BIT_17 (1UL << 17)
#define ESP32_UNIT_59_BIT_18 (1UL << 18)
#define ESP32_UNIT_59_BIT_19 (1UL << 19)
#define ESP32_UNIT_59_BIT_20 (1UL << 20)
#define ESP32_UNIT_59_BIT_21 (1UL << 21)
#define ESP32_UNIT_59_BIT_22 (1UL << 22)
#define ESP32_UNIT_59_BIT_23 (1UL << 23)
#define ESP32_UNIT_59_BIT_24 (1UL << 24)
#define ESP32_UNIT_59_BIT_25 (1UL << 25)
#define ESP32_UNIT_59_BIT_26 (1UL << 26)
#define ESP32_UNIT_59_BIT_27 (1UL << 27)
#define ESP32_UNIT_59_BIT_28 (1UL << 28)
#define ESP32_UNIT_59_BIT_29 (1UL << 29)
#define ESP32_UNIT_59_BIT_30 (1UL << 30)
#define ESP32_UNIT_59_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_60_TypeDef;
#define ESP32_UNIT_60 ((ESP32_UNIT_60_TypeDef *)(0x3FF40000UL + 60 * 0x400UL))

