RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_60_BIT_0 (1UL << 0)
#define ESP32_UNIT_60_BIT_1 (1UL << 1)
#define ESP32_UNIT_60_BIT_2 (1UL << 2)
#define ESP32_UNIT_60_BIT_3 (1UL << 3)
#define ESP32_UNIT_60_BIT_4 (1UL << 4)
#define ESP32_UNIT_60_BIT_5 (1UL << 5)
#define ESP32_UNIT_60_BIT_6 (1UL << 6)
#define ESP32_UNIT_60_BIT_7 (1UL << 7)
#define ESP32_UNIT_60_BIT_8 (1UL << 8)
#define ESP32_UNIT_60_BIT_9 (1UL << 9)
#define ESP32_UNIT_60_BIT_10 (1UL << 10)
#define ESP32_UNIT_60_BIT_11 (1UL << 11)
#define ESP32_UNIT_60_BIT_12 (1UL << 12)
#define ESP32_UNIT_60_BIT_13 (1UL << 13)
#define ESP32_UNIT_60_BIT_14 (1UL << 14)
#define ESP32_UNIT_60_BIT_15 (1UL << 15)
#define ESP32_UNIT_60_BIT_16 (1UL << 16)
#define ESP32_UNIT_60_BIT_17 (1UL << 17)
#define ESP32_UNIT_60_BIT_18 (1UL << 18)
#define ESP32_UNIT_60_BIT_19 (1UL << 19)
#define ESP32_UNIT_60_BIT_20 (1UL << 20)
#define ESP32_UNIT_60_BIT_21 (1UL << 21)
#define ESP32_UNIT_60_BIT_22 (1UL << 22)
#define ESP32_UNIT_60_BIT_23 (1UL << 23)
#define ESP32_UNIT_60_BIT_24 (1UL << 24)
#define ESP32_UNIT_60_BIT_25 (1UL << 25)
#define ESP32_UNIT_60_BIT_26 (1UL << 26)
#define ESP32_UNIT_60_BIT_27 (1UL << 27)
#define ESP32_UNIT_60_BIT_28 (1UL << 28)
#define ESP32_UNIT_60_BIT_29 (1UL << 29)
#define ESP32_UNIT_60_BIT_30 (1UL << 30)
#define ESP32_UNIT_60_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_61_TypeDef;
#define ESP32_UNIT_61 ((ESP32_UNIT_61_TypeDef *)(0x3FF40000UL + 61 * 0x400UL))

#define ESP32_UNIT_61_BIT_0 (1UL << 0)
#define ESP32_UNIT_61_BIT_1 (1UL << 1)
#define ESP32_UNIT_61_BIT_2 (1UL << 2)
#define ESP32_UNIT_61_BIT_3 (1UL << 3)
#define ESP32_UNIT_61_BIT_4 (1UL << 4)
#define ESP32_UNIT_61_BIT_5 (1UL << 5)
#define ESP32_UNIT_61_BIT_6 (1UL << 6)
#define ESP32_UNIT_61_BIT_7 (1UL << 7)
#define ESP32_UNIT_61_BIT_8 (1UL << 8)
#define ESP32_UNIT_61_BIT_9 (1UL << 9)
#define ESP32_UNIT_61_BIT_10 (1UL << 10)
#define ESP32_UNIT_61_BIT_11 (1UL << 11)
#define ESP32_UNIT_61_BIT_12 (1UL << 12)
#define ESP32_UNIT_61_BIT_13 (1UL << 13)
#define ESP32_UNIT_61_BIT_14 (1UL << 14)
#define ESP32_UNIT_61_BIT_15 (1UL << 15)
#define ESP32_UNIT_61_BIT_16 (1UL << 16)
#define ESP32_UNIT_61_BIT_17 (1UL << 17)
#define ESP32_UNIT_61_BIT_18 (1UL << 18)
#define ESP32_UNIT_61_BIT_19 (1UL << 19)
#define ESP32_UNIT_61_BIT_20 (1UL << 20)
#define ESP32_UNIT_61_BIT_21 (1UL << 21)
#define ESP32_UNIT_61_BIT_22 (1UL << 22)
#define ESP32_UNIT_61_BIT_23 (1UL << 23)
#define ESP32_UNIT_61_BIT_24 (1UL << 24)
#define ESP32_UNIT_61_BIT_25 (1UL << 25)
#define ESP32_UNIT_61_BIT_26 (1UL << 26)
#define ESP32_UNIT_61_BIT_27 (1UL << 27)
#define ESP32_UNIT_61_BIT_28 (1UL << 28)
#define ESP32_UNIT_61_BIT_29 (1UL << 29)
#define ESP32_UNIT_61_BIT_30 (1UL << 30)
#define ESP32_UNIT_61_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_62_TypeDef;
#define ESP32_UNIT_62 ((ESP32_UNIT_62_TypeDef *)(0x3FF40000UL + 62 * 0x400UL))

#define ESP32_UNIT_62_BIT_0 (1UL << 0)
#define ESP32_UNIT_62_BIT_1 (1UL << 1)
#define ESP32_UNIT_62_BIT_2 (1UL << 2)
#define ESP32_UNIT_62_BIT_3 (1UL << 3)
#define ESP32_UNIT_62_BIT_4 (1UL << 4)
#define ESP32_UNIT_62_BIT_5 (1UL << 5)
#define ESP32_UNIT_62_BIT_6 (1UL << 6)
#define ESP32_UNIT_62_BIT_7 (1UL << 7)
#define ESP32_UNIT_62_BIT_8 (1UL << 8)
#define ESP32_UNIT_62_BIT_9 (1UL << 9)
#define ESP32_UNIT_62_BIT_10 (1UL << 10)
#define ESP32_UNIT_62_BIT_11 (1UL << 11)
#define ESP32_UNIT_62_BIT_12 (1UL << 12)
#define ESP32_UNIT_62_BIT_13 (1UL << 13)
#define ESP32_UNIT_62_BIT_14 (1UL << 14)
#define ESP32_UNIT_62_BIT_15 (1UL << 15)
#define ESP32_UNIT_62_BIT_16 (1UL << 16)
#define ESP32_UNIT_62_BIT_17 (1UL << 17)
#define ESP32_UNIT_62_BIT_18 (1UL << 18)
#define ESP32_UNIT_62_BIT_19 (1UL << 19)
#define ESP32_UNIT_62_BIT_20 (1UL << 20)
#define ESP32_UNIT_62_BIT_21 (1UL << 21)
#define ESP32_UNIT_62_BIT_22 (1UL << 22)
#define ESP32_UNIT_62_BIT_23 (1UL << 23)
#define ESP32_UNIT_62_BIT_24 (1UL << 24)
#define ESP32_UNIT_62_BIT_25 (1UL << 25)
#define ESP32_UNIT_62_BIT_26 (1UL << 26)
#define ESP32_UNIT_62_BIT_27 (1UL << 27)
#define ESP32_UNIT_62_BIT_28 (1UL << 28)
#define ESP32_UNIT_62_BIT_29 (1UL << 29)
#define ESP32_UNIT_62_BIT_30 (1UL << 30)
#define ESP32_UNIT_62_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_63_TypeDef;
#define ESP32_UNIT_63 ((ESP32_UNIT_63_TypeDef *)(0x3FF40000UL + 63 * 0x400UL))

#define ESP32_UNIT_63_BIT_0 (1UL << 0)
#define ESP32_UNIT_63_BIT_1 (1UL << 1)
#define ESP32_UNIT_63_BIT_2 (1UL << 2)
#define ESP32_UNIT_63_BIT_3 (1UL << 3)
#define ESP32_UNIT_63_BIT_4 (1UL << 4)
#define ESP32_UNIT_63_BIT_5 (1UL << 5)
#define ESP32_UNIT_63_BIT_6 (1UL << 6)
#define ESP32_UNIT_63_BIT_7 (1UL << 7)
#define ESP32_UNIT_63_BIT_8 (1UL << 8)
#define ESP32_UNIT_63_BIT_9 (1UL << 9)
#define ESP32_UNIT_63_BIT_10 (1UL << 10)
#define ESP32_UNIT_63_BIT_11 (1UL << 11)
#define ESP32_UNIT_63_BIT_12 (1UL << 12)
#define ESP32_UNIT_63_BIT_13 (1UL << 13)
#define ESP32_UNIT_63_BIT_14 (1UL << 14)
#define ESP32_UNIT_63_BIT_15 (1UL << 15)
#define ESP32_UNIT_63_BIT_16 (1UL << 16)
#define ESP32_UNIT_63_BIT_17 (1UL << 17)
#define ESP32_UNIT_63_BIT_18 (1UL << 18)
#define ESP32_UNIT_63_BIT_19 (1UL << 19)
#define ESP32_UNIT_63_BIT_20 (1UL << 20)
#define ESP32_UNIT_63_BIT_21 (1UL << 21)
#define ESP32_UNIT_63_BIT_22 (1UL << 22)
#define ESP32_UNIT_63_BIT_23 (1UL << 23)
#define ESP32_UNIT_63_BIT_24 (1UL << 24)
#define ESP32_UNIT_63_BIT_25 (1UL << 25)
#define ESP32_UNIT_63_BIT_26 (1UL << 26)
#define ESP32_UNIT_63_BIT_27 (1UL << 27)
#define ESP32_UNIT_63_BIT_28 (1UL << 28)
#define ESP32_UNIT_63_BIT_29 (1UL << 29)
#define ESP32_UNIT_63_BIT_30 (1UL << 30)
#define ESP32_UNIT_63_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_64_TypeDef;
#define ESP32_UNIT_64 ((ESP32_UNIT_64_TypeDef *)(0x3FF40000UL + 64 * 0x400UL))

#define ESP32_UNIT_64_BIT_0 (1UL << 0)
#define ESP32_UNIT_64_BIT_1 (1UL << 1)
#define ESP32_UNIT_64_BIT_2 (1UL << 2)
#define ESP32_UNIT_64_BIT_3 (1UL << 3)
#define ESP32_UNIT_64_BIT_4 (1UL << 4)
#define ESP32_UNIT_64_BIT_5 (1UL << 5)
#define ESP32_UNIT_64_BIT_6 (1UL << 6)
#define ESP32_UNIT_64_BIT_7 (1UL << 7)
#define ESP32_UNIT_64_BIT_8 (1UL << 8)
#define ESP32_UNIT_64_BIT_9 (1UL << 9)
#define ESP32_UNIT_64_BIT_10 (1UL << 10)
#define ESP32_UNIT_64_BIT_11 (1UL << 11)
#define ESP32_UNIT_64_BIT_12 (1UL << 12)
#define ESP32_UNIT_64_BIT_13 (1UL << 13)
#define ESP32_UNIT_64_BIT_14 (1UL << 14)
#define ESP32_UNIT_64_BIT_15 (1UL << 15)
#define ESP32_UNIT_64_BIT_16 (1UL << 16)
#define ESP32_UNIT_64_BIT_17 (1UL << 17)
#define ESP32_UNIT_64_BIT_18 (1UL << 18)
#define ESP32_UNIT_64_BIT_19 (1UL << 19)
#define ESP32_UNIT_64_BIT_20 (1UL << 20)
#define ESP32_UNIT_64_BIT_21 (1UL << 21)
#define ESP32_UNIT_64_BIT_22 (1UL << 22)
#define ESP32_UNIT_64_BIT_23 (1UL << 23)
#define ESP32_UNIT_64_BIT_24 (1UL << 24)
#define ESP32_UNIT_64_BIT_25 (1UL << 25)
#define ESP32_UNIT_64_BIT_26 (1UL << 26)
#define ESP32_UNIT_64_BIT_27 (1UL << 27)
#define ESP32_UNIT_64_BIT_28 (1UL << 28)
#define ESP32_UNIT_64_BIT_29 (1UL << 29)
#define ESP32_UNIT_64_BIT_30 (1UL << 30)
#define ESP32_UNIT_64_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_65_TypeDef;
#define ESP32_UNIT_65 ((ESP32_UNIT_65_TypeDef *)(0x3FF40000UL + 65 * 0x400UL))

#define ESP32_UNIT_65_BIT_0 (1UL << 0)
#define ESP32_UNIT_65_BIT_1 (1UL << 1)
#define ESP32_UNIT_65_BIT_2 (1UL << 2)
#define ESP32_UNIT_65_BIT_3 (1UL << 3)
#define ESP32_UNIT_65_BIT_4 (1UL << 4)
#define ESP32_UNIT_65_BIT_5 (1UL << 5)
#define ESP32_UNIT_65_BIT_6 (1UL << 6)
#define ESP32_UNIT_65_BIT_7 (1UL << 7)
#define ESP32_UNIT_65_BIT_8 (1UL << 8)
#define ESP32_UNIT_65_BIT_9 (1UL << 9)
#define ESP32_UNIT_65_BIT_10 (1UL << 10)
#define ESP32_UNIT_65_BIT_11 (1UL << 11)
#define ESP32_UNIT_65_BIT_12 (1UL << 12)
#define ESP32_UNIT_65_BIT_13 (1UL << 13)
#define ESP32_UNIT_65_BIT_14 (1UL << 14)
#define ESP32_UNIT_65_BIT_15 (1UL << 15)
#define ESP32_UNIT_65_BIT_16 (1UL << 16)
#define ESP32_UNIT_65_BIT_17 (1UL << 17)
#define ESP32_UNIT_65_BIT_18 (1UL << 18)
#define ESP32_UNIT_65_BIT_19 (1UL << 19)
#define ESP32_UNIT_65_BIT_20 (1UL << 20)
#define ESP32_UNIT_65_BIT_21 (1UL << 21)
#define ESP32_UNIT_65_BIT_22 (1UL << 22)
#define ESP32_UNIT_65_BIT_23 (1UL << 23)
#define ESP32_UNIT_65_BIT_24 (1UL << 24)
#define ESP32_UNIT_65_BIT_25 (1UL << 25)
#define ESP32_UNIT_65_BIT_26 (1UL << 26)
#define ESP32_UNIT_65_BIT_27 (1UL << 27)
#define ESP32_UNIT_65_BIT_28 (1UL << 28)
#define ESP32_UNIT_65_BIT_29 (1UL << 29)
#define ESP32_UNIT_65_BIT_30 (1UL << 30)
#define ESP32_UNIT_65_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_66_TypeDef;
#define ESP32_UNIT_66 ((ESP32_UNIT_66_TypeDef *)(0x3FF40000UL + 66 * 0x400UL))

#define ESP32_UNIT_66_BIT_0 (1UL << 0)
#define ESP32_UNIT_66_BIT_1 (1UL << 1)
#define ESP32_UNIT_66_BIT_2 (1UL << 2)
#define ESP32_UNIT_66_BIT_3 (1UL << 3)
#define ESP32_UNIT_66_BIT_4 (1UL << 4)
#define ESP32_UNIT_66_BIT_5 (1UL << 5)
#define ESP32_UNIT_66_BIT_6 (1UL << 6)
#define ESP32_UNIT_66_BIT_7 (1UL << 7)
#define ESP32_UNIT_66_BIT_8 (1UL << 8)
#define ESP32_UNIT_66_BIT_9 (1UL << 9)
#define ESP32_UNIT_66_BIT_10 (1UL << 10)
#define ESP32_UNIT_66_BIT_11 (1UL << 11)
#define ESP32_UNIT_66_BIT_12 (1UL << 12)
#define ESP32_UNIT_66_BIT_13 (1UL << 13)
#define ESP32_UNIT_66_BIT_14 (1UL << 14)
#define ESP32_UNIT_66_BIT_15 (1UL << 15)
#define ESP32_UNIT_66_BIT_16 (1UL << 16)
#define ESP32_UNIT_66_BIT_17 (1UL << 17)
#define ESP32_UNIT_66_BIT_18 (1UL << 18)
#define ESP32_UNIT_66_BIT_19 (1UL << 19)
#define ESP32_UNIT_66_BIT_20 (1UL << 20)
#define ESP32_UNIT_66_BIT_21 (1UL << 21)
#define ESP32_UNIT_66_BIT_22 (1UL << 22)
#define ESP32_UNIT_66_BIT_23 (1UL << 23)
#define ESP32_UNIT_66_BIT_24 (1UL << 24)
#define ESP32_UNIT_66_BIT_25 (1UL << 25)
#define ESP32_UNIT_66_BIT_26 (1UL << 26)
#define ESP32_UNIT_66_BIT_27 (1UL << 27)
#define ESP32_UNIT_66_BIT_28 (1UL << 28)
#define ESP32_UNIT_66_BIT_29 (1UL << 29)
#define ESP32_UNIT_66_BIT_30 (1UL << 30)
#define ESP32_UNIT_66_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_67_TypeDef;
#define ESP32_UNIT_67 ((ESP32_UNIT_67_TypeDef *)(0x3FF40000UL + 67 * 0x400UL))

