RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_67_BIT_0 (1UL << 0)
#define ESP32_UNIT_67_BIT_1 (1UL << 1)
#define ESP32_UNIT_67_BIT_2 (1UL << 2)
#define ESP32_UNIT_67_BIT_3 (1UL << 3)
#define ESP32_UNIT_67_BIT_4 (1UL << 4)
#define ESP32_UNIT_67_BIT_5 (1UL << 5)
#define ESP32_UNIT_67_BIT_6 (1UL << 6)
#define ESP32_UNIT_67_BIT_7 (1UL << 7)
#define ESP32_UNIT_67_BIT_8 (1UL << 8)
#define ESP32_UNIT_67_BIT_9 (1UL << 9)
#define ESP32_UNIT_67_BIT_10 (1UL << 10)
#define ESP32_UNIT_67_BIT_11 (1UL << 11)
#define ESP32_UNIT_67_BIT_12 (1UL << 12)
#define ESP32_UNIT_67_BIT_13 (1UL << 13)
#define ESP32_UNIT_67_BIT_14 (1UL << 14)
#define ESP32_UNIT_67_BIT_15 (1UL << 15)
#define ESP32_UNIT_67_BIT_16 (1UL << 16)
#define ESP32_UNIT_67_BIT_17 (1UL << 17)
#define ESP32_UNIT_67_BIT_18 (1UL << 18)
#define ESP32_UNIT_67_BIT_19 (1UL << 19)
#define ESP32_UNIT_67_BIT_20 (1UL << 20)
#define ESP32_UNIT_67_BIT_21 (1UL << 21)
#define ESP32_UNIT_67_BIT_22 (1UL << 22)
#define ESP32_UNIT_67_BIT_23 (1UL << 23)
#define ESP32_UNIT_67_BIT_24 (1UL << 24)
#define ESP32_UNIT_67_BIT_25 (1UL << 25)
#define ESP32_UNIT_67_BIT_26 (1UL << 26)
#define ESP32_UNIT_67_BIT_27 (1UL << 27)
#define ESP32_UNIT_67_BIT_28 (1UL << 28)
#define ESP32_UNIT_67_BIT_29 (1UL << 29)
#define ESP32_UNIT_67_BIT_30 (1UL << 30)
#define ESP32_UNIT_67_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_68_TypeDef;
#define ESP32_UNIT_68 ((ESP32_UNIT_68_TypeDef *)(0x3FF40000UL + 68 * 0x400UL))

#define ESP32_UNIT_68_BIT_0 (1UL << 0)
#define ESP32_UNIT_68_BIT_1 (1UL << 1)
#define ESP32_UNIT_68_BIT_2 (1UL << 2)
#define ESP32_UNIT_68_BIT_3 (1UL << 3)
#define ESP32_UNIT_68_BIT_4 (1UL << 4)
#define ESP32_UNIT_68_BIT_5 (1UL << 5)
#define ESP32_UNIT_68_BIT_6 (1UL << 6)
#define ESP32_UNIT_68_BIT_7 (1UL << 7)
#define ESP32_UNIT_68_BIT_8 (1UL << 8)
#define ESP32_UNIT_68_BIT_9 (1UL << 9)
#define ESP32_UNIT_68_BIT_10 (1UL << 10)
#define ESP32_UNIT_68_BIT_11 (1UL << 11)
#define ESP32_UNIT_68_BIT_12 (1UL << 12)
#define ESP32_UNIT_68_BIT_13 (1UL << 13)
#define ESP32_UNIT_68_BIT_14 (1UL << 14)
#define ESP32_UNIT_68_BIT_15 (1UL << 15)
#define ESP32_UNIT_68_BIT_16 (1UL << 16)
#define ESP32_UNIT_68_BIT_17 (1UL << 17)
#define ESP32_UNIT_68_BIT_18 (1UL << 18)
#define ESP32_UNIT_68_BIT_19 (1UL << 19)
#define ESP32_UNIT_68_BIT_20 (1UL << 20)
#define ESP32_UNIT_68_BIT_21 (1UL << 21)
#define ESP32_UNIT_68_BIT_22 (1UL << 22)
#define ESP32_UNIT_68_BIT_23 (1UL << 23)
#define ESP32_UNIT_68_BIT_24 (1UL << 24)
#define ESP32_UNIT_68_BIT_25 (1UL << 25)
#define ESP32_UNIT_68_BIT_26 (1UL << 26)
#define ESP32_UNIT_68_BIT_27 (1UL << 27)
#define ESP32_UNIT_68_BIT_28 (1UL << 28)
#define ESP32_UNIT_68_BIT_29 (1UL << 29)
#define ESP32_UNIT_68_BIT_30 (1UL << 30)
#define ESP32_UNIT_68_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_69_TypeDef;
#define ESP32_UNIT_69 ((ESP32_UNIT_69_TypeDef *)(0x3FF40000UL + 69 * 0x400UL))

#define ESP32_UNIT_69_BIT_0 (1UL << 0)
#define ESP32_UNIT_69_BIT_1 (1UL << 1)
#define ESP32_UNIT_69_BIT_2 (1UL << 2)
#define ESP32_UNIT_69_BIT_3 (1UL << 3)
#define ESP32_UNIT_69_BIT_4 (1UL << 4)
#define ESP32_UNIT_69_BIT_5 (1UL << 5)
#define ESP32_UNIT_69_BIT_6 (1UL << 6)
#define ESP32_UNIT_69_BIT_7 (1UL << 7)
#define ESP32_UNIT_69_BIT_8 (1UL << 8)
#define ESP32_UNIT_69_BIT_9 (1UL << 9)
#define ESP32_UNIT_69_BIT_10 (1UL << 10)
#define ESP32_UNIT_69_BIT_11 (1UL << 11)
#define ESP32_UNIT_69_BIT_12 (1UL << 12)
#define ESP32_UNIT_69_BIT_13 (1UL << 13)
#define ESP32_UNIT_69_BIT_14 (1UL << 14)
#define ESP32_UNIT_69_BIT_15 (1UL << 15)
#define ESP32_UNIT_69_BIT_16 (1UL << 16)
#define ESP32_UNIT_69_BIT_17 (1UL << 17)
#define ESP32_UNIT_69_BIT_18 (1UL << 18)
#define ESP32_UNIT_69_BIT_19 (1UL << 19)
#define ESP32_UNIT_69_BIT_20 (1UL << 20)
#define ESP32_UNIT_69_BIT_21 (1UL << 21)
#define ESP32_UNIT_69_BIT_22 (1UL << 22)
#define ESP32_UNIT_69_BIT_23 (1UL << 23)
#define ESP32_UNIT_69_BIT_24 (1UL << 24)
#define ESP32_UNIT_69_BIT_25 (1UL << 25)
#define ESP32_UNIT_69_BIT_26 (1UL << 26)
#define ESP32_UNIT_69_BIT_27 (1UL << 27)
#define ESP32_UNIT_69_BIT_28 (1UL << 28)
#define ESP32_UNIT_69_BIT_29 (1UL << 29)
#define ESP32_UNIT_69_BIT_30 (1UL << 30)
#define ESP32_UNIT_69_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_70_TypeDef;
#define ESP32_UNIT_70 ((ESP32_UNIT_70_TypeDef *)(0x3FF40000UL + 70 * 0x400UL))

#define ESP32_UNIT_70_BIT_0 (1UL << 0)
#define ESP32_UNIT_70_BIT_1 (1UL << 1)
#define ESP32_UNIT_70_BIT_2 (1UL << 2)
#define ESP32_UNIT_70_BIT_3 (1UL << 3)
#define ESP32_UNIT_70_BIT_4 (1UL << 4)
#define ESP32_UNIT_70_BIT_5 (1UL << 5)
#define ESP32_UNIT_70_BIT_6 (1UL << 6)
#define ESP32_UNIT_70_BIT_7 (1UL << 7)
#define ESP32_UNIT_70_BIT_8 (1UL << 8)
#define ESP32_UNIT_70_BIT_9 (1UL << 9)
#define ESP32_UNIT_70_BIT_10 (1UL << 10)
#define ESP32_UNIT_70_BIT_11 (1UL << 11)
#define ESP32_UNIT_70_BIT_12 (1UL << 12)
#define ESP32_UNIT_70_BIT_13 (1UL << 13)
#define ESP32_UNIT_70_BIT_14 (1UL << 14)
#define ESP32_UNIT_70_BIT_15 (1UL << 15)
#define ESP32_UNIT_70_BIT_16 (1UL << 16)
#define ESP32_UNIT_70_BIT_17 (1UL << 17)
#define ESP32_UNIT_70_BIT_18 (1UL << 18)
#define ESP32_UNIT_70_BIT_19 (1UL << 19)
#define ESP32_UNIT_70_BIT_20 (1UL << 20)
#define ESP32_UNIT_70_BIT_21 (1UL << 21)
#define ESP32_UNIT_70_BIT_22 (1UL << 22)
#define ESP32_UNIT_70_BIT_23 (1UL << 23)
#define ESP32_UNIT_70_BIT_24 (1UL << 24)
#define ESP32_UNIT_70_BIT_25 (1UL << 25)
#define ESP32_UNIT_70_BIT_26 (1UL << 26)
#define ESP32_UNIT_70_BIT_27 (1UL << 27)
#define ESP32_UNIT_70_BIT_28 (1UL << 28)
#define ESP32_UNIT_70_BIT_29 (1UL << 29)
#define ESP32_UNIT_70_BIT_30 (1UL << 30)
#define ESP32_UNIT_70_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_71_TypeDef;
#define ESP32_UNIT_71 ((ESP32_UNIT_71_TypeDef *)(0x3FF40000UL + 71 * 0x400UL))

#define ESP32_UNIT_71_BIT_0 (1UL << 0)
#define ESP32_UNIT_71_BIT_1 (1UL << 1)
#define ESP32_UNIT_71_BIT_2 (1UL << 2)
#define ESP32_UNIT_71_BIT_3 (1UL << 3)
#define ESP32_UNIT_71_BIT_4 (1UL << 4)
#define ESP32_UNIT_71_BIT_5 (1UL << 5)
#define ESP32_UNIT_71_BIT_6 (1UL << 6)
#define ESP32_UNIT_71_BIT_7 (1UL << 7)
#define ESP32_UNIT_71_BIT_8 (1UL << 8)
#define ESP32_UNIT_71_BIT_9 (1UL << 9)
#define ESP32_UNIT_71_BIT_10 (1UL << 10)
#define ESP32_UNIT_71_BIT_11 (1UL << 11)
#define ESP32_UNIT_71_BIT_12 (1UL << 12)
#define ESP32_UNIT_71_BIT_13 (1UL << 13)
#define ESP32_UNIT_71_BIT_14 (1UL << 14)
#define ESP32_UNIT_71_BIT_15 (1UL << 15)
#define ESP32_UNIT_71_BIT_16 (1UL << 16)
#define ESP32_UNIT_71_BIT_17 (1UL << 17)
#define ESP32_UNIT_71_BIT_18 (1UL << 18)
#define ESP32_UNIT_71_BIT_19 (1UL << 19)
#define ESP32_UNIT_71_BIT_20 (1UL << 20)
#define ESP32_UNIT_71_BIT_21 (1UL << 21)
#define ESP32_UNIT_71_BIT_22 (1UL << 22)
#define ESP32_UNIT_71_BIT_23 (1UL << 23)
#define ESP32_UNIT_71_BIT_24 (1UL << 24)
#define ESP32_UNIT_71_BIT_25 (1UL << 25)
#define ESP32_UNIT_71_BIT_26 (1UL << 26)
#define ESP32_UNIT_71_BIT_27 (1UL << 27)
#define ESP32_UNIT_71_BIT_28 (1UL << 28)
#define ESP32_UNIT_71_BIT_29 (1UL << 29)
#define ESP32_UNIT_71_BIT_30 (1UL << 30)
#define ESP32_UNIT_71_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_72_TypeDef;
#define ESP32_UNIT_72 ((ESP32_UNIT_72_TypeDef *)(0x3FF40000UL + 72 * 0x400UL))

#define ESP32_UNIT_72_BIT_0 (1UL << 0)
#define ESP32_UNIT_72_BIT_1 (1UL << 1)
#define ESP32_UNIT_72_BIT_2 (1UL << 2)
#define ESP32_UNIT_72_BIT_3 (1UL << 3)
#define ESP32_UNIT_72_BIT_4 (1UL << 4)
#define ESP32_UNIT_72_BIT_5 (1UL << 5)
#define ESP32_UNIT_72_BIT_6 (1UL << 6)
#define ESP32_UNIT_72_BIT_7 (1UL << 7)
#define ESP32_UNIT_72_BIT_8 (1UL << 8)
#define ESP32_UNIT_72_BIT_9 (1UL << 9)
#define ESP32_UNIT_72_BIT_10 (1UL << 10)
#define ESP32_UNIT_72_BIT_11 (1UL << 11)
#define ESP32_UNIT_72_BIT_12 (1UL << 12)
#define ESP32_UNIT_72_BIT_13 (1UL << 13)
#define ESP32_UNIT_72_BIT_14 (1UL << 14)
#define ESP32_UNIT_72_BIT_15 (1UL << 15)
#define ESP32_UNIT_72_BIT_16 (1UL << 16)
#define ESP32_UNIT_72_BIT_17 (1UL << 17)
#define ESP32_UNIT_72_BIT_18 (1UL << 18)
#define ESP32_UNIT_72_BIT_19 (1UL << 19)
#define ESP32_UNIT_72_BIT_20 (1UL << 20)
#define ESP32_UNIT_72_BIT_21 (1UL << 21)
#define ESP32_UNIT_72_BIT_22 (1UL << 22)
#define ESP32_UNIT_72_BIT_23 (1UL << 23)
#define ESP32_UNIT_72_BIT_24 (1UL << 24)
#define ESP32_UNIT_72_BIT_25 (1UL << 25)
#define ESP32_UNIT_72_BIT_26 (1UL << 26)
#define ESP32_UNIT_72_BIT_27 (1UL << 27)
#define ESP32_UNIT_72_BIT_28 (1UL << 28)
#define ESP32_UNIT_72_BIT_29 (1UL << 29)
#define ESP32_UNIT_72_BIT_30 (1UL << 30)
#define ESP32_UNIT_72_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_73_TypeDef;
#define ESP32_UNIT_73 ((ESP32_UNIT_73_TypeDef *)(0x3FF40000UL + 73 * 0x400UL))

#define ESP32_UNIT_73_BIT_0 (1UL << 0)
#define ESP32_UNIT_73_BIT_1 (1UL << 1)
#define ESP32_UNIT_73_BIT_2 (1UL << 2)
#define ESP32_UNIT_73_BIT_3 (1UL << 3)
#define ESP32_UNIT_73_BIT_4 (1UL << 4)
#define ESP32_UNIT_73_BIT_5 (1UL << 5)
#define ESP32_UNIT_73_BIT_6 (1UL << 6)
#define ESP32_UNIT_73_BIT_7 (1UL << 7)
#define ESP32_UNIT_73_BIT_8 (1UL << 8)
#define ESP32_UNIT_73_BIT_9 (1UL << 9)
#define ESP32_UNIT_73_BIT_10 (1UL << 10)
#define ESP32_UNIT_73_BIT_11 (1UL << 11)
#define ESP32_UNIT_73_BIT_12 (1UL << 12)
#define ESP32_UNIT_73_BIT_13 (1UL << 13)
#define ESP32_UNIT_73_BIT_14 (1UL << 14)
#define ESP32_UNIT_73_BIT_15 (1UL << 15)
#define ESP32_UNIT_73_BIT_16 (1UL << 16)
#define ESP32_UNIT_73_BIT_17 (1UL << 17)
#define ESP32_UNIT_73_BIT_18 (1UL << 18)
#define ESP32_UNIT_73_BIT_19 (1UL << 19)
#define ESP32_UNIT_73_BIT_20 (1UL << 20)
#define ESP32_UNIT_73_BIT_21 (1UL << 21)
#define ESP32_UNIT_73_BIT_22 (1UL << 22)
#define ESP32_UNIT_73_BIT_23 (1UL << 23)
#define ESP32_UNIT_73_BIT_24 (1UL << 24)
#define ESP32_UNIT_73_BIT_25 (1UL << 25)
#define ESP32_UNIT_73_BIT_26 (1UL << 26)
#define ESP32_UNIT_73_BIT_27 (1UL << 27)
#define ESP32_UNIT_73_BIT_28 (1UL << 28)
#define ESP32_UNIT_73_BIT_29 (1UL << 29)
#define ESP32_UNIT_73_BIT_30 (1UL << 30)
#define ESP32_UNIT_73_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_74_TypeDef;
#define ESP32_UNIT_74 ((ESP32_UNIT_74_TypeDef *)(0x3FF40000UL + 74 * 0x400UL))

#define ESP32_UNIT_74_BIT_0 (1UL << 0)
#define ESP32_UNIT_74_BIT_1 (1UL << 1)
#define ESP32_UNIT_74_BIT_2 (1UL << 2)
#define ESP32_UNIT_74_BIT_3 (1UL << 3)
#define ESP32_UNIT_74_BIT_4 (1UL << 4)
#define ESP32_UNIT_74_BIT_5 (1UL << 5)
#define ESP32_UNIT_74_BIT_6 (1UL << 6)
#define ESP32_UNIT_74_BIT_7 (1UL << 7)
#define ESP32_UNIT_74_BIT_8 (1UL << 8)
#define ESP32_UNIT_74_BIT_9 (1UL << 9)
#define ESP32_UNIT_74_BIT_10 (1UL << 10)
#define ESP32_UNIT_74_BIT_11 (1UL << 11)
#define ESP32_UNIT_74_BIT_12 (1UL << 12)
#define ESP32_UNIT_74_BIT_13 (1UL << 13)
#define ESP32_UNIT_74_BIT_14 (1UL << 14)
#define ESP32_UNIT_74_BIT_15 (1UL << 15)
#define ESP32_UNIT_74_BIT_16 (1UL << 16)
#define ESP32_UNIT_74_BIT_17 (1UL << 17)
#define ESP32_UNIT_74_BIT_18 (1UL << 18)
#define ESP32_UNIT_74_BIT_19 (1UL << 19)
#define ESP32_UNIT_74_BIT_20 (1UL << 20)
#define ESP32_UNIT_74_BIT_21 (1UL << 21)
#define ESP32_UNIT_74_BIT_22 (1UL << 22)
#define ESP32_UNIT_74_BIT_23 (1UL << 23)
#define ESP32_UNIT_74_BIT_24 (1UL << 24)
#define ESP32_UNIT_74_BIT_25 (1UL << 25)
#define ESP32_UNIT_74_BIT_26 (1UL << 26)
#define ESP32_UNIT_74_BIT_27 (1UL << 27)
#define ESP32_UNIT_74_BIT_28 (1UL << 28)
#define ESP32_UNIT_74_BIT_29 (1UL << 29)
#define ESP32_UNIT_74_BIT_30 (1UL << 30)
#define ESP32_UNIT_74_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_75_TypeDef;
#define ESP32_UNIT_75 ((ESP32_UNIT_75_TypeDef *)(0x3FF40000UL + 75 * 0x400UL))

#define ESP32_UNIT_75_BIT_0 (1UL << 0)
#define ESP32_UNIT_75_BIT_1 (1UL << 1)
#define ESP32_UNIT_75_BIT_2 (1UL << 2)
#define ESP32_UNIT_75_BIT_3 (1UL << 3)
#define ESP32_UNIT_75_BIT_4 (1UL << 4)
#define ESP32_UNIT_75_BIT_5 (1UL << 5)
#define ESP32_UNIT_75_BIT_6 (1UL << 6)
#define ESP32_UNIT_75_BIT_7 (1UL << 7)
#define ESP32_UNIT_75_BIT_8 (1UL << 8)
#define ESP32_UNIT_75_BIT_9 (1UL << 9)
#define ESP32_UNIT_75_BIT_10 (1UL << 10)
#define ESP32_UNIT_75_BIT_11 (1UL << 11)
#define ESP32_UNIT_75_BIT_12 (1UL << 12)
#define ESP32_UNIT_75_BIT_13 (1UL << 13)
#define ESP32_UNIT_75_BIT_14 (1UL << 14)
#define ESP32_UNIT_75_BIT_15 (1UL << 15)
#define ESP32_UNIT_75_BIT_16 (1UL << 16)
#define ESP32_UNIT_75_BIT_17 (1UL << 17)
#define ESP32_UNIT_75_BIT_18 (1UL << 18)
#define ESP32_UNIT_75_BIT_19 (1UL << 19)
#define ESP32_UNIT_75_BIT_20 (1UL << 20)
#define ESP32_UNIT_75_BIT_21 (1UL << 21)
#define ESP32_UNIT_75_BIT_22 (1UL << 22)
#define ESP32_UNIT_75_BIT_23 (1UL << 23)
#define ESP32_UNIT_75_BIT_24 (1UL << 24)
#define ESP32_UNIT_75_BIT_25 (1UL << 25)
#define ESP32_UNIT_75_BIT_26 (1UL << 26)
#define ESP32_UNIT_75_BIT_27 (1UL << 27)
#define ESP32_UNIT_75_BIT_28 (1UL << 28)
#define ESP32_UNIT_75_BIT_29 (1UL << 29)
#define ESP32_UNIT_75_BIT_30 (1UL << 30)
#define ESP32_UNIT_75_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_76_TypeDef;
#define ESP32_UNIT_76 ((ESP32_UNIT_76_TypeDef *)(0x3FF40000UL + 76 * 0x400UL))

#define ESP32_UNIT_76_BIT_0 (1UL << 0)
#define ESP32_UNIT_76_BIT_1 (1UL << 1)
#define ESP32_UNIT_76_BIT_2 (1UL << 2)
#define ESP32_UNIT_76_BIT_3 (1UL << 3)
#define ESP32_UNIT_76_BIT_4 (1UL << 4)
#define ESP32_UNIT_76_BIT_5 (1UL << 5)
#define ESP32_UNIT_76_BIT_6 (1UL << 6)
#define ESP32_UNIT_76_BIT_7 (1UL << 7)
#define ESP32_UNIT_76_BIT_8 (1UL << 8)
#define ESP32_UNIT_76_BIT_9 (1UL << 9)
#define ESP32_UNIT_76_BIT_10 (1UL << 10)
#define ESP32_UNIT_76_BIT_11 (1UL << 11)
#define ESP32_UNIT_76_BIT_12 (1UL << 12)
#define ESP32_UNIT_76_BIT_13 (1UL << 13)
#define ESP32_UNIT_76_BIT_14 (1UL << 14)
#define ESP32_UNIT_76_BIT_15 (1UL << 15)
#define ESP32_UNIT_76_BIT_16 (1UL << 16)
#define ESP32_UNIT_76_BIT_17 (1UL << 17)
#define ESP32_UNIT_76_BIT_18 (1UL << 18)
#define ESP32_UNIT_76_BIT_19 (1UL << 19)
#define ESP32_UNIT_76_BIT_20 (1UL << 20)
#define ESP32_UNIT_76_BIT_21 (1UL << 21)
#define ESP32_UNIT_76_BIT_22 (1UL << 22)
#define ESP32_UNIT_76_BIT_23 (1UL << 23)
#define ESP32_UNIT_76_BIT_24 (1UL << 24)
#define ESP32_UNIT_76_BIT_25 (1UL << 25)
#define ESP32_UNIT_76_BIT_26 (1UL << 26)
#define ESP32_UNIT_76_BIT_27 (1UL << 27)
#define ESP32_UNIT_76_BIT_28 (1UL << 28)
#define ESP32_UNIT_76_BIT_29 (1UL << 29)
#define ESP32_UNIT_76_BIT_30 (1UL << 30)
#define ESP32_UNIT_76_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_77_TypeDef;
#define ESP32_UNIT_77 ((ESP32_UNIT_77_TypeDef *)(0x3FF40000UL + 77 * 0x400UL))

