RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_77_BIT_0 (1UL << 0)
#define ESP32_UNIT_77_BIT_1 (1UL << 1)
#define ESP32_UNIT_77_BIT_2 (1UL << 2)
#define ESP32_UNIT_77_BIT_3 (1UL << 3)
#define ESP32_UNIT_77_BIT_4 (1UL << 4)
#define ESP32_UNIT_77_BIT_5 (1UL << 5)
#define ESP32_UNIT_77_BIT_6 (1UL << 6)
#define ESP32_UNIT_77_BIT_7 (1UL << 7)
#define ESP32_UNIT_77_BIT_8 (1UL << 8)
#define ESP32_UNIT_77_BIT_9 (1UL << 9)
#define ESP32_UNIT_77_BIT_10 (1UL << 10)
#define ESP32_UNIT_77_BIT_11 (1UL << 11)
#define ESP32_UNIT_77_BIT_12 (1UL << 12)
#define ESP32_UNIT_77_BIT_13 (1UL << 13)
#define ESP32_UNIT_77_BIT_14 (1UL << 14)
#define ESP32_UNIT_77_BIT_15 (1UL << 15)
#define ESP32_UNIT_77_BIT_16 (1UL << 16)
#define ESP32_UNIT_77_BIT_17 (1UL << 17)
#define ESP32_UNIT_77_BIT_18 (1UL << 18)
#define ESP32_UNIT_77_BIT_19 (1UL << 19)
#define ESP32_UNIT_77_BIT_20 (1UL << 20)
#define ESP32_UNIT_77_BIT_21 (1UL << 21)
#define ESP32_UNIT_77_BIT_22 (1UL << 22)
#define ESP32_UNIT_77_BIT_23 (1UL << 23)
#define ESP32_UNIT_77_BIT_24 (1UL << 24)
#define ESP32_UNIT_77_BIT_25 (1UL << 25)
#define ESP32_UNIT_77_BIT_26 (1UL << 26)
#define ESP32_UNIT_77_BIT_27 (1UL << 27)
#define ESP32_UNIT_77_BIT_28 (1UL << 28)
#define ESP32_UNIT_77_BIT_29 (1UL << 29)
#define ESP32_UNIT_77_BIT_30 (1UL << 30)
#define ESP32_UNIT_77_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_78_TypeDef;
#define ESP32_UNIT_78 ((ESP32_UNIT_78_TypeDef *)(0x3FF40000UL + 78 * 0x400UL))

#define ESP32_UNIT_78_BIT_0 (1UL << 0)
#define ESP32_UNIT_78_BIT_1 (1UL << 1)
#define ESP32_UNIT_78_BIT_2 (1UL << 2)
#define ESP32_UNIT_78_BIT_3 (1UL << 3)
#define ESP32_UNIT_78_BIT_4 (1UL << 4)
#define ESP32_UNIT_78_BIT_5 (1UL << 5)
#define ESP32_UNIT_78_BIT_6 (1UL << 6)
#define ESP32_UNIT_78_BIT_7 (1UL << 7)
#define ESP32_UNIT_78_BIT_8 (1UL << 8)
#define ESP32_UNIT_78_BIT_9 (1UL << 9)
#define ESP32_UNIT_78_BIT_10 (1UL << 10)
#define ESP32_UNIT_78_BIT_11 (1UL << 11)
#define ESP32_UNIT_78_BIT_12 (1UL << 12)
#define ESP32_UNIT_78_BIT_13 (1UL << 13)
#define ESP32_UNIT_78_BIT_14 (1UL << 14)
#define ESP32_UNIT_78_BIT_15 (1UL << 15)
#define ESP32_UNIT_78_BIT_16 (1UL << 16)
#define ESP32_UNIT_78_BIT_17 (1UL << 17)
#define ESP32_UNIT_78_BIT_18 (1UL << 18)
#define ESP32_UNIT_78_BIT_19 (1UL << 19)
#define ESP32_UNIT_78_BIT_20 (1UL << 20)
#define ESP32_UNIT_78_BIT_21 (1UL << 21)
#define ESP32_UNIT_78_BIT_22 (1UL << 22)
#define ESP32_UNIT_78_BIT_23 (1UL << 23)
#define ESP32_UNIT_78_BIT_24 (1UL << 24)
#define ESP32_UNIT_78_BIT_25 (1UL << 25)
#define ESP32_UNIT_78_BIT_26 (1UL << 26)
#define ESP32_UNIT_78_BIT_27 (1UL << 27)
#define ESP32_UNIT_78_BIT_28 (1UL << 28)
#define ESP32_UNIT_78_BIT_29 (1UL << 29)
#define ESP32_UNIT_78_BIT_30 (1UL << 30)
#define ESP32_UNIT_78_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_79_TypeDef;
#define ESP32_UNIT_79 ((ESP32_UNIT_79_TypeDef *)(0x3FF40000UL + 79 * 0x400UL))

#define ESP32_UNIT_79_BIT_0 (1UL << 0)
#define ESP32_UNIT_79_BIT_1 (1UL << 1)
#define ESP32_UNIT_79_BIT_2 (1UL << 2)
#define ESP32_UNIT_79_BIT_3 (1UL << 3)
#define ESP32_UNIT_79_BIT_4 (1UL << 4)
#define ESP32_UNIT_79_BIT_5 (1UL << 5)
#define ESP32_UNIT_79_BIT_6 (1UL << 6)
#define ESP32_UNIT_79_BIT_7 (1UL << 7)
#define ESP32_UNIT_79_BIT_8 (1UL << 8)
#define ESP32_UNIT_79_BIT_9 (1UL << 9)
#define ESP32_UNIT_79_BIT_10 (1UL << 10)
#define ESP32_UNIT_79_BIT_11 (1UL << 11)
#define ESP32_UNIT_79_BIT_12 (1UL << 12)
#define ESP32_UNIT_79_BIT_13 (1UL << 13)
#define ESP32_UNIT_79_BIT_14 (1UL << 14)
#define ESP32_UNIT_79_BIT_15 (1UL << 15)
#define ESP32_UNIT_79_BIT_16 (1UL << 16)
#define ESP32_UNIT_79_BIT_17 (1UL << 17)
#define ESP32_UNIT_79_BIT_18 (1UL << 18)
#define ESP32_UNIT_79_BIT_19 (1UL << 19)
#define ESP32_UNIT_79_BIT_20 (1UL << 20)
#define ESP32_UNIT_79_BIT_21 (1UL << 21)
#define ESP32_UNIT_79_BIT_22 (1UL << 22)
#define ESP32_UNIT_79_BIT_23 (1UL << 23)
#define ESP32_UNIT_79_BIT_24 (1UL << 24)
#define ESP32_UNIT_79_BIT_25 (1UL << 25)
#define ESP32_UNIT_79_BIT_26 (1UL << 26)
#define ESP32_UNIT_79_BIT_27 (1UL << 27)
#define ESP32_UNIT_79_BIT_28 (1UL << 28)
#define ESP32_UNIT_79_BIT_29 (1UL << 29)
#define ESP32_UNIT_79_BIT_30 (1UL << 30)
#define ESP32_UNIT_79_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_80_TypeDef;
#define ESP32_UNIT_80 ((ESP32_UNIT_80_TypeDef *)(0x3FF40000UL + 80 * 0x400UL))

#define ESP32_UNIT_80_BIT_0 (1UL << 0)
#define ESP32_UNIT_80_BIT_1 (1UL << 1)
#define ESP32_UNIT_80_BIT_2 (1UL << 2)
#define ESP32_UNIT_80_BIT_3 (1UL << 3)
#define ESP32_UNIT_80_BIT_4 (1UL << 4)
#define ESP32_UNIT_80_BIT_5 (1UL << 5)
#define ESP32_UNIT_80_BIT_6 (1UL << 6)
#define ESP32_UNIT_80_BIT_7 (1UL << 7)
#define ESP32_UNIT_80_BIT_8 (1UL << 8)
#define ESP32_UNIT_80_BIT_9 (1UL << 9)
#define ESP32_UNIT_80_BIT_10 (1UL << 10)
#define ESP32_UNIT_80_BIT_11 (1UL << 11)
#define ESP32_UNIT_80_BIT_12 (1UL << 12)
#define ESP32_UNIT_80_BIT_13 (1UL << 13)
#define ESP32_UNIT_80_BIT_14 (1UL << 14)
#define ESP32_UNIT_80_BIT_15 (1UL << 15)
#define ESP32_UNIT_80_BIT_16 (1UL << 16)
#define ESP32_UNIT_80_BIT_17 (1UL << 17)
#define ESP32_UNIT_80_BIT_18 (1UL << 18)
#define ESP32_UNIT_80_BIT_19 (1UL << 19)
#define ESP32_UNIT_80_BIT_20 (1UL << 20)
#define ESP32_UNIT_80_BIT_21 (1UL << 21)
#define ESP32_UNIT_80_BIT_22 (1UL << 22)
#define ESP32_UNIT_80_BIT_23 (1UL << 23)
#define ESP32_UNIT_80_BIT_24 (1UL << 24)
#define ESP32_UNIT_80_BIT_25 (1UL << 25)
#define ESP32_UNIT_80_BIT_26 (1UL << 26)
#define ESP32_UNIT_80_BIT_27 (1UL << 27)
#define ESP32_UNIT_80_BIT_28 (1UL << 28)
#define ESP32_UNIT_80_BIT_29 (1UL << 29)
#define ESP32_UNIT_80_BIT_30 (1UL << 30)
#define ESP32_UNIT_80_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_81_TypeDef;
#define ESP32_UNIT_81 ((ESP32_UNIT_81_TypeDef *)(0x3FF40000UL + 81 * 0x400UL))

#define ESP32_UNIT_81_BIT_0 (1UL << 0)
#define ESP32_UNIT_81_BIT_1 (1UL << 1)
#define ESP32_UNIT_81_BIT_2 (1UL << 2)
#define ESP32_UNIT_81_BIT_3 (1UL << 3)
#define ESP32_UNIT_81_BIT_4 (1UL << 4)
#define ESP32_UNIT_81_BIT_5 (1UL << 5)
#define ESP32_UNIT_81_BIT_6 (1UL << 6)
#define ESP32_UNIT_81_BIT_7 (1UL << 7)
#define ESP32_UNIT_81_BIT_8 (1UL << 8)
#define ESP32_UNIT_81_BIT_9 (1UL << 9)
#define ESP32_UNIT_81_BIT_10 (1UL << 10)
#define ESP32_UNIT_81_BIT_11 (1UL << 11)
#define ESP32_UNIT_81_BIT_12 (1UL << 12)
#define ESP32_UNIT_81_BIT_13 (1UL << 13)
#define ESP32_UNIT_81_BIT_14 (1UL << 14)
#define ESP32_UNIT_81_BIT_15 (1UL << 15)
#define ESP32_UNIT_81_BIT_16 (1UL << 16)
#define ESP32_UNIT_81_BIT_17 (1UL << 17)
#define ESP32_UNIT_81_BIT_18 (1UL << 18)
#define ESP32_UNIT_81_BIT_19 (1UL << 19)
#define ESP32_UNIT_81_BIT_20 (1UL << 20)
#define ESP32_UNIT_81_BIT_21 (1UL << 21)
#define ESP32_UNIT_81_BIT_22 (1UL << 22)
#define ESP32_UNIT_81_BIT_23 (1UL << 23)
#define ESP32_UNIT_81_BIT_24 (1UL << 24)
#define ESP32_UNIT_81_BIT_25 (1UL << 25)
#define ESP32_UNIT_81_BIT_26 (1UL << 26)
#define ESP32_UNIT_81_BIT_27 (1UL << 27)
#define ESP32_UNIT_81_BIT_28 (1UL << 28)
#define ESP32_UNIT_81_BIT_29 (1UL << 29)
#define ESP32_UNIT_81_BIT_30 (1UL << 30)
#define ESP32_UNIT_81_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_82_TypeDef;
#define ESP32_UNIT_82 ((ESP32_UNIT_82_TypeDef *)(0x3FF40000UL + 82 * 0x400UL))

#define ESP32_UNIT_82_BIT_0 (1UL << 0)
#define ESP32_UNIT_82_BIT_1 (1UL << 1)
#define ESP32_UNIT_82_BIT_2 (1UL << 2)
#define ESP32_UNIT_82_BIT_3 (1UL << 3)
#define ESP32_UNIT_82_BIT_4 (1UL << 4)
#define ESP32_UNIT_82_BIT_5 (1UL << 5)
#define ESP32_UNIT_82_BIT_6 (1UL << 6)
#define ESP32_UNIT_82_BIT_7 (1UL << 7)
#define ESP32_UNIT_82_BIT_8 (1UL << 8)
#define ESP32_UNIT_82_BIT_9 (1UL << 9)
#define ESP32_UNIT_82_BIT_10 (1UL << 10)
#define ESP32_UNIT_82_BIT_11 (1UL << 11)
#define ESP32_UNIT_82_BIT_12 (1UL << 12)
#define ESP32_UNIT_82_BIT_13 (1UL << 13)
#define ESP32_UNIT_82_BIT_14 (1UL << 14)
#define ESP32_UNIT_82_BIT_15 (1UL << 15)
#define ESP32_UNIT_82_BIT_16 (1UL << 16)
#define ESP32_UNIT_82_BIT_17 (1UL << 17)
#define ESP32_UNIT_82_BIT_18 (1UL << 18)
#define ESP32_UNIT_82_BIT_19 (1UL << 19)
#define ESP32_UNIT_82_BIT_20 (1UL << 20)
#define ESP32_UNIT_82_BIT_21 (1UL << 21)
#define ESP32_UNIT_82_BIT_22 (1UL << 22)
#define ESP32_UNIT_82_BIT_23 (1UL << 23)
#define ESP32_UNIT_82_BIT_24 (1UL << 24)
#define ESP32_UNIT_82_BIT_25 (1UL << 25)
#define ESP32_UNIT_82_BIT_26 (1UL << 26)
#define ESP32_UNIT_82_BIT_27 (1UL << 27)
#define ESP32_UNIT_82_BIT_28 (1UL << 28)
#define ESP32_UNIT_82_BIT_29 (1UL << 29)
#define ESP32_UNIT_82_BIT_30 (1UL << 30)
#define ESP32_UNIT_82_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_83_TypeDef;
#define ESP32_UNIT_83 ((ESP32_UNIT_83_TypeDef *)(0x3FF40000UL + 83 * 0x400UL))

