RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_83_BIT_0 (1UL << 0)
#define ESP32_UNIT_83_BIT_1 (1UL << 1)
#define ESP32_UNIT_83_BIT_2 (1UL << 2)
#define ESP32_UNIT_83_BIT_3 (1UL << 3)
#define ESP32_UNIT_83_BIT_4 (1UL << 4)
#define ESP32_UNIT_83_BIT_5 (1UL << 5)
#define ESP32_UNIT_83_BIT_6 (1UL << 6)
#define ESP32_UNIT_83_BIT_7 (1UL << 7)
#define ESP32_UNIT_83_BIT_8 (1UL << 8)
#define ESP32_UNIT_83_BIT_9 (1UL << 9)
#define ESP32_UNIT_83_BIT_10 (1UL << 10)
#define ESP32_UNIT_83_BIT_11 (1UL << 11)
#define ESP32_UNIT_83_BIT_12 (1UL << 12)
#define ESP32_UNIT_83_BIT_13 (1UL << 13)
#define ESP32_UNIT_83_BIT_14 (1UL << 14)
#define ESP32_UNIT_83_BIT_15 (1UL << 15)
#define ESP32_UNIT_83_BIT_16 (1UL << 16)
#define ESP32_UNIT_83_BIT_17 (1UL << 17)
#define ESP32_UNIT_83_BIT_18 (1UL << 18)
#define ESP32_UNIT_83_BIT_19 (1UL << 19)
#define ESP32_UNIT_83_BIT_20 (1UL << 20)
#define ESP32_UNIT_83_BIT_21 (1UL << 21)
#define ESP32_UNIT_83_BIT_22 (1UL << 22)
#define ESP32_UNIT_83_BIT_23 (1UL << 23)
#define ESP32_UNIT_83_BIT_24 (1UL << 24)
#define ESP32_UNIT_83_BIT_25 (1UL << 25)
#define ESP32_UNIT_83_BIT_26 (1UL << 26)
#define ESP32_UNIT_83_BIT_27 (1UL << 27)
#define ESP32_UNIT_83_BIT_28 (1UL << 28)
#define ESP32_UNIT_83_BIT_29 (1UL << 29)
#define ESP32_UNIT_83_BIT_30 (1UL << 30)
#define ESP32_UNIT_83_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_84_TypeDef;
#define ESP32_UNIT_84 ((ESP32_UNIT_84_TypeDef *)(0x3FF40000UL + 84 * 0x400UL))

#define ESP32_UNIT_84_BIT_0 (1UL << 0)
#define ESP32_UNIT_84_BIT_1 (1UL << 1)
#define ESP32_UNIT_84_BIT_2 (1UL << 2)
#define ESP32_UNIT_84_BIT_3 (1UL << 3)
#define ESP32_UNIT_84_BIT_4 (1UL << 4)
#define ESP32_UNIT_84_BIT_5 (1UL << 5)
#define ESP32_UNIT_84_BIT_6 (1UL << 6)
#define ESP32_UNIT_84_BIT_7 (1UL << 7)
#define ESP32_UNIT_84_BIT_8 (1UL << 8)
#define ESP32_UNIT_84_BIT_9 (1UL << 9)
#define ESP32_UNIT_84_BIT_10 (1UL << 10)
#define ESP32_UNIT_84_BIT_11 (1UL << 11)
#define ESP32_UNIT_84_BIT_12 (1UL << 12)
#define ESP32_UNIT_84_BIT_13 (1UL << 13)
#define ESP32_UNIT_84_BIT_14 (1UL << 14)
#define ESP32_UNIT_84_BIT_15 (1UL << 15)
#define ESP32_UNIT_84_BIT_16 (1UL << 16)
#define ESP32_UNIT_84_BIT_17 (1UL << 17)
#define ESP32_UNIT_84_BIT_18 (1UL << 18)
#define ESP32_UNIT_84_BIT_19 (1UL << 19)
#define ESP32_UNIT_84_BIT_20 (1UL << 20)
#define ESP32_UNIT_84_BIT_21 (1UL << 21)
#define ESP32_UNIT_84_BIT_22 (1UL << 22)
#define ESP32_UNIT_84_BIT_23 (1UL << 23)
#define ESP32_UNIT_84_BIT_24 (1UL << 24)
#define ESP32_UNIT_84_BIT_25 (1UL << 25)
#define ESP32_UNIT_84_BIT_26 (1UL << 26)
#define ESP32_UNIT_84_BIT_27 (1UL << 27)
#define ESP32_UNIT_84_BIT_28 (1UL << 28)
#define ESP32_UNIT_84_BIT_29 (1UL << 29)
#define ESP32_UNIT_84_BIT_30 (1UL << 30)
#define ESP32_UNIT_84_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_85_TypeDef;
#define ESP32_UNIT_85 ((ESP32_UNIT_85_TypeDef *)(0x3FF40000UL + 85 * 0x400UL))

#define ESP32_UNIT_85_BIT_0 (1UL << 0)
#define ESP32_UNIT_85_BIT_1 (1UL << 1)
#define ESP32_UNIT_85_BIT_2 (1UL << 2)
#define ESP32_UNIT_85_BIT_3 (1UL << 3)
#define ESP32_UNIT_85_BIT_4 (1UL << 4)
#define ESP32_UNIT_85_BIT_5 (1UL << 5)
#define ESP32_UNIT_85_BIT_6 (1UL << 6)
#define ESP32_UNIT_85_BIT_7 (1UL << 7)
#define ESP32_UNIT_85_BIT_8 (1UL << 8)
#define ESP32_UNIT_85_BIT_9 (1UL << 9)
#define ESP32_UNIT_85_BIT_10 (1UL << 10)
#define ESP32_UNIT_85_BIT_11 (1UL << 11)
#define ESP32_UNIT_85_BIT_12 (1UL << 12)
#define ESP32_UNIT_85_BIT_13 (1UL << 13)
#define ESP32_UNIT_85_BIT_14 (1UL << 14)
#define ESP32_UNIT_85_BIT_15 (1UL << 15)
#define ESP32_UNIT_85_BIT_16 (1UL << 16)
#define ESP32_UNIT_85_BIT_17 (1UL << 17)
#define ESP32_UNIT_85_BIT_18 (1UL << 18)
#define ESP32_UNIT_85_BIT_19 (1UL << 19)
#define ESP32_UNIT_85_BIT_20 (1UL << 20)
#define ESP32_UNIT_85_BIT_21 (1UL << 21)
#define ESP32_UNIT_85_BIT_22 (1UL << 22)
#define ESP32_UNIT_85_BIT_23 (1UL << 23)
#define ESP32_UNIT_85_BIT_24 (1UL << 24)
#define ESP32_UNIT_85_BIT_25 (1UL << 25)
#define ESP32_UNIT_85_BIT_26 (1UL << 26)
#define ESP32_UNIT_85_BIT_27 (1UL << 27)
#define ESP32_UNIT_85_BIT_28 (1UL << 28)
#define ESP32_UNIT_85_BIT_29 (1UL << 29)
#define ESP32_UNIT_85_BIT_30 (1UL << 30)
#define ESP32_UNIT_85_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_86_TypeDef;
#define ESP32_UNIT_86 ((ESP32_UNIT_86_TypeDef *)(0x3FF40000UL + 86 * 0x400UL))

#define ESP32_UNIT_86_BIT_0 (1UL << 0)
#define ESP32_UNIT_86_BIT_1 (1UL << 1)
#define ESP32_UNIT_86_BIT_2 (1UL << 2)
#define ESP32_UNIT_86_BIT_3 (1UL << 3)
#define ESP32_UNIT_86_BIT_4 (1UL << 4)
#define ESP32_UNIT_86_BIT_5 (1UL << 5)
#define ESP32_UNIT_86_BIT_6 (1UL << 6)
#define ESP32_UNIT_86_BIT_7 (1UL << 7)
#define ESP32_UNIT_86_BIT_8 (1UL << 8)
#define ESP32_UNIT_86_BIT_9 (1UL << 9)
#define ESP32_UNIT_86_BIT_10 (1UL << 10)
#define ESP32_UNIT_86_BIT_11 (1UL << 11)
#define ESP32_UNIT_86_BIT_12 (1UL << 12)
#define ESP32_UNIT_86_BIT_13 (1UL << 13)
#define ESP32_UNIT_86_BIT_14 (1UL << 14)
#define ESP32_UNIT_86_BIT_15 (1UL << 15)
#define ESP32_UNIT_86_BIT_16 (1UL << 16)
#define ESP32_UNIT_86_BIT_17 (1UL << 17)
#define ESP32_UNIT_86_BIT_18 (1UL << 18)
#define ESP32_UNIT_86_BIT_19 (1UL << 19)
#define ESP32_UNIT_86_BIT_20 (1UL << 20)
#define ESP32_UNIT_86_BIT_21 (1UL << 21)
#define ESP32_UNIT_86_BIT_22 (1UL << 22)
#define ESP32_UNIT_86_BIT_23 (1UL << 23)
#define ESP32_UNIT_86_BIT_24 (1UL << 24)
#define ESP32_UNIT_86_BIT_25 (1UL << 25)
#define ESP32_UNIT_86_BIT_26 (1UL << 26)
#define ESP32_UNIT_86_BIT_27 (1UL << 27)
#define ESP32_UNIT_86_BIT_28 (1UL << 28)
#define ESP32_UNIT_86_BIT_29 (1UL << 29)
#define ESP32_UNIT_86_BIT_30 (1UL << 30)
#define ESP32_UNIT_86_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_87_TypeDef;
#define ESP32_UNIT_87 ((ESP32_UNIT_87_TypeDef *)(0x3FF40000UL + 87 * 0x400UL))

#define ESP32_UNIT_87_BIT_0 (1UL << 0)
#define ESP32_UNIT_87_BIT_1 (1UL << 1)
#define ESP32_UNIT_87_BIT_2 (1UL << 2)
#define ESP32_UNIT_87_BIT_3 (1UL << 3)
#define ESP32_UNIT_87_BIT_4 (1UL << 4)
#define ESP32_UNIT_87_BIT_5 (1UL << 5)
#define ESP32_UNIT_87_BIT_6 (1UL << 6)
#define ESP32_UNIT_87_BIT_7 (1UL << 7)
#define ESP32_UNIT_87_BIT_8 (1UL << 8)
#define ESP32_UNIT_87_BIT_9 (1UL << 9)
#define ESP32_UNIT_87_BIT_10 (1UL << 10)
#define ESP32_UNIT_87_BIT_11 (1UL << 11)
#define ESP32_UNIT_87_BIT_12 (1UL << 12)
#define ESP32_UNIT_87_BIT_13 (1UL << 13)
#define ESP32_UNIT_87_BIT_14 (1UL << 14)
#define ESP32_UNIT_87_BIT_15 (1UL << 15)
#define ESP32_UNIT_87_BIT_16 (1UL << 16)
#define ESP32_UNIT_87_BIT_17 (1UL << 17)
#define ESP32_UNIT_87_BIT_18 (1UL << 18)
#define ESP32_UNIT_87_BIT_19 (1UL << 19)
#define ESP32_UNIT_87_BIT_20 (1UL << 20)
#define ESP32_UNIT_87_BIT_21 (1UL << 21)
#define ESP32_UNIT_87_BIT_22 (1UL << 22)
#define ESP32_UNIT_87_BIT_23 (1UL << 23)
#define ESP32_UNIT_87_BIT_24 (1UL << 24)
#define ESP32_UNIT_87_BIT_25 (1UL << 25)
#define ESP32_UNIT_87_BIT_26 (1UL << 26)
#define ESP32_UNIT_87_BIT_27 (1UL << 27)
#define ESP32_UNIT_87_BIT_28 (1UL << 28)
#define ESP32_UNIT_87_BIT_29 (1UL << 29)
#define ESP32_UNIT_87_BIT_30 (1UL << 30)
#define ESP32_UNIT_87_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_88_TypeDef;
#define ESP32_UNIT_88 ((ESP32_UNIT_88_TypeDef *)(0x3FF40000UL + 88 * 0x400UL))

#define ESP32_UNIT_88_BIT_0 (1UL << 0)
#define ESP32_UNIT_88_BIT_1 (1UL << 1)
#define ESP32_UNIT_88_BIT_2 (1UL << 2)
#define ESP32_UNIT_88_BIT_3 (1UL << 3)
#define ESP32_UNIT_88_BIT_4 (1UL << 4)
#define ESP32_UNIT_88_BIT_5 (1UL << 5)
#define ESP32_UNIT_88_BIT_6 (1UL << 6)
#define ESP32_UNIT_88_BIT_7 (1UL << 7)
#define ESP32_UNIT_88_BIT_8 (1UL << 8)
#define ESP32_UNIT_88_BIT_9 (1UL << 9)
#define ESP32_UNIT_88_BIT_10 (1UL << 10)
#define ESP32_UNIT_88_BIT_11 (1UL << 11)
#define ESP32_UNIT_88_BIT_12 (1UL << 12)
#define ESP32_UNIT_88_BIT_13 (1UL << 13)
#define ESP32_UNIT_88_BIT_14 (1UL << 14)
#define ESP32_UNIT_88_BIT_15 (1UL << 15)
#define ESP32_UNIT_88_BIT_16 (1UL << 16)
#define ESP32_UNIT_88_BIT_17 (1UL << 17)
#define ESP32_UNIT_88_BIT_18 (1UL << 18)
#define ESP32_UNIT_88_BIT_19 (1UL << 19)
#define ESP32_UNIT_88_BIT_20 (1UL << 20)
#define ESP32_UNIT_88_BIT_21 (1UL << 21)
#define ESP32_UNIT_88_BIT_22 (1UL << 22)
#define ESP32_UNIT_88_BIT_23 (1UL << 23)
#define ESP32_UNIT_88_BIT_24 (1UL << 24)
#define ESP32_UNIT_88_BIT_25 (1UL << 25)
#define ESP32_UNIT_88_BIT_26 (1UL << 26)
#define ESP32_UNIT_88_BIT_27 (1UL << 27)
#define ESP32_UNIT_88_BIT_28 (1UL << 28)
#define ESP32_UNIT_88_BIT_29 (1UL << 29)
#define ESP32_UNIT_88_BIT_30 (1UL << 30)
#define ESP32_UNIT_88_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_89_TypeDef;
#define ESP32_UNIT_89 ((ESP32_UNIT_89_TypeDef *)(0x3FF40000UL + 89 * 0x400UL))

#define ESP32_UNIT_89_BIT_0 (1UL << 0)
#define ESP32_UNIT_89_BIT_1 (1UL << 1)
#define ESP32_UNIT_89_BIT_2 (1UL << 2)
#define ESP32_UNIT_89_BIT_3 (1UL << 3)
#define ESP32_UNIT_89_BIT_4 (1UL << 4)
#define ESP32_UNIT_89_BIT_5 (1UL << 5)
#define ESP32_UNIT_89_BIT_6 (1UL << 6)
#define ESP32_UNIT_89_BIT_7 (1UL << 7)
#define ESP32_UNIT_89_BIT_8 (1UL << 8)
#define ESP32_UNIT_89_BIT_9 (1UL << 9)
#define ESP32_UNIT_89_BIT_10 (1UL << 10)
#define ESP32_UNIT_89_BIT_11 (1UL << 11)
#define ESP32_UNIT_89_BIT_12 (1UL << 12)
#define ESP32_UNIT_89_BIT_13 (1UL << 13)
#define ESP32_UNIT_89_BIT_14 (1UL << 14)
#define ESP32_UNIT_89_BIT_15 (1UL << 15)
#define ESP32_UNIT_89_BIT_16 (1UL << 16)
#define ESP32_UNIT_89_BIT_17 (1UL << 17)
#define ESP32_UNIT_89_BIT_18 (1UL << 18)
#define ESP32_UNIT_89_BIT_19 (1UL << 19)
#define ESP32_UNIT_89_BIT_20 (1UL << 20)
#define ESP32_UNIT_89_BIT_21 (1UL << 21)
#define ESP32_UNIT_89_BIT_22 (1UL << 22)
#define ESP32_UNIT_89_BIT_23 (1UL << 23)
#define ESP32_UNIT_89_BIT_24 (1UL << 24)
#define ESP32_UNIT_89_BIT_25 (1UL << 25)
#define ESP32_UNIT_89_BIT_26 (1UL << 26)
#define ESP32_UNIT_89_BIT_27 (1UL << 27)
#define ESP32_UNIT_89_BIT_28 (1UL << 28)
#define ESP32_UNIT_89_BIT_29 (1UL << 29)
#define ESP32_UNIT_89_BIT_30 (1UL << 30)
#define ESP32_UNIT_89_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_90_TypeDef;
#define ESP32_UNIT_90 ((ESP32_UNIT_90_TypeDef *)(0x3FF40000UL + 90 * 0x400UL))

#define ESP32_UNIT_90_BIT_0 (1UL << 0)
#define ESP32_UNIT_90_BIT_1 (1UL << 1)
#define ESP32_UNIT_90_BIT_2 (1UL << 2)
#define ESP32_UNIT_90_BIT_3 (1UL << 3)
#define ESP32_UNIT_90_BIT_4 (1UL << 4)
#define ESP32_UNIT_90_BIT_5 (1UL << 5)
#define ESP32_UNIT_90_BIT_6 (1UL << 6)
#define ESP32_UNIT_90_BIT_7 (1UL << 7)
#define ESP32_UNIT_90_BIT_8 (1UL << 8)
#define ESP32_UNIT_90_BIT_9 (1UL << 9)
#define ESP32_UNIT_90_BIT_10 (1UL << 10)
#define ESP32_UNIT_90_BIT_11 (1UL << 11)
#define ESP32_UNIT_90_BIT_12 (1UL << 12)
#define ESP32_UNIT_90_BIT_13 (1UL << 13)
#define ESP32_UNIT_90_BIT_14 (1UL << 14)
#define ESP32_UNIT_90_BIT_15 (1UL << 15)
#define ESP32_UNIT_90_BIT_16 (1UL << 16)
#define ESP32_UNIT_90_BIT_17 (1UL << 17)
#define ESP32_UNIT_90_BIT_18 (1UL << 18)
#define ESP32_UNIT_90_BIT_19 (1UL << 19)
#define ESP32_UNIT_90_BIT_20 (1UL << 20)
#define ESP32_UNIT_90_BIT_21 (1UL << 21)
#define ESP32_UNIT_90_BIT_22 (1UL << 22)
#define ESP32_UNIT_90_BIT_23 (1UL << 23)
#define ESP32_UNIT_90_BIT_24 (1UL << 24)
#define ESP32_UNIT_90_BIT_25 (1UL << 25)
#define ESP32_UNIT_90_BIT_26 (1UL << 26)
#define ESP32_UNIT_90_BIT_27 (1UL << 27)
#define ESP32_UNIT_90_BIT_28 (1UL << 28)
#define ESP32_UNIT_90_BIT_29 (1UL << 29)
#define ESP32_UNIT_90_BIT_30 (1UL << 30)
#define ESP32_UNIT_90_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_91_TypeDef;
#define ESP32_UNIT_91 ((ESP32_UNIT_91_TypeDef *)(0x3FF40000UL + 91 * 0x400UL))

#define ESP32_UNIT_91_BIT_0 (1UL << 0)
#define ESP32_UNIT_91_BIT_1 (1UL << 1)
#define ESP32_UNIT_91_BIT_2 (1UL << 2)
#define ESP32_UNIT_91_BIT_3 (1UL << 3)
#define ESP32_UNIT_91_BIT_4 (1UL << 4)
#define ESP32_UNIT_91_BIT_5 (1UL << 5)
#define ESP32_UNIT_91_BIT_6 (1UL << 6)
#define ESP32_UNIT_91_BIT_7 (1UL << 7)
#define ESP32_UNIT_91_BIT_8 (1UL << 8)
#define ESP32_UNIT_91_BIT_9 (1UL << 9)
#define ESP32_UNIT_91_BIT_10 (1UL << 10)
#define ESP32_UNIT_91_BIT_11 (1UL << 11)
#define ESP32_UNIT_91_BIT_12 (1UL << 12)
#define ESP32_UNIT_91_BIT_13 (1UL << 13)
#define ESP32_UNIT_91_BIT_14 (1UL << 14)
#define ESP32_UNIT_91_BIT_15 (1UL << 15)
#define ESP32_UNIT_91_BIT_16 (1UL << 16)
#define ESP32_UNIT_91_BIT_17 (1UL << 17)
#define ESP32_UNIT_91_BIT_18 (1UL << 18)
#define ESP32_UNIT_91_BIT_19 (1UL << 19)
#define ESP32_UNIT_91_BIT_20 (1UL << 20)
#define ESP32_UNIT_91_BIT_21 (1UL << 21)
#define ESP32_UNIT_91_BIT_22 (1UL << 22)
#define ESP32_UNIT_91_BIT_23 (1UL << 23)
#define ESP32_UNIT_91_BIT_24 (1UL << 24)
#define ESP32_UNIT_91_BIT_25 (1UL << 25)
#define ESP32_UNIT_91_BIT_26 (1UL << 26)
#define ESP32_UNIT_91_BIT_27 (1UL << 27)
#define ESP32_UNIT_91_BIT_28 (1UL << 28)
#define ESP32_UNIT_91_BIT_29 (1UL << 29)
#define ESP32_UNIT_91_BIT_30 (1UL << 30)
#define ESP32_UNIT_91_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_92_TypeDef;
#define ESP32_UNIT_92 ((ESP32_UNIT_92_TypeDef *)(0x3FF40000UL + 92 * 0x400UL))

#define ESP32_UNIT_92_BIT_0 (1UL << 0)
#define ESP32_UNIT_92_BIT_1 (1UL << 1)
#define ESP32_UNIT_92_BIT_2 (1UL << 2)
#define ESP32_UNIT_92_BIT_3 (1UL << 3)
#define ESP32_UNIT_92_BIT_4 (1UL << 4)
#define ESP32_UNIT_92_BIT_5 (1UL << 5)
#define ESP32_UNIT_92_BIT_6 (1UL << 6)
#define ESP32_UNIT_92_BIT_7 (1UL << 7)
#define ESP32_UNIT_92_BIT_8 (1UL << 8)
#define ESP32_UNIT_92_BIT_9 (1UL << 9)
#define ESP32_UNIT_92_BIT_10 (1UL << 10)
#define ESP32_UNIT_92_BIT_11 (1UL << 11)
#define ESP32_UNIT_92_BIT_12 (1UL << 12)
#define ESP32_UNIT_92_BIT_13 (1UL << 13)
#define ESP32_UNIT_92_BIT_14 (1UL << 14)
#define ESP32_UNIT_92_BIT_15 (1UL << 15)
#define ESP32_UNIT_92_BIT_16 (1UL << 16)
#define ESP32_UNIT_92_BIT_17 (1UL << 17)
#define ESP32_UNIT_92_BIT_18 (1UL << 18)
#define ESP32_UNIT_92_BIT_19 (1UL << 19)
#define ESP32_UNIT_92_BIT_20 (1UL << 20)
#define ESP32_UNIT_92_BIT_21 (1UL << 21)
#define ESP32_UNIT_92_BIT_22 (1UL << 22)
#define ESP32_UNIT_92_BIT_23 (1UL << 23)
#define ESP32_UNIT_92_BIT_24 (1UL << 24)
#define ESP32_UNIT_92_BIT_25 (1UL << 25)
#define ESP32_UNIT_92_BIT_26 (1UL << 26)
#define ESP32_UNIT_92_BIT_27 (1UL << 27)
#define ESP32_UNIT_92_BIT_28 (1UL << 28)
#define ESP32_UNIT_92_BIT_29 (1UL << 29)
#define ESP32_UNIT_92_BIT_30 (1UL << 30)
#define ESP32_UNIT_92_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_93_TypeDef;
#define ESP32_UNIT_93 ((ESP32_UNIT_93_TypeDef *)(0x3FF40000UL + 93 * 0x400UL))

