RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_93_BIT_0 (1UL << 0)
#define ESP32_UNIT_93_BIT_1 (1UL << 1)
#define ESP32_UNIT_93_BIT_2 (1UL << 2)
#define ESP32_UNIT_93_BIT_3 (1UL << 3)
#define ESP32_UNIT_93_BIT_4 (1UL << 4)
#define ESP32_UNIT_93_BIT_5 (1UL << 5)
#define ESP32_UNIT_93_BIT_6 (1UL << 6)
#define ESP32_UNIT_93_BIT_7 (1UL << 7)
#define ESP32_UNIT_93_BIT_8 (1UL << 8)
#define ESP32_UNIT_93_BIT_9 (1UL << 9)
#define ESP32_UNIT_93_BIT_10 (1UL << 10)
#define ESP32_UNIT_93_BIT_11 (1UL << 11)
#define ESP32_UNIT_93_BIT_12 (1UL << 12)
#define ESP32_UNIT_93_BIT_13 (1UL << 13)
#define ESP32_UNIT_93_BIT_14 (1UL << 14)
#define ESP32_UNIT_93_BIT_15 (1UL << 15)
#define ESP32_UNIT_93_BIT_16 (1UL << 16)
#define ESP32_UNIT_93_BIT_17 (1UL << 17)
#define ESP32_UNIT_93_BIT_18 (1UL << 18)
#define ESP32_UNIT_93_BIT_19 (1UL << 19)
#define ESP32_UNIT_93_BIT_20 (1UL << 20)
#define ESP32_UNIT_93_BIT_21 (1UL << 21)
#define ESP32_UNIT_93_BIT_22 (1UL << 22)
#define ESP32_UNIT_93_BIT_23 (1UL << 23)
#define ESP32_UNIT_93_BIT_24 (1UL << 24)
#define ESP32_UNIT_93_BIT_25 (1UL << 25)
#define ESP32_UNIT_93_BIT_26 (1UL << 26)
#define ESP32_UNIT_93_BIT_27 (1UL << 27)
#define ESP32_UNIT_93_BIT_28 (1UL << 28)
#define ESP32_UNIT_93_BIT_29 (1UL << 29)
#define ESP32_UNIT_93_BIT_30 (1UL << 30)
#define ESP32_UNIT_93_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_94_TypeDef;
#define ESP32_UNIT_94 ((ESP32_UNIT_94_TypeDef *)(0x3FF40000UL + 94 * 0x400UL))

#define ESP32_UNIT_94_BIT_0 (1UL << 0)
#define ESP32_UNIT_94_BIT_1 (1UL << 1)
#define ESP32_UNIT_94_BIT_2 (1UL << 2)
#define ESP32_UNIT_94_BIT_3 (1UL << 3)
#define ESP32_UNIT_94_BIT_4 (1UL << 4)
#define ESP32_UNIT_94_BIT_5 (1UL << 5)
#define ESP32_UNIT_94_BIT_6 (1UL << 6)
#define ESP32_UNIT_94_BIT_7 (1UL << 7)
#define ESP32_UNIT_94_BIT_8 (1UL << 8)
#define ESP32_UNIT_94_BIT_9 (1UL << 9)
#define ESP32_UNIT_94_BIT_10 (1UL << 10)
#define ESP32_UNIT_94_BIT_11 (1UL << 11)
#define ESP32_UNIT_94_BIT_12 (1UL << 12)
#define ESP32_UNIT_94_BIT_13 (1UL << 13)
#define ESP32_UNIT_94_BIT_14 (1UL << 14)
#define ESP32_UNIT_94_BIT_15 (1UL << 15)
#define ESP32_UNIT_94_BIT_16 (1UL << 16)
#define ESP32_UNIT_94_BIT_17 (1UL << 17)
#define ESP32_UNIT_94_BIT_18 (1UL << 18)
#define ESP32_UNIT_94_BIT_19 (1UL << 19)
#define ESP32_UNIT_94_BIT_20 (1UL << 20)
#define ESP32_UNIT_94_BIT_21 (1UL << 21)
#define ESP32_UNIT_94_BIT_22 (1UL << 22)
#define ESP32_UNIT_94_BIT_23 (1UL << 23)
#define ESP32_UNIT_94_BIT_24 (1UL << 24)
#define ESP32_UNIT_94_BIT_25 (1UL << 25)
#define ESP32_UNIT_94_BIT_26 (1UL << 26)
#define ESP32_UNIT_94_BIT_27 (1UL << 27)
#define ESP32_UNIT_94_BIT_28 (1UL << 28)
#define ESP32_UNIT_94_BIT_29 (1UL << 29)
#define ESP32_UNIT_94_BIT_30 (1UL << 30)
#define ESP32_UNIT_94_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_95_TypeDef;
#define ESP32_UNIT_95 ((ESP32_UNIT_95_TypeDef *)(0x3FF40000UL + 95 * 0x400UL))

#define ESP32_UNIT_95_BIT_0 (1UL << 0)
#define ESP32_UNIT_95_BIT_1 (1UL << 1)
#define ESP32_UNIT_95_BIT_2 (1UL << 2)
#define ESP32_UNIT_95_BIT_3 (1UL << 3)
#define ESP32_UNIT_95_BIT_4 (1UL << 4)
#define ESP32_UNIT_95_BIT_5 (1UL << 5)
#define ESP32_UNIT_95_BIT_6 (1UL << 6)
#define ESP32_UNIT_95_BIT_7 (1UL << 7)
#define ESP32_UNIT_95_BIT_8 (1UL << 8)
#define ESP32_UNIT_95_BIT_9 (1UL << 9)
#define ESP32_UNIT_95_BIT_10 (1UL << 10)
#define ESP32_UNIT_95_BIT_11 (1UL << 11)
#define ESP32_UNIT_95_BIT_12 (1UL << 12)
#define ESP32_UNIT_95_BIT_13 (1UL << 13)
#define ESP32_UNIT_95_BIT_14 (1UL << 14)
#define ESP32_UNIT_95_BIT_15 (1UL << 15)
#define ESP32_UNIT_95_BIT_16 (1UL << 16)
#define ESP32_UNIT_95_BIT_17 (1UL << 17)
#define ESP32_UNIT_95_BIT_18 (1UL << 18)
#define ESP32_UNIT_95_BIT_19 (1UL << 19)
#define ESP32_UNIT_95_BIT_20 (1UL << 20)
#define ESP32_UNIT_95_BIT_21 (1UL << 21)
#define ESP32_UNIT_95_BIT_22 (1UL << 22)
#define ESP32_UNIT_95_BIT_23 (1UL << 23)
#define ESP32_UNIT_95_BIT_24 (1UL << 24)
#define ESP32_UNIT_95_BIT_25 (1UL << 25)
#define ESP32_UNIT_95_BIT_26 (1UL << 26)
#define ESP32_UNIT_95_BIT_27 (1UL << 27)
#define ESP32_UNIT_95_BIT_28 (1UL << 28)
#define ESP32_UNIT_95_BIT_29 (1UL << 29)
#define ESP32_UNIT_95_BIT_30 (1UL << 30)
#define ESP32_UNIT_95_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_96_TypeDef;
#define ESP32_UNIT_96 ((ESP32_UNIT_96_TypeDef *)(0x3FF40000UL + 96 * 0x400UL))

#define ESP32_UNIT_96_BIT_0 (1UL << 0)
#define ESP32_UNIT_96_BIT_1 (1UL << 1)
#define ESP32_UNIT_96_BIT_2 (1UL << 2)
#define ESP32_UNIT_96_BIT_3 (1UL << 3)
#define ESP32_UNIT_96_BIT_4 (1UL << 4)
#define ESP32_UNIT_96_BIT_5 (1UL << 5)
#define ESP32_UNIT_96_BIT_6 (1UL << 6)
#define ESP32_UNIT_96_BIT_7 (1UL << 7)
#define ESP32_UNIT_96_BIT_8 (1UL << 8)
#define ESP32_UNIT_96_BIT_9 (1UL << 9)
#define ESP32_UNIT_96_BIT_10 (1UL << 10)
#define ESP32_UNIT_96_BIT_11 (1UL << 11)
#define ESP32_UNIT_96_BIT_12 (1UL << 12)
#define ESP32_UNIT_96_BIT_13 (1UL << 13)
#define ESP32_UNIT_96_BIT_14 (1UL << 14)
#define ESP32_UNIT_96_BIT_15 (1UL << 15)
#define ESP32_UNIT_96_BIT_16 (1UL << 16)
#define ESP32_UNIT_96_BIT_17 (1UL << 17)
#define ESP32_UNIT_96_BIT_18 (1UL << 18)
#define ESP32_UNIT_96_BIT_19 (1UL << 19)
#define ESP32_UNIT_96_BIT_20 (1UL << 20)
#define ESP32_UNIT_96_BIT_21 (1UL << 21)
#define ESP32_UNIT_96_BIT_22 (1UL << 22)
#define ESP32_UNIT_96_BIT_23 (1UL << 23)
#define ESP32_UNIT_96_BIT_24 (1UL << 24)
#define ESP32_UNIT_96_BIT_25 (1UL << 25)
#define ESP32_UNIT_96_BIT_26 (1UL << 26)
#define ESP32_UNIT_96_BIT_27 (1UL << 27)
#define ESP32_UNIT_96_BIT_28 (1UL << 28)
#define ESP32_UNIT_96_BIT_29 (1UL << 29)
#define ESP32_UNIT_96_BIT_30 (1UL << 30)
#define ESP32_UNIT_96_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_97_TypeDef;
#define ESP32_UNIT_97 ((ESP32_UNIT_97_TypeDef *)(0x3FF40000UL + 97 * 0x400UL))

#define ESP32_UNIT_97_BIT_0 (1UL << 0)
#define ESP32_UNIT_97_BIT_1 (1UL << 1)
#define ESP32_UNIT_97_BIT_2 (1UL << 2)
#define ESP32_UNIT_97_BIT_3 (1UL << 3)
#define ESP32_UNIT_97_BIT_4 (1UL << 4)
#define ESP32_UNIT_97_BIT_5 (1UL << 5)
#define ESP32_UNIT_97_BIT_6 (1UL << 6)
#define ESP32_UNIT_97_BIT_7 (1UL << 7)
#define ESP32_UNIT_97_BIT_8 (1UL << 8)
#define ESP32_UNIT_97_BIT_9 (1UL << 9)
#define ESP32_UNIT_97_BIT_10 (1UL << 10)
#define ESP32_UNIT_97_BIT_11 (1UL << 11)
#define ESP32_UNIT_97_BIT_12 (1UL << 12)
#define ESP32_UNIT_97_BIT_13 (1UL << 13)
#define ESP32_UNIT_97_BIT_14 (1UL << 14)
#define ESP32_UNIT_97_BIT_15 (1UL << 15)
#define ESP32_UNIT_97_BIT_16 (1UL << 16)
#define ESP32_UNIT_97_BIT_17 (1UL << 17)
#define ESP32_UNIT_97_BIT_18 (1UL << 18)
#define ESP32_UNIT_97_BIT_19 (1UL << 19)
#define ESP32_UNIT_97_BIT_20 (1UL << 20)
#define ESP32_UNIT_97_BIT_21 (1UL << 21)
#define ESP32_UNIT_97_BIT_22 (1UL << 22)
#define ESP32_UNIT_97_BIT_23 (1UL << 23)
#define ESP32_UNIT_97_BIT_24 (1UL << 24)
#define ESP32_UNIT_97_BIT_25 (1UL << 25)
#define ESP32_UNIT_97_BIT_26 (1UL << 26)
#define ESP32_UNIT_97_BIT_27 (1UL << 27)
#define ESP32_UNIT_97_BIT_28 (1UL << 28)
#define ESP32_UNIT_97_BIT_29 (1UL << 29)
#define ESP32_UNIT_97_BIT_30 (1UL << 30)
#define ESP32_UNIT_97_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_98_TypeDef;
#define ESP32_UNIT_98 ((ESP32_UNIT_98_TypeDef *)(0x3FF40000UL + 98 * 0x400UL))

#define ESP32_UNIT_98_BIT_0 (1UL << 0)
#define ESP32_UNIT_98_BIT_1 (1UL << 1)
#define ESP32_UNIT_98_BIT_2 (1UL << 2)
#define ESP32_UNIT_98_BIT_3 (1UL << 3)
#define ESP32_UNIT_98_BIT_4 (1UL << 4)
#define ESP32_UNIT_98_BIT_5 (1UL << 5)
#define ESP32_UNIT_98_BIT_6 (1UL << 6)
#define ESP32_UNIT_98_BIT_7 (1UL << 7)
#define ESP32_UNIT_98_BIT_8 (1UL << 8)
#define ESP32_UNIT_98_BIT_9 (1UL << 9)
#define ESP32_UNIT_98_BIT_10 (1UL << 10)
#define ESP32_UNIT_98_BIT_11 (1UL << 11)
#define ESP32_UNIT_98_BIT_12 (1UL << 12)
#define ESP32_UNIT_98_BIT_13 (1UL << 13)
#define ESP32_UNIT_98_BIT_14 (1UL << 14)
#define ESP32_UNIT_98_BIT_15 (1UL << 15)
#define ESP32_UNIT_98_BIT_16 (1UL << 16)
#define ESP32_UNIT_98_BIT_17 (1UL << 17)
#define ESP32_UNIT_98_BIT_18 (1UL << 18)
#define ESP32_UNIT_98_BIT_19 (1UL << 19)
#define ESP32_UNIT_98_BIT_20 (1UL << 20)
#define ESP32_UNIT_98_BIT_21 (1UL << 21)
#define ESP32_UNIT_98_BIT_22 (1UL << 22)
#define ESP32_UNIT_98_BIT_23 (1UL << 23)
#define ESP32_UNIT_98_BIT_24 (1UL << 24)
#define ESP32_UNIT_98_BIT_25 (1UL << 25)
#define ESP32_UNIT_98_BIT_26 (1UL << 26)
#define ESP32_UNIT_98_BIT_27 (1UL << 27)
#define ESP32_UNIT_98_BIT_28 (1UL << 28)
#define ESP32_UNIT_98_BIT_29 (1UL << 29)
#define ESP32_UNIT_98_BIT_30 (1UL << 30)
#define ESP32_UNIT_98_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_99_TypeDef;
#define ESP32_UNIT_99 ((ESP32_UNIT_99_TypeDef *)(0x3FF40000UL + 99 * 0x400UL))

#define ESP32_UNIT_99_BIT_0 (1UL << 0)
#define ESP32_UNIT_99_BIT_1 (1UL << 1)
#define ESP32_UNIT_99_BIT_2 (1UL << 2)
#define ESP32_UNIT_99_BIT_3 (1UL << 3)
#define ESP32_UNIT_99_BIT_4 (1UL << 4)
#define ESP32_UNIT_99_BIT_5 (1UL << 5)
#define ESP32_UNIT_99_BIT_6 (1UL << 6)
#define ESP32_UNIT_99_BIT_7 (1UL << 7)
#define ESP32_UNIT_99_BIT_8 (1UL << 8)
#define ESP32_UNIT_99_BIT_9 (1UL << 9)
#define ESP32_UNIT_99_BIT_10 (1UL << 10)
#define ESP32_UNIT_99_BIT_11 (1UL << 11)
#define ESP32_UNIT_99_BIT_12 (1UL << 12)
#define ESP32_UNIT_99_BIT_13 (1UL << 13)
#define ESP32_UNIT_99_BIT_14 (1UL << 14)
#define ESP32_UNIT_99_BIT_15 (1UL << 15)
#define ESP32_UNIT_99_BIT_16 (1UL << 16)
#define ESP32_UNIT_99_BIT_17 (1UL << 17)
#define ESP32_UNIT_99_BIT_18 (1UL << 18)
#define ESP32_UNIT_99_BIT_19 (1UL << 19)
#define ESP32_UNIT_99_BIT_20 (1UL << 20)
#define ESP32_UNIT_99_BIT_21 (1UL << 21)
#define ESP32_UNIT_99_BIT_22 (1UL << 22)
#define ESP32_UNIT_99_BIT_23 (1UL << 23)
#define ESP32_UNIT_99_BIT_24 (1UL << 24)
#define ESP32_UNIT_99_BIT_25 (1UL << 25)
#define ESP32_UNIT_99_BIT_26 (1UL << 26)
#define ESP32_UNIT_99_BIT_27 (1UL << 27)
#define ESP32_UNIT_99_BIT_28 (1UL << 28)
#define ESP32_UNIT_99_BIT_29 (1UL << 29)
#define ESP32_UNIT_99_BIT_30 (1UL << 30)
#define ESP32_UNIT_99_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_100_TypeDef;
#define ESP32_UNIT_100 ((ESP32_UNIT_100_TypeDef *)(0x3FF40000UL + 100 * 0x400UL))

#define ESP32_UNIT_100_BIT_0 (1UL << 0)
#define ESP32_UNIT_100_BIT_1 (1UL << 1)
#define ESP32_UNIT_100_BIT_2 (1UL << 2)
#define ESP32_UNIT_100_BIT_3 (1UL << 3)
#define ESP32_UNIT_100_BIT_4 (1UL << 4)
#define ESP32_UNIT_100_BIT_5 (1UL << 5)
#define ESP32_UNIT_100_BIT_6 (1UL << 6)
#define ESP32_UNIT_100_BIT_7 (1UL << 7)
#define ESP32_UNIT_100_BIT_8 (1UL << 8)
#define ESP32_UNIT_100_BIT_9 (1UL << 9)
#define ESP32_UNIT_100_BIT_10 (1UL << 10)
#define ESP32_UNIT_100_BIT_11 (1UL << 11)
#define ESP32_UNIT_100_BIT_12 (1UL << 12)
#define ESP32_UNIT_100_BIT_13 (1UL << 13)
#define ESP32_UNIT_100_BIT_14 (1UL << 14)
#define ESP32_UNIT_100_BIT_15 (1UL << 15)
#define ESP32_UNIT_100_BIT_16 (1UL << 16)
#define ESP32_UNIT_100_BIT_17 (1UL << 17)
#define ESP32_UNIT_100_BIT_18 (1UL << 18)
#define ESP32_UNIT_100_BIT_19 (1UL << 19)
#define ESP32_UNIT_100_BIT_20 (1UL << 20)
#define ESP32_UNIT_100_BIT_21 (1UL << 21)
#define ESP32_UNIT_100_BIT_22 (1UL << 22)
#define ESP32_UNIT_100_BIT_23 (1UL << 23)
#define ESP32_UNIT_100_BIT_24 (1UL << 24)
#define ESP32_UNIT_100_BIT_25 (1UL << 25)
#define ESP32_UNIT_100_BIT_26 (1UL << 26)
#define ESP32_UNIT_100_BIT_27 (1UL << 27)
#define ESP32_UNIT_100_BIT_28 (1UL << 28)
#define ESP32_UNIT_100_BIT_29 (1UL << 29)
#define ESP32_UNIT_100_BIT_30 (1UL << 30)
#define ESP32_UNIT_100_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_101_TypeDef;
#define ESP32_UNIT_101 ((ESP32_UNIT_101_TypeDef *)(0x3FF40000UL + 101 * 0x400UL))

