RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_101_BIT_0 (1UL << 0)
#define ESP32_UNIT_101_BIT_1 (1UL << 1)
#define ESP32_UNIT_101_BIT_2 (1UL << 2)
#define ESP32_UNIT_101_BIT_3 (1UL << 3)
#define ESP32_UNIT_101_BIT_4 (1UL << 4)
#define ESP32_UNIT_101_BIT_5 (1UL << 5)
#define ESP32_UNIT_101_BIT_6 (1UL << 6)
#define ESP32_UNIT_101_BIT_7 (1UL << 7)
#define ESP32_UNIT_101_BIT_8 (1UL << 8)
#define ESP32_UNIT_101_BIT_9 (1UL << 9)
#define ESP32_UNIT_101_BIT_10 (1UL << 10)
#define ESP32_UNIT_101_BIT_11 (1UL << 11)
#define ESP32_UNIT_101_BIT_12 (1UL << 12)
#define ESP32_UNIT_101_BIT_13 (1UL << 13)
#define ESP32_UNIT_101_BIT_14 (1UL << 14)
#define ESP32_UNIT_101_BIT_15 (1UL << 15)
#define ESP32_UNIT_101_BIT_16 (1UL << 16)
#define ESP32_UNIT_101_BIT_17 (1UL << 17)
#define ESP32_UNIT_101_BIT_18 (1UL << 18)
#define ESP32_UNIT_101_BIT_19 (1UL << 19)
#define ESP32_UNIT_101_BIT_20 (1UL << 20)
#define ESP32_UNIT_101_BIT_21 (1UL << 21)
#define ESP32_UNIT_101_BIT_22 (1UL << 22)
#define ESP32_UNIT_101_BIT_23 (1UL << 23)
#define ESP32_UNIT_101_BIT_24 (1UL << 24)
#define ESP32_UNIT_101_BIT_25 (1UL << 25)
#define ESP32_UNIT_101_BIT_26 (1UL << 26)
#define ESP32_UNIT_101_BIT_27 (1UL << 27)
#define ESP32_UNIT_101_BIT_28 (1UL << 28)
#define ESP32_UNIT_101_BIT_29 (1UL << 29)
#define ESP32_UNIT_101_BIT_30 (1UL << 30)
#define ESP32_UNIT_101_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_102_TypeDef;
#define ESP32_UNIT_102 ((ESP32_UNIT_102_TypeDef *)(0x3FF40000UL + 102 * 0x400UL))

#define ESP32_UNIT_102_BIT_0 (1UL << 0)
#define ESP32_UNIT_102_BIT_1 (1UL << 1)
#define ESP32_UNIT_102_BIT_2 (1UL << 2)
#define ESP32_UNIT_102_BIT_3 (1UL << 3)
#define ESP32_UNIT_102_BIT_4 (1UL << 4)
#define ESP32_UNIT_102_BIT_5 (1UL << 5)
#define ESP32_UNIT_102_BIT_6 (1UL << 6)
#define ESP32_UNIT_102_BIT_7 (1UL << 7)
#define ESP32_UNIT_102_BIT_8 (1UL << 8)
#define ESP32_UNIT_102_BIT_9 (1UL << 9)
#define ESP32_UNIT_102_BIT_10 (1UL << 10)
#define ESP32_UNIT_102_BIT_11 (1UL << 11)
#define ESP32_UNIT_102_BIT_12 (1UL << 12)
#define ESP32_UNIT_102_BIT_13 (1UL << 13)
#define ESP32_UNIT_102_BIT_14 (1UL << 14)
#define ESP32_UNIT_102_BIT_15 (1UL << 15)
#define ESP32_UNIT_102_BIT_16 (1UL << 16)
#define ESP32_UNIT_102_BIT_17 (1UL << 17)
#define ESP32_UNIT_102_BIT_18 (1UL << 18)
#define ESP32_UNIT_102_BIT_19 (1UL << 19)
#define ESP32_UNIT_102_BIT_20 (1UL << 20)
#define ESP32_UNIT_102_BIT_21 (1UL << 21)
#define ESP32_UNIT_102_BIT_22 (1UL << 22)
#define ESP32_UNIT_102_BIT_23 (1UL << 23)
#define ESP32_UNIT_102_BIT_24 (1UL << 24)
#define ESP32_UNIT_102_BIT_25 (1UL << 25)
#define ESP32_UNIT_102_BIT_26 (1UL << 26)
#define ESP32_UNIT_102_BIT_27 (1UL << 27)
#define ESP32_UNIT_102_BIT_28 (1UL << 28)
#define ESP32_UNIT_102_BIT_29 (1UL << 29)
#define ESP32_UNIT_102_BIT_30 (1UL << 30)
#define ESP32_UNIT_102_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_103_TypeDef;
#define ESP32_UNIT_103 ((ESP32_UNIT_103_TypeDef *)(0x3FF40000UL + 103 * 0x400UL))

#define ESP32_UNIT_103_BIT_0 (1UL << 0)
#define ESP32_UNIT_103_BIT_1 (1UL << 1)
#define ESP32_UNIT_103_BIT_2 (1UL << 2)
#define ESP32_UNIT_103_BIT_3 (1UL << 3)
#define ESP32_UNIT_103_BIT_4 (1UL << 4)
#define ESP32_UNIT_103_BIT_5 (1UL << 5)
#define ESP32_UNIT_103_BIT_6 (1UL << 6)
#define ESP32_UNIT_103_BIT_7 (1UL << 7)
#define ESP32_UNIT_103_BIT_8 (1UL << 8)
#define ESP32_UNIT_103_BIT_9 (1UL << 9)
#define ESP32_UNIT_103_BIT_10 (1UL << 10)
#define ESP32_UNIT_103_BIT_11 (1UL << 11)
#define ESP32_UNIT_103_BIT_12 (1UL << 12)
#define ESP32_UNIT_103_BIT_13 (1UL << 13)
#define ESP32_UNIT_103_BIT_14 (1UL << 14)
#define ESP32_UNIT_103_BIT_15 (1UL << 15)
#define ESP32_UNIT_103_BIT_16 (1UL << 16)
#define ESP32_UNIT_103_BIT_17 (1UL << 17)
#define ESP32_UNIT_103_BIT_18 (1UL << 18)
#define ESP32_UNIT_103_BIT_19 (1UL << 19)
#define ESP32_UNIT_103_BIT_20 (1UL << 20)
#define ESP32_UNIT_103_BIT_21 (1UL << 21)
#define ESP32_UNIT_103_BIT_22 (1UL << 22)
#define ESP32_UNIT_103_BIT_23 (1UL << 23)
#define ESP32_UNIT_103_BIT_24 (1UL << 24)
#define ESP32_UNIT_103_BIT_25 (1UL << 25)
#define ESP32_UNIT_103_BIT_26 (1UL << 26)
#define ESP32_UNIT_103_BIT_27 (1UL << 27)
#define ESP32_UNIT_103_BIT_28 (1UL << 28)
#define ESP32_UNIT_103_BIT_29 (1UL << 29)
#define ESP32_UNIT_103_BIT_30 (1UL << 30)
#define ESP32_UNIT_103_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_104_TypeDef;
#define ESP32_UNIT_104 ((ESP32_UNIT_104_TypeDef *)(0x3FF40000UL + 104 * 0x400UL))

#define ESP32_UNIT_104_BIT_0 (1UL << 0)
#define ESP32_UNIT_104_BIT_1 (1UL << 1)
#define ESP32_UNIT_104_BIT_2 (1UL << 2)
#define ESP32_UNIT_104_BIT_3 (1UL << 3)
#define ESP32_UNIT_104_BIT_4 (1UL << 4)
#define ESP32_UNIT_104_BIT_5 (1UL << 5)
#define ESP32_UNIT_104_BIT_6 (1UL << 6)
#define ESP32_UNIT_104_BIT_7 (1UL << 7)
#define ESP32_UNIT_104_BIT_8 (1UL << 8)
#define ESP32_UNIT_104_BIT_9 (1UL << 9)
#define ESP32_UNIT_104_BIT_10 (1UL << 10)
#define ESP32_UNIT_104_BIT_11 (1UL << 11)
#define ESP32_UNIT_104_BIT_12 (1UL << 12)
#define ESP32_UNIT_104_BIT_13 (1UL << 13)
#define ESP32_UNIT_104_BIT_14 (1UL << 14)
#define ESP32_UNIT_104_BIT_15 (1UL << 15)
#define ESP32_UNIT_104_BIT_16 (1UL << 16)
#define ESP32_UNIT_104_BIT_17 (1UL << 17)
#define ESP32_UNIT_104_BIT_18 (1UL << 18)
#define ESP32_UNIT_104_BIT_19 (1UL << 19)
#define ESP32_UNIT_104_BIT_20 (1UL << 20)
#define ESP32_UNIT_104_BIT_21 (1UL << 21)
#define ESP32_UNIT_104_BIT_22 (1UL << 22)
#define ESP32_UNIT_104_BIT_23 (1UL << 23)
#define ESP32_UNIT_104_BIT_24 (1UL << 24)
#define ESP32_UNIT_104_BIT_25 (1UL << 25)
#define ESP32_UNIT_104_BIT_26 (1UL << 26)
#define ESP32_UNIT_104_BIT_27 (1UL << 27)
#define ESP32_UNIT_104_BIT_28 (1UL << 28)
#define ESP32_UNIT_104_BIT_29 (1UL << 29)
#define ESP32_UNIT_104_BIT_30 (1UL << 30)
#define ESP32_UNIT_104_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_105_TypeDef;
#define ESP32_UNIT_105 ((ESP32_UNIT_105_TypeDef *)(0x3FF40000UL + 105 * 0x400UL))

#define ESP32_UNIT_105_BIT_0 (1UL << 0)
#define ESP32_UNIT_105_BIT_1 (1UL << 1)
#define ESP32_UNIT_105_BIT_2 (1UL << 2)
#define ESP32_UNIT_105_BIT_3 (1UL << 3)
#define ESP32_UNIT_105_BIT_4 (1UL << 4)
#define ESP32_UNIT_105_BIT_5 (1UL << 5)
#define ESP32_UNIT_105_BIT_6 (1UL << 6)
#define ESP32_UNIT_105_BIT_7 (1UL << 7)
#define ESP32_UNIT_105_BIT_8 (1UL << 8)
#define ESP32_UNIT_105_BIT_9 (1UL << 9)
#define ESP32_UNIT_105_BIT_10 (1UL << 10)
#define ESP32_UNIT_105_BIT_11 (1UL << 11)
#define ESP32_UNIT_105_BIT_12 (1UL << 12)
#define ESP32_UNIT_105_BIT_13 (1UL << 13)
#define ESP32_UNIT_105_BIT_14 (1UL << 14)
#define ESP32_UNIT_105_BIT_15 (1UL << 15)
#define ESP32_UNIT_105_BIT_16 (1UL << 16)
#define ESP32_UNIT_105_BIT_17 (1UL << 17)
#define ESP32_UNIT_105_BIT_18 (1UL << 18)
#define ESP32_UNIT_105_BIT_19 (1UL << 19)
#define ESP32_UNIT_105_BIT_20 (1UL << 20)
#define ESP32_UNIT_105_BIT_21 (1UL << 21)
#define ESP32_UNIT_105_BIT_22 (1UL << 22)
#define ESP32_UNIT_105_BIT_23 (1UL << 23)
#define ESP32_UNIT_105_BIT_24 (1UL << 24)
#define ESP32_UNIT_105_BIT_25 (1UL << 25)
#define ESP32_UNIT_105_BIT_26 (1UL << 26)
#define ESP32_UNIT_105_BIT_27 (1UL << 27)
#define ESP32_UNIT_105_BIT_28 (1UL << 28)
#define ESP32_UNIT_105_BIT_29 (1UL << 29)
#define ESP32_UNIT_105_BIT_30 (1UL << 30)
#define ESP32_UNIT_105_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_106_TypeDef;
#define ESP32_UNIT_106 ((ESP32_UNIT_106_TypeDef *)(0x3FF40000UL + 106 * 0x400UL))

