RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_106_BIT_0 (1UL << 0)
#define ESP32_UNIT_106_BIT_1 (1UL << 1)
#define ESP32_UNIT_106_BIT_2 (1UL << 2)
#define ESP32_UNIT_106_BIT_3 (1UL << 3)
#define ESP32_UNIT_106_BIT_4 (1UL << 4)
#define ESP32_UNIT_106_BIT_5 (1UL << 5)
#define ESP32_UNIT_106_BIT_6 (1UL << 6)
#define ESP32_UNIT_106_BIT_7 (1UL << 7)
#define ESP32_UNIT_106_BIT_8 (1UL << 8)
#define ESP32_UNIT_106_BIT_9 (1UL << 9)
#define ESP32_UNIT_106_BIT_10 (1UL << 10)
#define ESP32_UNIT_106_BIT_11 (1UL << 11)
#define ESP32_UNIT_106_BIT_12 (1UL << 12)
#define ESP32_UNIT_106_BIT_13 (1UL << 13)
#define ESP32_UNIT_106_BIT_14 (1UL << 14)
#define ESP32_UNIT_106_BIT_15 (1UL << 15)
#define ESP32_UNIT_106_BIT_16 (1UL << 16)
#define ESP32_UNIT_106_BIT_17 (1UL << 17)
#define ESP32_UNIT_106_BIT_18 (1UL << 18)
#define ESP32_UNIT_106_BIT_19 (1UL << 19)
#define ESP32_UNIT_106_BIT_20 (1UL << 20)
#define ESP32_UNIT_106_BIT_21 (1UL << 21)
#define ESP32_UNIT_106_BIT_22 (1UL << 22)
#define ESP32_UNIT_106_BIT_23 (1UL << 23)
#define ESP32_UNIT_106_BIT_24 (1UL << 24)
#define ESP32_UNIT_106_BIT_25 (1UL << 25)
#define ESP32_UNIT_106_BIT_26 (1UL << 26)
#define ESP32_UNIT_106_BIT_27 (1UL << 27)
#define ESP32_UNIT_106_BIT_28 (1UL << 28)
#define ESP32_UNIT_106_BIT_29 (1UL << 29)
#define ESP32_UNIT_106_BIT_30 (1UL << 30)
#define ESP32_UNIT_106_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_107_TypeDef;
#define ESP32_UNIT_107 ((ESP32_UNIT_107_TypeDef *)(0x3FF40000UL + 107 * 0x400UL))

#define ESP32_UNIT_107_BIT_0 (1UL << 0)
#define ESP32_UNIT_107_BIT_1 (1UL << 1)
#define ESP32_UNIT_107_BIT_2 (1UL << 2)
#define ESP32_UNIT_107_BIT_3 (1UL << 3)
#define ESP32_UNIT_107_BIT_4 (1UL << 4)
#define ESP32_UNIT_107_BIT_5 (1UL << 5)
#define ESP32_UNIT_107_BIT_6 (1UL << 6)
#define ESP32_UNIT_107_BIT_7 (1UL << 7)
#define ESP32_UNIT_107_BIT_8 (1UL << 8)
#define ESP32_UNIT_107_BIT_9 (1UL << 9)
#define ESP32_UNIT_107_BIT_10 (1UL << 10)
#define ESP32_UNIT_107_BIT_11 (1UL << 11)
#define ESP32_UNIT_107_BIT_12 (1UL << 12)
#define ESP32_UNIT_107_BIT_13 (1UL << 13)
#define ESP32_UNIT_107_BIT_14 (1UL << 14)
#define ESP32_UNIT_107_BIT_15 (1UL << 15)
#define ESP32_UNIT_107_BIT_16 (1UL << 16)
#define ESP32_UNIT_107_BIT_17 (1UL << 17)
#define ESP32_UNIT_107_BIT_18 (1UL << 18)
#define ESP32_UNIT_107_BIT_19 (1UL << 19)
#define ESP32_UNIT_107_BIT_20 (1UL << 20)
#define ESP32_UNIT_107_BIT_21 (1UL << 21)
#define ESP32_UNIT_107_BIT_22 (1UL << 22)
#define ESP32_UNIT_107_BIT_23 (1UL << 23)
#define ESP32_UNIT_107_BIT_24 (1UL << 24)
#define ESP32_UNIT_107_BIT_25 (1UL << 25)
#define ESP32_UNIT_107_BIT_26 (1UL << 26)
#define ESP32_UNIT_107_BIT_27 (1UL << 27)
#define ESP32_UNIT_107_BIT_28 (1UL << 28)
#define ESP32_UNIT_107_BIT_29 (1UL << 29)
#define ESP32_UNIT_107_BIT_30 (1UL << 30)
#define ESP32_UNIT_107_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_108_TypeDef;
#define ESP32_UNIT_108 ((ESP32_UNIT_108_TypeDef *)(0x3FF40000UL + 108 * 0x400UL))

#define ESP32_UNIT_108_BIT_0 (1UL << 0)
#define ESP32_UNIT_108_BIT_1 (1UL << 1)
#define ESP32_UNIT_108_BIT_2 (1UL << 2)
#define ESP32_UNIT_108_BIT_3 (1UL << 3)
#define ESP32_UNIT_108_BIT_4 (1UL << 4)
#define ESP32_UNIT_108_BIT_5 (1UL << 5)
#define ESP32_UNIT_108_BIT_6 (1UL << 6)
#define ESP32_UNIT_108_BIT_7 (1UL << 7)
#define ESP32_UNIT_108_BIT_8 (1UL << 8)
#define ESP32_UNIT_108_BIT_9 (1UL << 9)
#define ESP32_UNIT_108_BIT_10 (1UL << 10)
#define ESP32_UNIT_108_BIT_11 (1UL << 11)
#define ESP32_UNIT_108_BIT_12 (1UL << 12)
#define ESP32_UNIT_108_BIT_13 (1UL << 13)
#define ESP32_UNIT_108_BIT_14 (1UL << 14)
#define ESP32_UNIT_108_BIT_15 (1UL << 15)
#define ESP32_UNIT_108_BIT_16 (1UL << 16)
#define ESP32_UNIT_108_BIT_17 (1UL << 17)
#define ESP32_UNIT_108_BIT_18 (1UL << 18)
#define ESP32_UNIT_108_BIT_19 (1UL << 19)
#define ESP32_UNIT_108_BIT_20 (1UL << 20)
#define ESP32_UNIT_108_BIT_21 (1UL << 21)
#define ESP32_UNIT_108_BIT_22 (1UL << 22)
#define ESP32_UNIT_108_BIT_23 (1UL << 23)
#define ESP32_UNIT_108_BIT_24 (1UL << 24)
#define ESP32_UNIT_108_BIT_25 (1UL << 25)
#define ESP32_UNIT_108_BIT_26 (1UL << 26)
#define ESP32_UNIT_108_BIT_27 (1UL << 27)
#define ESP32_UNIT_108_BIT_28 (1UL << 28)
#define ESP32_UNIT_108_BIT_29 (1UL << 29)
#define ESP32_UNIT_108_BIT_30 (1UL << 30)
#define ESP32_UNIT_108_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_109_TypeDef;
#define ESP32_UNIT_109 ((ESP32_UNIT_109_TypeDef *)(0x3FF40000UL + 109 * 0x400UL))

#define ESP32_UNIT_109_BIT_0 (1UL << 0)
#define ESP32_UNIT_109_BIT_1 (1UL << 1)
#define ESP32_UNIT_109_BIT_2 (1UL << 2)
#define ESP32_UNIT_109_BIT_3 (1UL << 3)
#define ESP32_UNIT_109_BIT_4 (1UL << 4)
#define ESP32_UNIT_109_BIT_5 (1UL << 5)
#define ESP32_UNIT_109_BIT_6 (1UL << 6)
#define ESP32_UNIT_109_BIT_7 (1UL << 7)
#define ESP32_UNIT_109_BIT_8 (1UL << 8)
#define ESP32_UNIT_109_BIT_9 (1UL << 9)
#define ESP32_UNIT_109_BIT_10 (1UL << 10)
#define ESP32_UNIT_109_BIT_11 (1UL << 11)
#define ESP32_UNIT_109_BIT_12 (1UL << 12)
#define ESP32_UNIT_109_BIT_13 (1UL << 13)
#define ESP32_UNIT_109_BIT_14 (1UL << 14)
#define ESP32_UNIT_109_BIT_15 (1UL << 15)
#define ESP32_UNIT_109_BIT_16 (1UL << 16)
#define ESP32_UNIT_109_BIT_17 (1UL << 17)
#define ESP32_UNIT_109_BIT_18 (1UL << 18)
#define ESP32_UNIT_109_BIT_19 (1UL << 19)
#define ESP32_UNIT_109_BIT_20 (1UL << 20)
#define ESP32_UNIT_109_BIT_21 (1UL << 21)
#define ESP32_UNIT_109_BIT_22 (1UL << 22)
#define ESP32_UNIT_109_BIT_23 (1UL << 23)
#define ESP32_UNIT_109_BIT_24 (1UL << 24)
#define ESP32_UNIT_109_BIT_25 (1UL << 25)
#define ESP32_UNIT_109_BIT_26 (1UL << 26)
#define ESP32_UNIT_109_BIT_27 (1UL << 27)
#define ESP32_UNIT_109_BIT_28 (1UL << 28)
#define ESP32_UNIT_109_BIT_29 (1UL << 29)
#define ESP32_UNIT_109_BIT_30 (1UL << 30)
#define ESP32_UNIT_109_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_110_TypeDef;
#define ESP32_UNIT_110 ((ESP32_UNIT_110_TypeDef *)(0x3FF40000UL + 110 * 0x400UL))

#define ESP32_UNIT_110_BIT_0 (1UL << 0)
#define ESP32_UNIT_110_BIT_1 (1UL << 1)
#define ESP32_UNIT_110_BIT_2 (1UL << 2)
#define ESP32_UNIT_110_BIT_3 (1UL << 3)
#define ESP32_UNIT_110_BIT_4 (1UL << 4)
#define ESP32_UNIT_110_BIT_5 (1UL << 5)
#define ESP32_UNIT_110_BIT_6 (1UL << 6)
#define ESP32_UNIT_110_BIT_7 (1UL << 7)
#define ESP32_UNIT_110_BIT_8 (1UL << 8)
#define ESP32_UNIT_110_BIT_9 (1UL << 9)
#define ESP32_UNIT_110_BIT_10 (1UL << 10)
#define ESP32_UNIT_110_BIT_11 (1UL << 11)
#define ESP32_UNIT_110_BIT_12 (1UL << 12)
#define ESP32_UNIT_110_BIT_13 (1UL << 13)
#define ESP32_UNIT_110_BIT_14 (1UL << 14)
#define ESP32_UNIT_110_BIT_15 (1UL << 15)
#define ESP32_UNIT_110_BIT_16 (1UL << 16)
#define ESP32_UNIT_110_BIT_17 (1UL << 17)
#define ESP32_UNIT_110_BIT_18 (1UL << 18)
#define ESP32_UNIT_110_BIT_19 (1UL << 19)
#define ESP32_UNIT_110_BIT_20 (1UL << 20)
#define ESP32_UNIT_110_BIT_21 (1UL << 21)
#define ESP32_UNIT_110_BIT_22 (1UL << 22)
#define ESP32_UNIT_110_BIT_23 (1UL << 23)
#define ESP32_UNIT_110_BIT_24 (1UL << 24)
#define ESP32_UNIT_110_BIT_25 (1UL << 25)
#define ESP32_UNIT_110_BIT_26 (1UL << 26)
#define ESP32_UNIT_110_BIT_27 (1UL << 27)
#define ESP32_UNIT_110_BIT_28 (1UL << 28)
#define ESP32_UNIT_110_BIT_29 (1UL << 29)
#define ESP32_UNIT_110_BIT_30 (1UL << 30)
#define ESP32_UNIT_110_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_111_TypeDef;
#define ESP32_UNIT_111 ((ESP32_UNIT_111_TypeDef *)(0x3FF40000UL + 111 * 0x400UL))

