RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_111_BIT_0 (1UL << 0)
#define ESP32_UNIT_111_BIT_1 (1UL << 1)
#define ESP32_UNIT_111_BIT_2 (1UL << 2)
#define ESP32_UNIT_111_BIT_3 (1UL << 3)
#define ESP32_UNIT_111_BIT_4 (1UL << 4)
#define ESP32_UNIT_111_BIT_5 (1UL << 5)
#define ESP32_UNIT_111_BIT_6 (1UL << 6)
#define ESP32_UNIT_111_BIT_7 (1UL << 7)
#define ESP32_UNIT_111_BIT_8 (1UL << 8)
#define ESP32_UNIT_111_BIT_9 (1UL << 9)
#define ESP32_UNIT_111_BIT_10 (1UL << 10)
#define ESP32_UNIT_111_BIT_11 (1UL << 11)
#define ESP32_UNIT_111_BIT_12 (1UL << 12)
#define ESP32_UNIT_111_BIT_13 (1UL << 13)
#define ESP32_UNIT_111_BIT_14 (1UL << 14)
#define ESP32_UNIT_111_BIT_15 (1UL << 15)
#define ESP32_UNIT_111_BIT_16 (1UL << 16)
#define ESP32_UNIT_111_BIT_17 (1UL << 17)
#define ESP32_UNIT_111_BIT_18 (1UL << 18)
#define ESP32_UNIT_111_BIT_19 (1UL << 19)
#define ESP32_UNIT_111_BIT_20 (1UL << 20)
#define ESP32_UNIT_111_BIT_21 (1UL << 21)
#define ESP32_UNIT_111_BIT_22 (1UL << 22)
#define ESP32_UNIT_111_BIT_23 (1UL << 23)
#define ESP32_UNIT_111_BIT_24 (1UL << 24)
#define ESP32_UNIT_111_BIT_25 (1UL << 25)
#define ESP32_UNIT_111_BIT_26 (1UL << 26)
#define ESP32_UNIT_111_BIT_27 (1UL << 27)
#define ESP32_UNIT_111_BIT_28 (1UL << 28)
#define ESP32_UNIT_111_BIT_29 (1UL << 29)
#define ESP32_UNIT_111_BIT_30 (1UL << 30)
#define ESP32_UNIT_111_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_112_TypeDef;
#define ESP32_UNIT_112 ((ESP32_UNIT_112_TypeDef *)(0x3FF40000UL + 112 * 0x400UL))

#define ESP32_UNIT_112_BIT_0 (1UL << 0)
#define ESP32_UNIT_112_BIT_1 (1UL << 1)
#define ESP32_UNIT_112_BIT_2 (1UL << 2)
#define ESP32_UNIT_112_BIT_3 (1UL << 3)
#define ESP32_UNIT_112_BIT_4 (1UL << 4)
#define ESP32_UNIT_112_BIT_5 (1UL << 5)
#define ESP32_UNIT_112_BIT_6 (1UL << 6)
#define ESP32_UNIT_112_BIT_7 (1UL << 7)
#define ESP32_UNIT_112_BIT_8 (1UL << 8)
#define ESP32_UNIT_112_BIT_9 (1UL << 9)
#define ESP32_UNIT_112_BIT_10 (1UL << 10)
#define ESP32_UNIT_112_BIT_11 (1UL << 11)
#define ESP32_UNIT_112_BIT_12 (1UL << 12)
#define ESP32_UNIT_112_BIT_13 (1UL << 13)
#define ESP32_UNIT_112_BIT_14 (1UL << 14)
#define ESP32_UNIT_112_BIT_15 (1UL << 15)
#define ESP32_UNIT_112_BIT_16 (1UL << 16)
#define ESP32_UNIT_112_BIT_17 (1UL << 17)
#define ESP32_UNIT_112_BIT_18 (1UL << 18)
#define ESP32_UNIT_112_BIT_19 (1UL << 19)
#define ESP32_UNIT_112_BIT_20 (1UL << 20)
#define ESP32_UNIT_112_BIT_21 (1UL << 21)
#define ESP32_UNIT_112_BIT_22 (1UL << 22)
#define ESP32_UNIT_112_BIT_23 (1UL << 23)
#define ESP32_UNIT_112_BIT_24 (1UL << 24)
#define ESP32_UNIT_112_BIT_25 (1UL << 25)
#define ESP32_UNIT_112_BIT_26 (1UL << 26)
#define ESP32_UNIT_112_BIT_27 (1UL << 27)
#define ESP32_UNIT_112_BIT_28 (1UL << 28)
#define ESP32_UNIT_112_BIT_29 (1UL << 29)
#define ESP32_UNIT_112_BIT_30 (1UL << 30)
#define ESP32_UNIT_112_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_113_TypeDef;
#define ESP32_UNIT_113 ((ESP32_UNIT_113_TypeDef *)(0x3FF40000UL + 113 * 0x400UL))

#define ESP32_UNIT_113_BIT_0 (1UL << 0)
#define ESP32_UNIT_113_BIT_1 (1UL << 1)
#define ESP32_UNIT_113_BIT_2 (1UL << 2)
#define ESP32_UNIT_113_BIT_3 (1UL << 3)
#define ESP32_UNIT_113_BIT_4 (1UL << 4)
#define ESP32_UNIT_113_BIT_5 (1UL << 5)
#define ESP32_UNIT_113_BIT_6 (1UL << 6)
#define ESP32_UNIT_113_BIT_7 (1UL << 7)
#define ESP32_UNIT_113_BIT_8 (1UL << 8)
#define ESP32_UNIT_113_BIT_9 (1UL << 9)
#define ESP32_UNIT_113_BIT_10 (1UL << 10)
#define ESP32_UNIT_113_BIT_11 (1UL << 11)
#define ESP32_UNIT_113_BIT_12 (1UL << 12)
#define ESP32_UNIT_113_BIT_13 (1UL << 13)
#define ESP32_UNIT_113_BIT_14 (1UL << 14)
#define ESP32_UNIT_113_BIT_15 (1UL << 15)
#define ESP32_UNIT_113_BIT_16 (1UL << 16)
#define ESP32_UNIT_113_BIT_17 (1UL << 17)
#define ESP32_UNIT_113_BIT_18 (1UL << 18)
#define ESP32_UNIT_113_BIT_19 (1UL << 19)
#define ESP32_UNIT_113_BIT_20 (1UL << 20)
#define ESP32_UNIT_113_BIT_21 (1UL << 21)
#define ESP32_UNIT_113_BIT_22 (1UL << 22)
#define ESP32_UNIT_113_BIT_23 (1UL << 23)
#define ESP32_UNIT_113_BIT_24 (1UL << 24)
#define ESP32_UNIT_113_BIT_25 (1UL << 25)
#define ESP32_UNIT_113_BIT_26 (1UL << 26)
#define ESP32_UNIT_113_BIT_27 (1UL << 27)
#define ESP32_UNIT_113_BIT_28 (1UL << 28)
#define ESP32_UNIT_113_BIT_29 (1UL << 29)
#define ESP32_UNIT_113_BIT_30 (1UL << 30)
#define ESP32_UNIT_113_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_114_TypeDef;
#define ESP32_UNIT_114 ((ESP32_UNIT_114_TypeDef *)(0x3FF40000UL + 114 * 0x400UL))

#define ESP32_UNIT_114_BIT_0 (1UL << 0)
#define ESP32_UNIT_114_BIT_1 (1UL << 1)
#define ESP32_UNIT_114_BIT_2 (1UL << 2)
#define ESP32_UNIT_114_BIT_3 (1UL << 3)
#define ESP32_UNIT_114_BIT_4 (1UL << 4)
#define ESP32_UNIT_114_BIT_5 (1UL << 5)
#define ESP32_UNIT_114_BIT_6 (1UL << 6)
#define ESP32_UNIT_114_BIT_7 (1UL << 7)
#define ESP32_UNIT_114_BIT_8 (1UL << 8)
#define ESP32_UNIT_114_BIT_9 (1UL << 9)
#define ESP32_UNIT_114_BIT_10 (1UL << 10)
#define ESP32_UNIT_114_BIT_11 (1UL << 11)
#define ESP32_UNIT_114_BIT_12 (1UL << 12)
#define ESP32_UNIT_114_BIT_13 (1UL << 13)
#define ESP32_UNIT_114_BIT_14 (1UL << 14)
#define ESP32_UNIT_114_BIT_15 (1UL << 15)
#define ESP32_UNIT_114_BIT_16 (1UL << 16)
#define ESP32_UNIT_114_BIT_17 (1UL << 17)
#define ESP32_UNIT_114_BIT_18 (1UL << 18)
#define ESP32_UNIT_114_BIT_19 (1UL << 19)
#define ESP32_UNIT_114_BIT_20 (1UL << 20)
#define ESP32_UNIT_114_BIT_21 (1UL << 21)
#define ESP32_UNIT_114_BIT_22 (1UL << 22)
#define ESP32_UNIT_114_BIT_23 (1UL << 23)
#define ESP32_UNIT_114_BIT_24 (1UL << 24)
#define ESP32_UNIT_114_BIT_25 (1UL << 25)
#define ESP32_UNIT_114_BIT_26 (1UL << 26)
#define ESP32_UNIT_114_BIT_27 (1UL << 27)
#define ESP32_UNIT_114_BIT_28 (1UL << 28)
#define ESP32_UNIT_114_BIT_29 (1UL << 29)
#define ESP32_UNIT_114_BIT_30 (1UL << 30)
#define ESP32_UNIT_114_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_115_TypeDef;
#define ESP32_UNIT_115 ((ESP32_UNIT_115_TypeDef *)(0x3FF40000UL + 115 * 0x400UL))

#define ESP32_UNIT_115_BIT_0 (1UL << 0)
#define ESP32_UNIT_115_BIT_1 (1UL << 1)
#define ESP32_UNIT_115_BIT_2 (1UL << 2)
#define ESP32_UNIT_115_BIT_3 (1UL << 3)
#define ESP32_UNIT_115_BIT_4 (1UL << 4)
#define ESP32_UNIT_115_BIT_5 (1UL << 5)
#define ESP32_UNIT_115_BIT_6 (1UL << 6)
#define ESP32_UNIT_115_BIT_7 (1UL << 7)
#define ESP32_UNIT_115_BIT_8 (1UL << 8)
#define ESP32_UNIT_115_BIT_9 (1UL << 9)
#define ESP32_UNIT_115_BIT_10 (1UL << 10)
#define ESP32_UNIT_115_BIT_11 (1UL << 11)
#define ESP32_UNIT_115_BIT_12 (1UL << 12)
#define ESP32_UNIT_115_BIT_13 (1UL << 13)
#define ESP32_UNIT_115_BIT_14 (1UL << 14)
#define ESP32_UNIT_115_BIT_15 (1UL << 15)
#define ESP32_UNIT_115_BIT_16 (1UL << 16)
#define ESP32_UNIT_115_BIT_17 (1UL << 17)
#define ESP32_UNIT_115_BIT_18 (1UL << 18)
#define ESP32_UNIT_115_BIT_19 (1UL << 19)
#define ESP32_UNIT_115_BIT_20 (1UL << 20)
#define ESP32_UNIT_115_BIT_21 (1UL << 21)
#define ESP32_UNIT_115_BIT_22 (1UL << 22)
#define ESP32_UNIT_115_BIT_23 (1UL << 23)
#define ESP32_UNIT_115_BIT_24 (1UL << 24)
#define ESP32_UNIT_115_BIT_25 (1UL << 25)
#define ESP32_UNIT_115_BIT_26 (1UL << 26)
#define ESP32_UNIT_115_BIT_27 (1UL << 27)
#define ESP32_UNIT_115_BIT_28 (1UL << 28)
#define ESP32_UNIT_115_BIT_29 (1UL << 29)
#define ESP32_UNIT_115_BIT_30 (1UL << 30)
#define ESP32_UNIT_115_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_116_TypeDef;
#define ESP32_UNIT_116 ((ESP32_UNIT_116_TypeDef *)(0x3FF40000UL + 116 * 0x400UL))

