RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_116_BIT_0 (1UL << 0)
#define ESP32_UNIT_116_BIT_1 (1UL << 1)
#define ESP32_UNIT_116_BIT_2 (1UL << 2)
#define ESP32_UNIT_116_BIT_3 (1UL << 3)
#define ESP32_UNIT_116_BIT_4 (1UL << 4)
#define ESP32_UNIT_116_BIT_5 (1UL << 5)
#define ESP32_UNIT_116_BIT_6 (1UL << 6)
#define ESP32_UNIT_116_BIT_7 (1UL << 7)
#define ESP32_UNIT_116_BIT_8 (1UL << 8)
#define ESP32_UNIT_116_BIT_9 (1UL << 9)
#define ESP32_UNIT_116_BIT_10 (1UL << 10)
#define ESP32_UNIT_116_BIT_11 (1UL << 11)
#define ESP32_UNIT_116_BIT_12 (1UL << 12)
#define ESP32_UNIT_116_BIT_13 (1UL << 13)
#define ESP32_UNIT_116_BIT_14 (1UL << 14)
#define ESP32_UNIT_116_BIT_15 (1UL << 15)
#define ESP32_UNIT_116_BIT_16 (1UL << 16)
#define ESP32_UNIT_116_BIT_17 (1UL << 17)
#define ESP32_UNIT_116_BIT_18 (1UL << 18)
#define ESP32_UNIT_116_BIT_19 (1UL << 19)
#define ESP32_UNIT_116_BIT_20 (1UL << 20)
#define ESP32_UNIT_116_BIT_21 (1UL << 21)
#define ESP32_UNIT_116_BIT_22 (1UL << 22)
#define ESP32_UNIT_116_BIT_23 (1UL << 23)
#define ESP32_UNIT_116_BIT_24 (1UL << 24)
#define ESP32_UNIT_116_BIT_25 (1UL << 25)
#define ESP32_UNIT_116_BIT_26 (1UL << 26)
#define ESP32_UNIT_116_BIT_27 (1UL << 27)
#define ESP32_UNIT_116_BIT_28 (1UL << 28)
#define ESP32_UNIT_116_BIT_29 (1UL << 29)
#define ESP32_UNIT_116_BIT_30 (1UL << 30)
#define ESP32_UNIT_116_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_117_TypeDef;
#define ESP32_UNIT_117 ((ESP32_UNIT_117_TypeDef *)(0x3FF40000UL + 117 * 0x400UL))

#define ESP32_UNIT_117_BIT_0 (1UL << 0)
#define ESP32_UNIT_117_BIT_1 (1UL << 1)
#define ESP32_UNIT_117_BIT_2 (1UL << 2)
#define ESP32_UNIT_117_BIT_3 (1UL << 3)
#define ESP32_UNIT_117_BIT_4 (1UL << 4)
#define ESP32_UNIT_117_BIT_5 (1UL << 5)
#define ESP32_UNIT_117_BIT_6 (1UL << 6)
#define ESP32_UNIT_117_BIT_7 (1UL << 7)
#define ESP32_UNIT_117_BIT_8 (1UL << 8)
#define ESP32_UNIT_117_BIT_9 (1UL << 9)
#define ESP32_UNIT_117_BIT_10 (1UL << 10)
#define ESP32_UNIT_117_BIT_11 (1UL << 11)
#define ESP32_UNIT_117_BIT_12 (1UL << 12)
#define ESP32_UNIT_117_BIT_13 (1UL << 13)
#define ESP32_UNIT_117_BIT_14 (1UL << 14)
#define ESP32_UNIT_117_BIT_15 (1UL << 15)
#define ESP32_UNIT_117_BIT_16 (1UL << 16)
#define ESP32_UNIT_117_BIT_17 (1UL << 17)
#define ESP32_UNIT_117_BIT_18 (1UL << 18)
#define ESP32_UNIT_117_BIT_19 (1UL << 19)
#define ESP32_UNIT_117_BIT_20 (1UL << 20)
#define ESP32_UNIT_117_BIT_21 (1UL << 21)
#define ESP32_UNIT_117_BIT_22 (1UL << 22)
#define ESP32_UNIT_117_BIT_23 (1UL << 23)
#define ESP32_UNIT_117_BIT_24 (1UL << 24)
#define ESP32_UNIT_117_BIT_25 (1UL << 25)
#define ESP32_UNIT_117_BIT_26 (1UL << 26)
#define ESP32_UNIT_117_BIT_27 (1UL << 27)
#define ESP32_UNIT_117_BIT_28 (1UL << 28)
#define ESP32_UNIT_117_BIT_29 (1UL << 29)
#define ESP32_UNIT_117_BIT_30 (1UL << 30)
#define ESP32_UNIT_117_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_118_TypeDef;
#define ESP32_UNIT_118 ((ESP32_UNIT_118_TypeDef *)(0x3FF40000UL + 118 * 0x400UL))

#define ESP32_UNIT_118_BIT_0 (1UL << 0)
#define ESP32_UNIT_118_BIT_1 (1UL << 1)
#define ESP32_UNIT_118_BIT_2 (1UL << 2)
#define ESP32_UNIT_118_BIT_3 (1UL << 3)
#define ESP32_UNIT_118_BIT_4 (1UL << 4)
#define ESP32_UNIT_118_BIT_5 (1UL << 5)
#define ESP32_UNIT_118_BIT_6 (1UL << 6)
#define ESP32_UNIT_118_BIT_7 (1UL << 7)
#define ESP32_UNIT_118_BIT_8 (1UL << 8)
#define ESP32_UNIT_118_BIT_9 (1UL << 9)
#define ESP32_UNIT_118_BIT_10 (1UL << 10)
#define ESP32_UNIT_118_BIT_11 (1UL << 11)
#define ESP32_UNIT_118_BIT_12 (1UL << 12)
#define ESP32_UNIT_118_BIT_13 (1UL << 13)
#define ESP32_UNIT_118_BIT_14 (1UL << 14)
#define ESP32_UNIT_118_BIT_15 (1UL << 15)
#define ESP32_UNIT_118_BIT_16 (1UL << 16)
#define ESP32_UNIT_118_BIT_17 (1UL << 17)
#define ESP32_UNIT_118_BIT_18 (1UL << 18)
#define ESP32_UNIT_118_BIT_19 (1UL << 19)
#define ESP32_UNIT_118_BIT_20 (1UL << 20)
#define ESP32_UNIT_118_BIT_21 (1UL << 21)
#define ESP32_UNIT_118_BIT_22 (1UL << 22)
#define ESP32_UNIT_118_BIT_23 (1UL << 23)
#define ESP32_UNIT_118_BIT_24 (1UL << 24)
#define ESP32_UNIT_118_BIT_25 (1UL << 25)
#define ESP32_UNIT_118_BIT_26 (1UL << 26)
#define ESP32_UNIT_118_BIT_27 (1UL << 27)
#define ESP32_UNIT_118_BIT_28 (1UL << 28)
#define ESP32_UNIT_118_BIT_29 (1UL << 29)
#define ESP32_UNIT_118_BIT_30 (1UL << 30)
#define ESP32_UNIT_118_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_119_TypeDef;
#define ESP32_UNIT_119 ((ESP32_UNIT_119_TypeDef *)(0x3FF40000UL + 119 * 0x400UL))

#define ESP32_UNIT_119_BIT_0 (1UL << 0)
#define ESP32_UNIT_119_BIT_1 (1UL << 1)
#define ESP32_UNIT_119_BIT_2 (1UL << 2)
#define ESP32_UNIT_119_BIT_3 (1UL << 3)
#define ESP32_UNIT_119_BIT_4 (1UL << 4)
#define ESP32_UNIT_119_BIT_5 (1UL << 5)
#define ESP32_UNIT_119_BIT_6 (1UL << 6)
#define ESP32_UNIT_119_BIT_7 (1UL << 7)
#define ESP32_UNIT_119_BIT_8 (1UL << 8)
#define ESP32_UNIT_119_BIT_9 (1UL << 9)
#define ESP32_UNIT_119_BIT_10 (1UL << 10)
#define ESP32_UNIT_119_BIT_11 (1UL << 11)
#define ESP32_UNIT_119_BIT_12 (1UL << 12)
#define ESP32_UNIT_119_BIT_13 (1UL << 13)
#define ESP32_UNIT_119_BIT_14 (1UL << 14)
#define ESP32_UNIT_119_BIT_15 (1UL << 15)
#define ESP32_UNIT_119_BIT_16 (1UL << 16)
#define ESP32_UNIT_119_BIT_17 (1UL << 17)
#define ESP32_UNIT_119_BIT_18 (1UL << 18)
#define ESP32_UNIT_119_BIT_19 (1UL << 19)
#define ESP32_UNIT_119_BIT_20 (1UL << 20)
#define ESP32_UNIT_119_BIT_21 (1UL << 21)
#define ESP32_UNIT_119_BIT_22 (1UL << 22)
#define ESP32_UNIT_119_BIT_23 (1UL << 23)
#define ESP32_UNIT_119_BIT_24 (1UL << 24)
#define ESP32_UNIT_119_BIT_25 (1UL << 25)
#define ESP32_UNIT_119_BIT_26 (1UL << 26)
#define ESP32_UNIT_119_BIT_27 (1UL << 27)
#define ESP32_UNIT_119_BIT_28 (1UL << 28)
#define ESP32_UNIT_119_BIT_29 (1UL << 29)
#define ESP32_UNIT_119_BIT_30 (1UL << 30)
#define ESP32_UNIT_119_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_120_TypeDef;
#define ESP32_UNIT_120 ((ESP32_UNIT_120_TypeDef *)(0x3FF40000UL + 120 * 0x400UL))

