RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_120_BIT_0 (1UL << 0)
#define ESP32_UNIT_120_BIT_1 (1UL << 1)
#define ESP32_UNIT_120_BIT_2 (1UL << 2)
#define ESP32_UNIT_120_BIT_3 (1UL << 3)
#define ESP32_UNIT_120_BIT_4 (1UL << 4)
#define ESP32_UNIT_120_BIT_5 (1UL << 5)
#define ESP32_UNIT_120_BIT_6 (1UL << 6)
#define ESP32_UNIT_120_BIT_7 (1UL << 7)
#define ESP32_UNIT_120_BIT_8 (1UL << 8)
#define ESP32_UNIT_120_BIT_9 (1UL << 9)
#define ESP32_UNIT_120_BIT_10 (1UL << 10)
#define ESP32_UNIT_120_BIT_11 (1UL << 11)
#define ESP32_UNIT_120_BIT_12 (1UL << 12)
#define ESP32_UNIT_120_BIT_13 (1UL << 13)
#define ESP32_UNIT_120_BIT_14 (1UL << 14)
#define ESP32_UNIT_120_BIT_15 (1UL << 15)
#define ESP32_UNIT_120_BIT_16 (1UL << 16)
#define ESP32_UNIT_120_BIT_17 (1UL << 17)
#define ESP32_UNIT_120_BIT_18 (1UL << 18)
#define ESP32_UNIT_120_BIT_19 (1UL << 19)
#define ESP32_UNIT_120_BIT_20 (1UL << 20)
#define ESP32_UNIT_120_BIT_21 (1UL << 21)
#define ESP32_UNIT_120_BIT_22 (1UL << 22)
#define ESP32_UNIT_120_BIT_23 (1UL << 23)
#define ESP32_UNIT_120_BIT_24 (1UL << 24)
#define ESP32_UNIT_120_BIT_25 (1UL << 25)
#define ESP32_UNIT_120_BIT_26 (1UL << 26)
#define ESP32_UNIT_120_BIT_27 (1UL << 27)
#define ESP32_UNIT_120_BIT_28 (1UL << 28)
#define ESP32_UNIT_120_BIT_29 (1UL << 29)
#define ESP32_UNIT_120_BIT_30 (1UL << 30)
#define ESP32_UNIT_120_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_121_TypeDef;
#define ESP32_UNIT_121 ((ESP32_UNIT_121_TypeDef *)(0x3FF40000UL + 121 * 0x400UL))

#define ESP32_UNIT_121_BIT_0 (1UL << 0)
#define ESP32_UNIT_121_BIT_1 (1UL << 1)
#define ESP32_UNIT_121_BIT_2 (1UL << 2)
#define ESP32_UNIT_121_BIT_3 (1UL << 3)
#define ESP32_UNIT_121_BIT_4 (1UL << 4)
#define ESP32_UNIT_121_BIT_5 (1UL << 5)
#define ESP32_UNIT_121_BIT_6 (1UL << 6)
#define ESP32_UNIT_121_BIT_7 (1UL << 7)
#define ESP32_UNIT_121_BIT_8 (1UL << 8)
#define ESP32_UNIT_121_BIT_9 (1UL << 9)
#define ESP32_UNIT_121_BIT_10 (1UL << 10)
#define ESP32_UNIT_121_BIT_11 (1UL << 11)
#define ESP32_UNIT_121_BIT_12 (1UL << 12)
#define ESP32_UNIT_121_BIT_13 (1UL << 13)
#define ESP32_UNIT_121_BIT_14 (1UL << 14)
#define ESP32_UNIT_121_BIT_15 (1UL << 15)
#define ESP32_UNIT_121_BIT_16 (1UL << 16)
#define ESP32_UNIT_121_BIT_17 (1UL << 17)
#define ESP32_UNIT_121_BIT_18 (1UL << 18)
#define ESP32_UNIT_121_BIT_19 (1UL << 19)
#define ESP32_UNIT_121_BIT_20 (1UL << 20)
#define ESP32_UNIT_121_BIT_21 (1UL << 21)
#define ESP32_UNIT_121_BIT_22 (1UL << 22)
#define ESP32_UNIT_121_BIT_23 (1UL << 23)
#define ESP32_UNIT_121_BIT_24 (1UL << 24)
#define ESP32_UNIT_121_BIT_25 (1UL << 25)
#define ESP32_UNIT_121_BIT_26 (1UL << 26)
#define ESP32_UNIT_121_BIT_27 (1UL << 27)
#define ESP32_UNIT_121_BIT_28 (1UL << 28)
#define ESP32_UNIT_121_BIT_29 (1UL << 29)
#define ESP32_UNIT_121_BIT_30 (1UL << 30)
#define ESP32_UNIT_121_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_122_TypeDef;
#define ESP32_UNIT_122 ((ESP32_UNIT_122_TypeDef *)(0x3FF40000UL + 122 * 0x400UL))

#define ESP32_UNIT_122_BIT_0 (1UL << 0)
#define ESP32_UNIT_122_BIT_1 (1UL << 1)
#define ESP32_UNIT_122_BIT_2 (1UL << 2)
#define ESP32_UNIT_122_BIT_3 (1UL << 3)
#define ESP32_UNIT_122_BIT_4 (1UL << 4)
#define ESP32_UNIT_122_BIT_5 (1UL << 5)
#define ESP32_UNIT_122_BIT_6 (1UL << 6)
#define ESP32_UNIT_122_BIT_7 (1UL << 7)
#define ESP32_UNIT_122_BIT_8 (1UL << 8)
#define ESP32_UNIT_122_BIT_9 (1UL << 9)
#define ESP32_UNIT_122_BIT_10 (1UL << 10)
#define ESP32_UNIT_122_BIT_11 (1UL << 11)
#define ESP32_UNIT_122_BIT_12 (1UL << 12)
#define ESP32_UNIT_122_BIT_13 (1UL << 13)
#define ESP32_UNIT_122_BIT_14 (1UL << 14)
#define ESP32_UNIT_122_BIT_15 (1UL << 15)
#define ESP32_UNIT_122_BIT_16 (1UL << 16)
#define ESP32_UNIT_122_BIT_17 (1UL << 17)
#define ESP32_UNIT_122_BIT_18 (1UL << 18)
#define ESP32_UNIT_122_BIT_19 (1UL << 19)
#define ESP32_UNIT_122_BIT_20 (1UL << 20)
#define ESP32_UNIT_122_BIT_21 (1UL << 21)
#define ESP32_UNIT_122_BIT_22 (1UL << 22)
#define ESP32_UNIT_122_BIT_23 (1UL << 23)
#define ESP32_UNIT_122_BIT_24 (1UL << 24)
#define ESP32_UNIT_122_BIT_25 (1UL << 25)
#define ESP32_UNIT_122_BIT_26 (1UL << 26)
#define ESP32_UNIT_122_BIT_27 (1UL << 27)
#define ESP32_UNIT_122_BIT_28 (1UL << 28)
#define ESP32_UNIT_122_BIT_29 (1UL << 29)
#define ESP32_UNIT_122_BIT_30 (1UL << 30)
#define ESP32_UNIT_122_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_123_TypeDef;
#define ESP32_UNIT_123 ((ESP32_UNIT_123_TypeDef *)(0x3FF40000UL + 123 * 0x400UL))

#define ESP32_UNIT_123_BIT_0 (1UL << 0)
#define ESP32_UNIT_123_BIT_1 (1UL << 1)
#define ESP32_UNIT_123_BIT_2 (1UL << 2)
#define ESP32_UNIT_123_BIT_3 (1UL << 3)
#define ESP32_UNIT_123_BIT_4 (1UL << 4)
#define ESP32_UNIT_123_BIT_5 (1UL << 5)
#define ESP32_UNIT_123_BIT_6 (1UL << 6)
#define ESP32_UNIT_123_BIT_7 (1UL << 7)
#define ESP32_UNIT_123_BIT_8 (1UL << 8)
#define ESP32_UNIT_123_BIT_9 (1UL << 9)
#define ESP32_UNIT_123_BIT_10 (1UL << 10)
#define ESP32_UNIT_123_BIT_11 (1UL << 11)
#define ESP32_UNIT_123_BIT_12 (1UL << 12)
#define ESP32_UNIT_123_BIT_13 (1UL << 13)
#define ESP32_UNIT_123_BIT_14 (1UL << 14)
#define ESP32_UNIT_123_BIT_15 (1UL << 15)
#define ESP32_UNIT_123_BIT_16 (1UL << 16)
#define ESP32_UNIT_123_BIT_17 (1UL << 17)
#define ESP32_UNIT_123_BIT_18 (1UL << 18)
#define ESP32_UNIT_123_BIT_19 (1UL << 19)
#define ESP32_UNIT_123_BIT_20 (1UL << 20)
#define ESP32_UNIT_123_BIT_21 (1UL << 21)
#define ESP32_UNIT_123_BIT_22 (1UL << 22)
#define ESP32_UNIT_123_BIT_23 (1UL << 23)
#define ESP32_UNIT_123_BIT_24 (1UL << 24)
#define ESP32_UNIT_123_BIT_25 (1UL << 25)
#define ESP32_UNIT_123_BIT_26 (1UL << 26)
#define ESP32_UNIT_123_BIT_27 (1UL << 27)
#define ESP32_UNIT_123_BIT_28 (1UL << 28)
#define ESP32_UNIT_123_BIT_29 (1UL << 29)
#define ESP32_UNIT_123_BIT_30 (1UL << 30)
#define ESP32_UNIT_123_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_124_TypeDef;
#define ESP32_UNIT_124 ((ESP32_UNIT_124_TypeDef *)(0x3FF40000UL + 124 * 0x400UL))

#define ESP32_UNIT_124_BIT_0 (1UL << 0)
#define ESP32_UNIT_124_BIT_1 (1UL << 1)
#define ESP32_UNIT_124_BIT_2 (1UL << 2)
#define ESP32_UNIT_124_BIT_3 (1UL << 3)
#define ESP32_UNIT_124_BIT_4 (1UL << 4)
#define ESP32_UNIT_124_BIT_5 (1UL << 5)
#define ESP32_UNIT_124_BIT_6 (1UL << 6)
#define ESP32_UNIT_124_BIT_7 (1UL << 7)
#define ESP32_UNIT_124_BIT_8 (1UL << 8)
#define ESP32_UNIT_124_BIT_9 (1UL << 9)
#define ESP32_UNIT_124_BIT_10 (1UL << 10)
#define ESP32_UNIT_124_BIT_11 (1UL << 11)
#define ESP32_UNIT_124_BIT_12 (1UL << 12)
#define ESP32_UNIT_124_BIT_13 (1UL << 13)
#define ESP32_UNIT_124_BIT_14 (1UL << 14)
#define ESP32_UNIT_124_BIT_15 (1UL << 15)
#define ESP32_UNIT_124_BIT_16 (1UL << 16)
#define ESP32_UNIT_124_BIT_17 (1UL << 17)
#define ESP32_UNIT_124_BIT_18 (1UL << 18)
#define ESP32_UNIT_124_BIT_19 (1UL << 19)
#define ESP32_UNIT_124_BIT_20 (1UL << 20)
#define ESP32_UNIT_124_BIT_21 (1UL << 21)
#define ESP32_UNIT_124_BIT_22 (1UL << 22)
#define ESP32_UNIT_124_BIT_23 (1UL << 23)
#define ESP32_UNIT_124_BIT_24 (1UL << 24)
#define ESP32_UNIT_124_BIT_25 (1UL << 25)
#define ESP32_UNIT_124_BIT_26 (1UL << 26)
#define ESP32_UNIT_124_BIT_27 (1UL << 27)
#define ESP32_UNIT_124_BIT_28 (1UL << 28)
#define ESP32_UNIT_124_BIT_29 (1UL << 29)
#define ESP32_UNIT_124_BIT_30 (1UL << 30)
#define ESP32_UNIT_124_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_125_TypeDef;
#define ESP32_UNIT_125 ((ESP32_UNIT_125_TypeDef *)(0x3FF40000UL + 125 * 0x400UL))

#define ESP32_UNIT_125_BIT_0 (1UL << 0)
#define ESP32_UNIT_125_BIT_1 (1UL << 1)
#define ESP32_UNIT_125_BIT_2 (1UL << 2)
#define ESP32_UNIT_125_BIT_3 (1UL << 3)
#define ESP32_UNIT_125_BIT_4 (1UL << 4)
#define ESP32_UNIT_125_BIT_5 (1UL << 5)
#define ESP32_UNIT_125_BIT_6 (1UL << 6)
#define ESP32_UNIT_125_BIT_7 (1UL << 7)
#define ESP32_UNIT_125_BIT_8 (1UL << 8)
#define ESP32_UNIT_125_BIT_9 (1UL << 9)
#define ESP32_UNIT_125_BIT_10 (1UL << 10)
#define ESP32_UNIT_125_BIT_11 (1UL << 11)
#define ESP32_UNIT_125_BIT_12 (1UL << 12)
#define ESP32_UNIT_125_BIT_13 (1UL << 13)
#define ESP32_UNIT_125_BIT_14 (1UL << 14)
#define ESP32_UNIT_125_BIT_15 (1UL << 15)
#define ESP32_UNIT_125_BIT_16 (1UL << 16)
#define ESP32_UNIT_125_BIT_17 (1UL << 17)
#define ESP32_UNIT_125_BIT_18 (1UL << 18)
#define ESP32_UNIT_125_BIT_19 (1UL << 19)
#define ESP32_UNIT_125_BIT_20 (1UL << 20)
#define ESP32_UNIT_125_BIT_21 (1UL << 21)
#define ESP32_UNIT_125_BIT_22 (1UL << 22)
#define ESP32_UNIT_125_BIT_23 (1UL << 23)
#define ESP32_UNIT_125_BIT_24 (1UL << 24)
#define ESP32_UNIT_125_BIT_25 (1UL << 25)
#define ESP32_UNIT_125_BIT_26 (1UL << 26)
#define ESP32_UNIT_125_BIT_27 (1UL << 27)
#define ESP32_UNIT_125_BIT_28 (1UL << 28)
#define ESP32_UNIT_125_BIT_29 (1UL << 29)
#define ESP32_UNIT_125_BIT_30 (1UL << 30)
#define ESP32_UNIT_125_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_126_TypeDef;
#define ESP32_UNIT_126 ((ESP32_UNIT_126_TypeDef *)(0x3FF40000UL + 126 * 0x400UL))

#define ESP32_UNIT_126_BIT_0 (1UL << 0)
#define ESP32_UNIT_126_BIT_1 (1UL << 1)
#define ESP32_UNIT_126_BIT_2 (1UL << 2)
#define ESP32_UNIT_126_BIT_3 (1UL << 3)
#define ESP32_UNIT_126_BIT_4 (1UL << 4)
#define ESP32_UNIT_126_BIT_5 (1UL << 5)
#define ESP32_UNIT_126_BIT_6 (1UL << 6)
#define ESP32_UNIT_126_BIT_7 (1UL << 7)
#define ESP32_UNIT_126_BIT_8 (1UL << 8)
#define ESP32_UNIT_126_BIT_9 (1UL << 9)
#define ESP32_UNIT_126_BIT_10 (1UL << 10)
#define ESP32_UNIT_126_BIT_11 (1UL << 11)
#define ESP32_UNIT_126_BIT_12 (1UL << 12)
#define ESP32_UNIT_126_BIT_13 (1UL << 13)
#define ESP32_UNIT_126_BIT_14 (1UL << 14)
#define ESP32_UNIT_126_BIT_15 (1UL << 15)
#define ESP32_UNIT_126_BIT_16 (1UL << 16)
#define ESP32_UNIT_126_BIT_17 (1UL << 17)
#define ESP32_UNIT_126_BIT_18 (1UL << 18)
#define ESP32_UNIT_126_BIT_19 (1UL << 19)
#define ESP32_UNIT_126_BIT_20 (1UL << 20)
#define ESP32_UNIT_126_BIT_21 (1UL << 21)
#define ESP32_UNIT_126_BIT_22 (1UL << 22)
#define ESP32_UNIT_126_BIT_23 (1UL << 23)
#define ESP32_UNIT_126_BIT_24 (1UL << 24)
#define ESP32_UNIT_126_BIT_25 (1UL << 25)
#define ESP32_UNIT_126_BIT_26 (1UL << 26)
#define ESP32_UNIT_126_BIT_27 (1UL << 27)
#define ESP32_UNIT_126_BIT_28 (1UL << 28)
#define ESP32_UNIT_126_BIT_29 (1UL << 29)
#define ESP32_UNIT_126_BIT_30 (1UL << 30)
#define ESP32_UNIT_126_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_127_TypeDef;
#define ESP32_UNIT_127 ((ESP32_UNIT_127_TypeDef *)(0x3FF40000UL + 127 * 0x400UL))

