RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_127_BIT_0 (1UL << 0)
#define ESP32_UNIT_127_BIT_1 (1UL << 1)
#define ESP32_UNIT_127_BIT_2 (1UL << 2)
#define ESP32_UNIT_127_BIT_3 (1UL << 3)
#define ESP32_UNIT_127_BIT_4 (1UL << 4)
#define ESP32_UNIT_127_BIT_5 (1UL << 5)
#define ESP32_UNIT_127_BIT_6 (1UL << 6)
#define ESP32_UNIT_127_BIT_7 (1UL << 7)
#define ESP32_UNIT_127_BIT_8 (1UL << 8)
#define ESP32_UNIT_127_BIT_9 (1UL << 9)
#define ESP32_UNIT_127_BIT_10 (1UL << 10)
#define ESP32_UNIT_127_BIT_11 (1UL << 11)
#define ESP32_UNIT_127_BIT_12 (1UL << 12)
#define ESP32_UNIT_127_BIT_13 (1UL << 13)
#define ESP32_UNIT_127_BIT_14 (1UL << 14)
#define ESP32_UNIT_127_BIT_15 (1UL << 15)
#define ESP32_UNIT_127_BIT_16 (1UL << 16)
#define ESP32_UNIT_127_BIT_17 (1UL << 17)
#define ESP32_UNIT_127_BIT_18 (1UL << 18)
#define ESP32_UNIT_127_BIT_19 (1UL << 19)
#define ESP32_UNIT_127_BIT_20 (1UL << 20)
#define ESP32_UNIT_127_BIT_21 (1UL << 21)
#define ESP32_UNIT_127_BIT_22 (1UL << 22)
#define ESP32_UNIT_127_BIT_23 (1UL << 23)
#define ESP32_UNIT_127_BIT_24 (1UL << 24)
#define ESP32_UNIT_127_BIT_25 (1UL << 25)
#define ESP32_UNIT_127_BIT_26 (1UL << 26)
#define ESP32_UNIT_127_BIT_27 (1UL << 27)
#define ESP32_UNIT_127_BIT_28 (1UL << 28)
#define ESP32_UNIT_127_BIT_29 (1UL << 29)
#define ESP32_UNIT_127_BIT_30 (1UL << 30)
#define ESP32_UNIT_127_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_128_TypeDef;
#define ESP32_UNIT_128 ((ESP32_UNIT_128_TypeDef *)(0x3FF40000UL + 128 * 0x400UL))

#define ESP32_UNIT_128_BIT_0 (1UL << 0)
#define ESP32_UNIT_128_BIT_1 (1UL << 1)
#define ESP32_UNIT_128_BIT_2 (1UL << 2)
#define ESP32_UNIT_128_BIT_3 (1UL << 3)
#define ESP32_UNIT_128_BIT_4 (1UL << 4)
#define ESP32_UNIT_128_BIT_5 (1UL << 5)
#define ESP32_UNIT_128_BIT_6 (1UL << 6)
#define ESP32_UNIT_128_BIT_7 (1UL << 7)
#define ESP32_UNIT_128_BIT_8 (1UL << 8)
#define ESP32_UNIT_128_BIT_9 (1UL << 9)
#define ESP32_UNIT_128_BIT_10 (1UL << 10)
#define ESP32_UNIT_128_BIT_11 (1UL << 11)
#define ESP32_UNIT_128_BIT_12 (1UL << 12)
#define ESP32_UNIT_128_BIT_13 (1UL << 13)
#define ESP32_UNIT_128_BIT_14 (1UL << 14)
#define ESP32_UNIT_128_BIT_15 (1UL << 15)
#define ESP32_UNIT_128_BIT_16 (1UL << 16)
#define ESP32_UNIT_128_BIT_17 (1UL << 17)
#define ESP32_UNIT_128_BIT_18 (1UL << 18)
#define ESP32_UNIT_128_BIT_19 (1UL << 19)
#define ESP32_UNIT_128_BIT_20 (1UL << 20)
#define ESP32_UNIT_128_BIT_21 (1UL << 21)
#define ESP32_UNIT_128_BIT_22 (1UL << 22)
#define ESP32_UNIT_128_BIT_23 (1UL << 23)
#define ESP32_UNIT_128_BIT_24 (1UL << 24)
#define ESP32_UNIT_128_BIT_25 (1UL << 25)
#define ESP32_UNIT_128_BIT_26 (1UL << 26)
#define ESP32_UNIT_128_BIT_27 (1UL << 27)
#define ESP32_UNIT_128_BIT_28 (1UL << 28)
#define ESP32_UNIT_128_BIT_29 (1UL << 29)
#define ESP32_UNIT_128_BIT_30 (1UL << 30)
#define ESP32_UNIT_128_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_129_TypeDef;
#define ESP32_UNIT_129 ((ESP32_UNIT_129_TypeDef *)(0x3FF40000UL + 129 * 0x400UL))

#define ESP32_UNIT_129_BIT_0 (1UL << 0)
#define ESP32_UNIT_129_BIT_1 (1UL << 1)
#define ESP32_UNIT_129_BIT_2 (1UL << 2)
#define ESP32_UNIT_129_BIT_3 (1UL << 3)
#define ESP32_UNIT_129_BIT_4 (1UL << 4)
#define ESP32_UNIT_129_BIT_5 (1UL << 5)
#define ESP32_UNIT_129_BIT_6 (1UL << 6)
#define ESP32_UNIT_129_BIT_7 (1UL << 7)
#define ESP32_UNIT_129_BIT_8 (1UL << 8)
#define ESP32_UNIT_129_BIT_9 (1UL << 9)
#define ESP32_UNIT_129_BIT_10 (1UL << 10)
#define ESP32_UNIT_129_BIT_11 (1UL << 11)
#define ESP32_UNIT_129_BIT_12 (1UL << 12)
#define ESP32_UNIT_129_BIT_13 (1UL << 13)
#define ESP32_UNIT_129_BIT_14 (1UL << 14)
#define ESP32_UNIT_129_BIT_15 (1UL << 15)
#define ESP32_UNIT_129_BIT_16 (1UL << 16)
#define ESP32_UNIT_129_BIT_17 (1UL << 17)
#define ESP32_UNIT_129_BIT_18 (1UL << 18)
#define ESP32_UNIT_129_BIT_19 (1UL << 19)
#define ESP32_UNIT_129_BIT_20 (1UL << 20)
#define ESP32_UNIT_129_BIT_21 (1UL << 21)
#define ESP32_UNIT_129_BIT_22 (1UL << 22)
#define ESP32_UNIT_129_BIT_23 (1UL << 23)
#define ESP32_UNIT_129_BIT_24 (1UL << 24)
#define ESP32_UNIT_129_BIT_25 (1UL << 25)
#define ESP32_UNIT_129_BIT_26 (1UL << 26)
#define ESP32_UNIT_129_BIT_27 (1UL << 27)
#define ESP32_UNIT_129_BIT_28 (1UL << 28)
#define ESP32_UNIT_129_BIT_29 (1UL << 29)
#define ESP32_UNIT_129_BIT_30 (1UL << 30)
#define ESP32_UNIT_129_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_130_TypeDef;
#define ESP32_UNIT_130 ((ESP32_UNIT_130_TypeDef *)(0x3FF40000UL + 130 * 0x400UL))

#define ESP32_UNIT_130_BIT_0 (1UL << 0)
#define ESP32_UNIT_130_BIT_1 (1UL << 1)
#define ESP32_UNIT_130_BIT_2 (1UL << 2)
#define ESP32_UNIT_130_BIT_3 (1UL << 3)
#define ESP32_UNIT_130_BIT_4 (1UL << 4)
#define ESP32_UNIT_130_BIT_5 (1UL << 5)
#define ESP32_UNIT_130_BIT_6 (1UL << 6)
#define ESP32_UNIT_130_BIT_7 (1UL << 7)
#define ESP32_UNIT_130_BIT_8 (1UL << 8)
#define ESP32_UNIT_130_BIT_9 (1UL << 9)
#define ESP32_UNIT_130_BIT_10 (1UL << 10)
#define ESP32_UNIT_130_BIT_11 (1UL << 11)
#define ESP32_UNIT_130_BIT_12 (1UL << 12)
#define ESP32_UNIT_130_BIT_13 (1UL << 13)
#define ESP32_UNIT_130_BIT_14 (1UL << 14)
#define ESP32_UNIT_130_BIT_15 (1UL << 15)
#define ESP32_UNIT_130_BIT_16 (1UL << 16)
#define ESP32_UNIT_130_BIT_17 (1UL << 17)
#define ESP32_UNIT_130_BIT_18 (1UL << 18)
#define ESP32_UNIT_130_BIT_19 (1UL << 19)
#define ESP32_UNIT_130_BIT_20 (1UL << 20)
#define ESP32_UNIT_130_BIT_21 (1UL << 21)
#define ESP32_UNIT_130_BIT_22 (1UL << 22)
#define ESP32_UNIT_130_BIT_23 (1UL << 23)
#define ESP32_UNIT_130_BIT_24 (1UL << 24)
#define ESP32_UNIT_130_BIT_25 (1UL << 25)
#define ESP32_UNIT_130_BIT_26 (1UL << 26)
#define ESP32_UNIT_130_BIT_27 (1UL << 27)
#define ESP32_UNIT_130_BIT_28 (1UL << 28)
#define ESP32_UNIT_130_BIT_29 (1UL << 29)
#define ESP32_UNIT_130_BIT_30 (1UL << 30)
#define ESP32_UNIT_130_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_131_TypeDef;
#define ESP32_UNIT_131 ((ESP32_UNIT_131_TypeDef *)(0x3FF40000UL + 131 * 0x400UL))

#define ESP32_UNIT_131_BIT_0 (1UL << 0)
#define ESP32_UNIT_131_BIT_1 (1UL << 1)
#define ESP32_UNIT_131_BIT_2 (1UL << 2)
#define ESP32_UNIT_131_BIT_3 (1UL << 3)
#define ESP32_UNIT_131_BIT_4 (1UL << 4)
#define ESP32_UNIT_131_BIT_5 (1UL << 5)
#define ESP32_UNIT_131_BIT_6 (1UL << 6)
#define ESP32_UNIT_131_BIT_7 (1UL << 7)
#define ESP32_UNIT_131_BIT_8 (1UL << 8)
#define ESP32_UNIT_131_BIT_9 (1UL << 9)
#define ESP32_UNIT_131_BIT_10 (1UL << 10)
#define ESP32_UNIT_131_BIT_11 (1UL << 11)
#define ESP32_UNIT_131_BIT_12 (1UL << 12)
#define ESP32_UNIT_131_BIT_13 (1UL << 13)
#define ESP32_UNIT_131_BIT_14 (1UL << 14)
#define ESP32_UNIT_131_BIT_15 (1UL << 15)
#define ESP32_UNIT_131_BIT_16 (1UL << 16)
#define ESP32_UNIT_131_BIT_17 (1UL << 17)
#define ESP32_UNIT_131_BIT_18 (1UL << 18)
#define ESP32_UNIT_131_BIT_19 (1UL << 19)
#define ESP32_UNIT_131_BIT_20 (1UL << 20)
#define ESP32_UNIT_131_BIT_21 (1UL << 21)
#define ESP32_UNIT_131_BIT_22 (1UL << 22)
#define ESP32_UNIT_131_BIT_23 (1UL << 23)
#define ESP32_UNIT_131_BIT_24 (1UL << 24)
#define ESP32_UNIT_131_BIT_25 (1UL << 25)
#define ESP32_UNIT_131_BIT_26 (1UL << 26)
#define ESP32_UNIT_131_BIT_27 (1UL << 27)
#define ESP32_UNIT_131_BIT_28 (1UL << 28)
#define ESP32_UNIT_131_BIT_29 (1UL << 29)
#define ESP32_UNIT_131_BIT_30 (1UL << 30)
#define ESP32_UNIT_131_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_132_TypeDef;
#define ESP32_UNIT_132 ((ESP32_UNIT_132_TypeDef *)(0x3FF40000UL + 132 * 0x400UL))

#define ESP32_UNIT_132_BIT_0 (1UL << 0)
#define ESP32_UNIT_132_BIT_1 (1UL << 1)
#define ESP32_UNIT_132_BIT_2 (1UL << 2)
#define ESP32_UNIT_132_BIT_3 (1UL << 3)
#define ESP32_UNIT_132_BIT_4 (1UL << 4)
#define ESP32_UNIT_132_BIT_5 (1UL << 5)
#define ESP32_UNIT_132_BIT_6 (1UL << 6)
#define ESP32_UNIT_132_BIT_7 (1UL << 7)
#define ESP32_UNIT_132_BIT_8 (1UL << 8)
#define ESP32_UNIT_132_BIT_9 (1UL << 9)
#define ESP32_UNIT_132_BIT_10 (1UL << 10)
#define ESP32_UNIT_132_BIT_11 (1UL << 11)
#define ESP32_UNIT_132_BIT_12 (1UL << 12)
#define ESP32_UNIT_132_BIT_13 (1UL << 13)
#define ESP32_UNIT_132_BIT_14 (1UL << 14)
#define ESP32_UNIT_132_BIT_15 (1UL << 15)
#define ESP32_UNIT_132_BIT_16 (1UL << 16)
#define ESP32_UNIT_132_BIT_17 (1UL << 17)
#define ESP32_UNIT_132_BIT_18 (1UL << 18)
#define ESP32_UNIT_132_BIT_19 (1UL << 19)
#define ESP32_UNIT_132_BIT_20 (1UL << 20)
#define ESP32_UNIT_132_BIT_21 (1UL << 21)
#define ESP32_UNIT_132_BIT_22 (1UL << 22)
#define ESP32_UNIT_132_BIT_23 (1UL << 23)
#define ESP32_UNIT_132_BIT_24 (1UL << 24)
#define ESP32_UNIT_132_BIT_25 (1UL << 25)
#define ESP32_UNIT_132_BIT_26 (1UL << 26)
#define ESP32_UNIT_132_BIT_27 (1UL << 27)
#define ESP32_UNIT_132_BIT_28 (1UL << 28)
#define ESP32_UNIT_132_BIT_29 (1UL << 29)
#define ESP32_UNIT_132_BIT_30 (1UL << 30)
#define ESP32_UNIT_132_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_133_TypeDef;
#define ESP32_UNIT_133 ((ESP32_UNIT_133_TypeDef *)(0x3FF40000UL + 133 * 0x400UL))

#define ESP32_UNIT_133_BIT_0 (1UL << 0)
#define ESP32_UNIT_133_BIT_1 (1UL << 1)
#define ESP32_UNIT_133_BIT_2 (1UL << 2)
#define ESP32_UNIT_133_BIT_3 (1UL << 3)
#define ESP32_UNIT_133_BIT_4 (1UL << 4)
#define ESP32_UNIT_133_BIT_5 (1UL << 5)
#define ESP32_UNIT_133_BIT_6 (1UL << 6)
#define ESP32_UNIT_133_BIT_7 (1UL << 7)
#define ESP32_UNIT_133_BIT_8 (1UL << 8)
#define ESP32_UNIT_133_BIT_9 (1UL << 9)
#define ESP32_UNIT_133_BIT_10 (1UL << 10)
#define ESP32_UNIT_133_BIT_11 (1UL << 11)
#define ESP32_UNIT_133_BIT_12 (1UL << 12)
#define ESP32_UNIT_133_BIT_13 (1UL << 13)
#define ESP32_UNIT_133_BIT_14 (1UL << 14)
#define ESP32_UNIT_133_BIT_15 (1UL << 15)
#define ESP32_UNIT_133_BIT_16 (1UL << 16)
#define ESP32_UNIT_133_BIT_17 (1UL << 17)
#define ESP32_UNIT_133_BIT_18 (1UL << 18)
#define ESP32_UNIT_133_BIT_19 (1UL << 19)
#define ESP32_UNIT_133_BIT_20 (1UL << 20)
#define ESP32_UNIT_133_BIT_21 (1UL << 21)
#define ESP32_UNIT_133_BIT_22 (1UL << 22)
#define ESP32_UNIT_133_BIT_23 (1UL << 23)
#define ESP32_UNIT_133_BIT_24 (1UL << 24)
#define ESP32_UNIT_133_BIT_25 (1UL << 25)
#define ESP32_UNIT_133_BIT_26 (1UL << 26)
#define ESP32_UNIT_133_BIT_27 (1UL << 27)
#define ESP32_UNIT_133_BIT_28 (1UL << 28)
#define ESP32_UNIT_133_BIT_29 (1UL << 29)
#define ESP32_UNIT_133_BIT_30 (1UL << 30)
#define ESP32_UNIT_133_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_134_TypeDef;
#define ESP32_UNIT_134 ((ESP32_UNIT_134_TypeDef *)(0x3FF40000UL + 134 * 0x400UL))

#define ESP32_UNIT_134_BIT_0 (1UL << 0)
#define ESP32_UNIT_134_BIT_1 (1UL << 1)
#define ESP32_UNIT_134_BIT_2 (1UL << 2)
#define ESP32_UNIT_134_BIT_3 (1UL << 3)
#define ESP32_UNIT_134_BIT_4 (1UL << 4)
#define ESP32_UNIT_134_BIT_5 (1UL << 5)
#define ESP32_UNIT_134_BIT_6 (1UL << 6)
#define ESP32_UNIT_134_BIT_7 (1UL << 7)
#define ESP32_UNIT_134_BIT_8 (1UL << 8)
#define ESP32_UNIT_134_BIT_9 (1UL << 9)
#define ESP32_UNIT_134_BIT_10 (1UL << 10)
#define ESP32_UNIT_134_BIT_11 (1UL << 11)
#define ESP32_UNIT_134_BIT_12 (1UL << 12)
#define ESP32_UNIT_134_BIT_13 (1UL << 13)
#define ESP32_UNIT_134_BIT_14 (1UL << 14)
#define ESP32_UNIT_134_BIT_15 (1UL << 15)
#define ESP32_UNIT_134_BIT_16 (1UL << 16)
#define ESP32_UNIT_134_BIT_17 (1UL << 17)
#define ESP32_UNIT_134_BIT_18 (1UL << 18)
#define ESP32_UNIT_134_BIT_19 (1UL << 19)
#define ESP32_UNIT_134_BIT_20 (1UL << 20)
#define ESP32_UNIT_134_BIT_21 (1UL << 21)
#define ESP32_UNIT_134_BIT_22 (1UL << 22)
#define ESP32_UNIT_134_BIT_23 (1UL << 23)
#define ESP32_UNIT_134_BIT_24 (1UL << 24)
#define ESP32_UNIT_134_BIT_25 (1UL << 25)
#define ESP32_UNIT_134_BIT_26 (1UL << 26)
#define ESP32_UNIT_134_BIT_27 (1UL << 27)
#define ESP32_UNIT_134_BIT_28 (1UL << 28)
#define ESP32_UNIT_134_BIT_29 (1UL << 29)
#define ESP32_UNIT_134_BIT_30 (1UL << 30)
#define ESP32_UNIT_134_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_135_TypeDef;
#define ESP32_UNIT_135 ((ESP32_UNIT_135_TypeDef *)(0x3FF40000UL + 135 * 0x400UL))

#define ESP32_UNIT_135_BIT_0 (1UL << 0)
#define ESP32_UNIT_135_BIT_1 (1UL << 1)
#define ESP32_UNIT_135_BIT_2 (1UL << 2)
#define ESP32_UNIT_135_BIT_3 (1UL << 3)
#define ESP32_UNIT_135_BIT_4 (1UL << 4)
#define ESP32_UNIT_135_BIT_5 (1UL << 5)
#define ESP32_UNIT_135_BIT_6 (1UL << 6)
#define ESP32_UNIT_135_BIT_7 (1UL << 7)
#define ESP32_UNIT_135_BIT_8 (1UL << 8)
#define ESP32_UNIT_135_BIT_9 (1UL << 9)
#define ESP32_UNIT_135_BIT_10 (1UL << 10)
#define ESP32_UNIT_135_BIT_11 (1UL << 11)
#define ESP32_UNIT_135_BIT_12 (1UL << 12)
#define ESP32_UNIT_135_BIT_13 (1UL << 13)
#define ESP32_UNIT_135_BIT_14 (1UL << 14)
#define ESP32_UNIT_135_BIT_15 (1UL << 15)
#define ESP32_UNIT_135_BIT_16 (1UL << 16)
#define ESP32_UNIT_135_BIT_17 (1UL << 17)
#define ESP32_UNIT_135_BIT_18 (1UL << 18)
#define ESP32_UNIT_135_BIT_19 (1UL << 19)
#define ESP32_UNIT_135_BIT_20 (1UL << 20)
#define ESP32_UNIT_135_BIT_21 (1UL << 21)
#define ESP32_UNIT_135_BIT_22 (1UL << 22)
#define ESP32_UNIT_135_BIT_23 (1UL << 23)
#define ESP32_UNIT_135_BIT_24 (1UL << 24)
#define ESP32_UNIT_135_BIT_25 (1UL << 25)
#define ESP32_UNIT_135_BIT_26 (1UL << 26)
#define ESP32_UNIT_135_BIT_27 (1UL << 27)
#define ESP32_UNIT_135_BIT_28 (1UL << 28)
#define ESP32_UNIT_135_BIT_29 (1UL << 29)
#define ESP32_UNIT_135_BIT_30 (1UL << 30)
#define ESP32_UNIT_135_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_136_TypeDef;
#define ESP32_UNIT_136 ((ESP32_UNIT_136_TypeDef *)(0x3FF40000UL + 136 * 0x400UL))

#define ESP32_UNIT_136_BIT_0 (1UL << 0)
#define ESP32_UNIT_136_BIT_1 (1UL << 1)
#define ESP32_UNIT_136_BIT_2 (1UL << 2)
#define ESP32_UNIT_136_BIT_3 (1UL << 3)
#define ESP32_UNIT_136_BIT_4 (1UL << 4)
#define ESP32_UNIT_136_BIT_5 (1UL << 5)
#define ESP32_UNIT_136_BIT_6 (1UL << 6)
#define ESP32_UNIT_136_BIT_7 (1UL << 7)
#define ESP32_UNIT_136_BIT_8 (1UL << 8)
#define ESP32_UNIT_136_BIT_9 (1UL << 9)
#define ESP32_UNIT_136_BIT_10 (1UL << 10)
#define ESP32_UNIT_136_BIT_11 (1UL << 11)
#define ESP32_UNIT_136_BIT_12 (1UL << 12)
#define ESP32_UNIT_136_BIT_13 (1UL << 13)
#define ESP32_UNIT_136_BIT_14 (1UL << 14)
#define ESP32_UNIT_136_BIT_15 (1UL << 15)
#define ESP32_UNIT_136_BIT_16 (1UL << 16)
#define ESP32_UNIT_136_BIT_17 (1UL << 17)
#define ESP32_UNIT_136_BIT_18 (1UL << 18)
#define ESP32_UNIT_136_BIT_19 (1UL << 19)
#define ESP32_UNIT_136_BIT_20 (1UL << 20)
#define ESP32_UNIT_136_BIT_21 (1UL << 21)
#define ESP32_UNIT_136_BIT_22 (1UL << 22)
#define ESP32_UNIT_136_BIT_23 (1UL << 23)
#define ESP32_UNIT_136_BIT_24 (1UL << 24)
#define ESP32_UNIT_136_BIT_25 (1UL << 25)
#define ESP32_UNIT_136_BIT_26 (1UL << 26)
#define ESP32_UNIT_136_BIT_27 (1UL << 27)
#define ESP32_UNIT_136_BIT_28 (1UL << 28)
#define ESP32_UNIT_136_BIT_29 (1UL << 29)
#define ESP32_UNIT_136_BIT_30 (1UL << 30)
#define ESP32_UNIT_136_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_137_TypeDef;
#define ESP32_UNIT_137 ((ESP32_UNIT_137_TypeDef *)(0x3FF40000UL + 137 * 0x400UL))

