RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_137_BIT_0 (1UL << 0)
#define ESP32_UNIT_137_BIT_1 (1UL << 1)
#define ESP32_UNIT_137_BIT_2 (1UL << 2)
#define ESP32_UNIT_137_BIT_3 (1UL << 3)
#define ESP32_UNIT_137_BIT_4 (1UL << 4)
#define ESP32_UNIT_137_BIT_5 (1UL << 5)
#define ESP32_UNIT_137_BIT_6 (1UL << 6)
#define ESP32_UNIT_137_BIT_7 (1UL << 7)
#define ESP32_UNIT_137_BIT_8 (1UL << 8)
#define ESP32_UNIT_137_BIT_9 (1UL << 9)
#define ESP32_UNIT_137_BIT_10 (1UL << 10)
#define ESP32_UNIT_137_BIT_11 (1UL << 11)
#define ESP32_UNIT_137_BIT_12 (1UL << 12)
#define ESP32_UNIT_137_BIT_13 (1UL << 13)
#define ESP32_UNIT_137_BIT_14 (1UL << 14)
#define ESP32_UNIT_137_BIT_15 (1UL << 15)
#define ESP32_UNIT_137_BIT_16 (1UL << 16)
#define ESP32_UNIT_137_BIT_17 (1UL << 17)
#define ESP32_UNIT_137_BIT_18 (1UL << 18)
#define ESP32_UNIT_137_BIT_19 (1UL << 19)
#define ESP32_UNIT_137_BIT_20 (1UL << 20)
#define ESP32_UNIT_137_BIT_21 (1UL << 21)
#define ESP32_UNIT_137_BIT_22 (1UL << 22)
#define ESP32_UNIT_137_BIT_23 (1UL << 23)
#define ESP32_UNIT_137_BIT_24 (1UL << 24)
#define ESP32_UNIT_137_BIT_25 (1UL << 25)
#define ESP32_UNIT_137_BIT_26 (1UL << 26)
#define ESP32_UNIT_137_BIT_27 (1UL << 27)
#define ESP32_UNIT_137_BIT_28 (1UL << 28)
#define ESP32_UNIT_137_BIT_29 (1UL << 29)
#define ESP32_UNIT_137_BIT_30 (1UL << 30)
#define ESP32_UNIT_137_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_138_TypeDef;
#define ESP32_UNIT_138 ((ESP32_UNIT_138_TypeDef *)(0x3FF40000UL + 138 * 0x400UL))

#define ESP32_UNIT_138_BIT_0 (1UL << 0)
#define ESP32_UNIT_138_BIT_1 (1UL << 1)
#define ESP32_UNIT_138_BIT_2 (1UL << 2)
#define ESP32_UNIT_138_BIT_3 (1UL << 3)
#define ESP32_UNIT_138_BIT_4 (1UL << 4)
#define ESP32_UNIT_138_BIT_5 (1UL << 5)
#define ESP32_UNIT_138_BIT_6 (1UL << 6)
#define ESP32_UNIT_138_BIT_7 (1UL << 7)
#define ESP32_UNIT_138_BIT_8 (1UL << 8)
#define ESP32_UNIT_138_BIT_9 (1UL << 9)
#define ESP32_UNIT_138_BIT_10 (1UL << 10)
#define ESP32_UNIT_138_BIT_11 (1UL << 11)
#define ESP32_UNIT_138_BIT_12 (1UL << 12)
#define ESP32_UNIT_138_BIT_13 (1UL << 13)
#define ESP32_UNIT_138_BIT_14 (1UL << 14)
#define ESP32_UNIT_138_BIT_15 (1UL << 15)
#define ESP32_UNIT_138_BIT_16 (1UL << 16)
#define ESP32_UNIT_138_BIT_17 (1UL << 17)
#define ESP32_UNIT_138_BIT_18 (1UL << 18)
#define ESP32_UNIT_138_BIT_19 (1UL << 19)
#define ESP32_UNIT_138_BIT_20 (1UL << 20)
#define ESP32_UNIT_138_BIT_21 (1UL << 21)
#define ESP32_UNIT_138_BIT_22 (1UL << 22)
#define ESP32_UNIT_138_BIT_23 (1UL << 23)
#define ESP32_UNIT_138_BIT_24 (1UL << 24)
#define ESP32_UNIT_138_BIT_25 (1UL << 25)
#define ESP32_UNIT_138_BIT_26 (1UL << 26)
#define ESP32_UNIT_138_BIT_27 (1UL << 27)
#define ESP32_UNIT_138_BIT_28 (1UL << 28)
#define ESP32_UNIT_138_BIT_29 (1UL << 29)
#define ESP32_UNIT_138_BIT_30 (1UL << 30)
#define ESP32_UNIT_138_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_139_TypeDef;
#define ESP32_UNIT_139 ((ESP32_UNIT_139_TypeDef *)(0x3FF40000UL + 139 * 0x400UL))

#define ESP32_UNIT_139_BIT_0 (1UL << 0)
#define ESP32_UNIT_139_BIT_1 (1UL << 1)
#define ESP32_UNIT_139_BIT_2 (1UL << 2)
#define ESP32_UNIT_139_BIT_3 (1UL << 3)
#define ESP32_UNIT_139_BIT_4 (1UL << 4)
#define ESP32_UNIT_139_BIT_5 (1UL << 5)
#define ESP32_UNIT_139_BIT_6 (1UL << 6)
#define ESP32_UNIT_139_BIT_7 (1UL << 7)
#define ESP32_UNIT_139_BIT_8 (1UL << 8)
#define ESP32_UNIT_139_BIT_9 (1UL << 9)
#define ESP32_UNIT_139_BIT_10 (1UL << 10)
#define ESP32_UNIT_139_BIT_11 (1UL << 11)
#define ESP32_UNIT_139_BIT_12 (1UL << 12)
#define ESP32_UNIT_139_BIT_13 (1UL << 13)
#define ESP32_UNIT_139_BIT_14 (1UL << 14)
#define ESP32_UNIT_139_BIT_15 (1UL << 15)
#define ESP32_UNIT_139_BIT_16 (1UL << 16)
#define ESP32_UNIT_139_BIT_17 (1UL << 17)
#define ESP32_UNIT_139_BIT_18 (1UL << 18)
#define ESP32_UNIT_139_BIT_19 (1UL << 19)
#define ESP32_UNIT_139_BIT_20 (1UL << 20)
#define ESP32_UNIT_139_BIT_21 (1UL << 21)
#define ESP32_UNIT_139_BIT_22 (1UL << 22)
#define ESP32_UNIT_139_BIT_23 (1UL << 23)
#define ESP32_UNIT_139_BIT_24 (1UL << 24)
#define ESP32_UNIT_139_BIT_25 (1UL << 25)
#define ESP32_UNIT_139_BIT_26 (1UL << 26)
#define ESP32_UNIT_139_BIT_27 (1UL << 27)
#define ESP32_UNIT_139_BIT_28 (1UL << 28)
#define ESP32_UNIT_139_BIT_29 (1UL << 29)
#define ESP32_UNIT_139_BIT_30 (1UL << 30)
#define ESP32_UNIT_139_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_140_TypeDef;
#define ESP32_UNIT_140 ((ESP32_UNIT_140_TypeDef *)(0x3FF40000UL + 140 * 0x400UL))

#define ESP32_UNIT_140_BIT_0 (1UL << 0)
#define ESP32_UNIT_140_BIT_1 (1UL << 1)
#define ESP32_UNIT_140_BIT_2 (1UL << 2)
#define ESP32_UNIT_140_BIT_3 (1UL << 3)
#define ESP32_UNIT_140_BIT_4 (1UL << 4)
#define ESP32_UNIT_140_BIT_5 (1UL << 5)
#define ESP32_UNIT_140_BIT_6 (1UL << 6)
#define ESP32_UNIT_140_BIT_7 (1UL << 7)
#define ESP32_UNIT_140_BIT_8 (1UL << 8)
#define ESP32_UNIT_140_BIT_9 (1UL << 9)
#define ESP32_UNIT_140_BIT_10 (1UL << 10)
#define ESP32_UNIT_140_BIT_11 (1UL << 11)
#define ESP32_UNIT_140_BIT_12 (1UL << 12)
#define ESP32_UNIT_140_BIT_13 (1UL << 13)
#define ESP32_UNIT_140_BIT_14 (1UL << 14)
#define ESP32_UNIT_140_BIT_15 (1UL << 15)
#define ESP32_UNIT_140_BIT_16 (1UL << 16)
#define ESP32_UNIT_140_BIT_17 (1UL << 17)
#define ESP32_UNIT_140_BIT_18 (1UL << 18)
#define ESP32_UNIT_140_BIT_19 (1UL << 19)
#define ESP32_UNIT_140_BIT_20 (1UL << 20)
#define ESP32_UNIT_140_BIT_21 (1UL << 21)
#define ESP32_UNIT_140_BIT_22 (1UL << 22)
#define ESP32_UNIT_140_BIT_23 (1UL << 23)
#define ESP32_UNIT_140_BIT_24 (1UL << 24)
#define ESP32_UNIT_140_BIT_25 (1UL << 25)
#define ESP32_UNIT_140_BIT_26 (1UL << 26)
#define ESP32_UNIT_140_BIT_27 (1UL << 27)
#define ESP32_UNIT_140_BIT_28 (1UL << 28)
#define ESP32_UNIT_140_BIT_29 (1UL << 29)
#define ESP32_UNIT_140_BIT_30 (1UL << 30)
#define ESP32_UNIT_140_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_141_TypeDef;
#define ESP32_UNIT_141 ((ESP32_UNIT_141_TypeDef *)(0x3FF40000UL + 141 * 0x400UL))

#define ESP32_UNIT_141_BIT_0 (1UL << 0)
#define ESP32_UNIT_141_BIT_1 (1UL << 1)
#define ESP32_UNIT_141_BIT_2 (1UL << 2)
#define ESP32_UNIT_141_BIT_3 (1UL << 3)
#define ESP32_UNIT_141_BIT_4 (1UL << 4)
#define ESP32_UNIT_141_BIT_5 (1UL << 5)
#define ESP32_UNIT_141_BIT_6 (1UL << 6)
#define ESP32_UNIT_141_BIT_7 (1UL << 7)
#define ESP32_UNIT_141_BIT_8 (1UL << 8)
#define ESP32_UNIT_141_BIT_9 (1UL << 9)
#define ESP32_UNIT_141_BIT_10 (1UL << 10)
#define ESP32_UNIT_141_BIT_11 (1UL << 11)
#define ESP32_UNIT_141_BIT_12 (1UL << 12)
#define ESP32_UNIT_141_BIT_13 (1UL << 13)
#define ESP32_UNIT_141_BIT_14 (1UL << 14)
#define ESP32_UNIT_141_BIT_15 (1UL << 15)
#define ESP32_UNIT_141_BIT_16 (1UL << 16)
#define ESP32_UNIT_141_BIT_17 (1UL << 17)
#define ESP32_UNIT_141_BIT_18 (1UL << 18)
#define ESP32_UNIT_141_BIT_19 (1UL << 19)
#define ESP32_UNIT_141_BIT_20 (1UL << 20)
#define ESP32_UNIT_141_BIT_21 (1UL << 21)
#define ESP32_UNIT_141_BIT_22 (1UL << 22)
#define ESP32_UNIT_141_BIT_23 (1UL << 23)
#define ESP32_UNIT_141_BIT_24 (1UL << 24)
#define ESP32_UNIT_141_BIT_25 (1UL << 25)
#define ESP32_UNIT_141_BIT_26 (1UL << 26)
#define ESP32_UNIT_141_BIT_27 (1UL << 27)
#define ESP32_UNIT_141_BIT_28 (1UL << 28)
#define ESP32_UNIT_141_BIT_29 (1UL << 29)
#define ESP32_UNIT_141_BIT_30 (1UL << 30)
#define ESP32_UNIT_141_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_142_TypeDef;
#define ESP32_UNIT_142 ((ESP32_UNIT_142_TypeDef *)(0x3FF40000UL + 142 * 0x400UL))

