RohithSai4518/Embeded_Systems/include/registers/reg_esp32_soc.h
#define ESP32_UNIT_152_BIT_0 (1UL << 0)
#define ESP32_UNIT_152_BIT_1 (1UL << 1)
#define ESP32_UNIT_152_BIT_2 (1UL << 2)
#define ESP32_UNIT_152_BIT_3 (1UL << 3)
#define ESP32_UNIT_152_BIT_4 (1UL << 4)
#define ESP32_UNIT_152_BIT_5 (1UL << 5)
#define ESP32_UNIT_152_BIT_6 (1UL << 6)
#define ESP32_UNIT_152_BIT_7 (1UL << 7)
#define ESP32_UNIT_152_BIT_8 (1UL << 8)
#define ESP32_UNIT_152_BIT_9 (1UL << 9)
#define ESP32_UNIT_152_BIT_10 (1UL << 10)
#define ESP32_UNIT_152_BIT_11 (1UL << 11)
#define ESP32_UNIT_152_BIT_12 (1UL << 12)
#define ESP32_UNIT_152_BIT_13 (1UL << 13)
#define ESP32_UNIT_152_BIT_14 (1UL << 14)
#define ESP32_UNIT_152_BIT_15 (1UL << 15)
#define ESP32_UNIT_152_BIT_16 (1UL << 16)
#define ESP32_UNIT_152_BIT_17 (1UL << 17)
#define ESP32_UNIT_152_BIT_18 (1UL << 18)
#define ESP32_UNIT_152_BIT_19 (1UL << 19)
#define ESP32_UNIT_152_BIT_20 (1UL << 20)
#define ESP32_UNIT_152_BIT_21 (1UL << 21)
#define ESP32_UNIT_152_BIT_22 (1UL << 22)
#define ESP32_UNIT_152_BIT_23 (1UL << 23)
#define ESP32_UNIT_152_BIT_24 (1UL << 24)
#define ESP32_UNIT_152_BIT_25 (1UL << 25)
#define ESP32_UNIT_152_BIT_26 (1UL << 26)
#define ESP32_UNIT_152_BIT_27 (1UL << 27)
#define ESP32_UNIT_152_BIT_28 (1UL << 28)
#define ESP32_UNIT_152_BIT_29 (1UL << 29)
#define ESP32_UNIT_152_BIT_30 (1UL << 30)
#define ESP32_UNIT_152_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_153_TypeDef;
#define ESP32_UNIT_153 ((ESP32_UNIT_153_TypeDef *)(0x3FF40000UL + 153 * 0x400UL))

#define ESP32_UNIT_153_BIT_0 (1UL << 0)
#define ESP32_UNIT_153_BIT_1 (1UL << 1)
#define ESP32_UNIT_153_BIT_2 (1UL << 2)
#define ESP32_UNIT_153_BIT_3 (1UL << 3)
#define ESP32_UNIT_153_BIT_4 (1UL << 4)
#define ESP32_UNIT_153_BIT_5 (1UL << 5)
#define ESP32_UNIT_153_BIT_6 (1UL << 6)
#define ESP32_UNIT_153_BIT_7 (1UL << 7)
#define ESP32_UNIT_153_BIT_8 (1UL << 8)
#define ESP32_UNIT_153_BIT_9 (1UL << 9)
#define ESP32_UNIT_153_BIT_10 (1UL << 10)
#define ESP32_UNIT_153_BIT_11 (1UL << 11)
#define ESP32_UNIT_153_BIT_12 (1UL << 12)
#define ESP32_UNIT_153_BIT_13 (1UL << 13)
#define ESP32_UNIT_153_BIT_14 (1UL << 14)
#define ESP32_UNIT_153_BIT_15 (1UL << 15)
#define ESP32_UNIT_153_BIT_16 (1UL << 16)
#define ESP32_UNIT_153_BIT_17 (1UL << 17)
#define ESP32_UNIT_153_BIT_18 (1UL << 18)
#define ESP32_UNIT_153_BIT_19 (1UL << 19)
#define ESP32_UNIT_153_BIT_20 (1UL << 20)
#define ESP32_UNIT_153_BIT_21 (1UL << 21)
#define ESP32_UNIT_153_BIT_22 (1UL << 22)
#define ESP32_UNIT_153_BIT_23 (1UL << 23)
#define ESP32_UNIT_153_BIT_24 (1UL << 24)
#define ESP32_UNIT_153_BIT_25 (1UL << 25)
#define ESP32_UNIT_153_BIT_26 (1UL << 26)
#define ESP32_UNIT_153_BIT_27 (1UL << 27)
#define ESP32_UNIT_153_BIT_28 (1UL << 28)
#define ESP32_UNIT_153_BIT_29 (1UL << 29)
#define ESP32_UNIT_153_BIT_30 (1UL << 30)
#define ESP32_UNIT_153_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_154_TypeDef;
#define ESP32_UNIT_154 ((ESP32_UNIT_154_TypeDef *)(0x3FF40000UL + 154 * 0x400UL))

#define ESP32_UNIT_154_BIT_0 (1UL << 0)
#define ESP32_UNIT_154_BIT_1 (1UL << 1)
#define ESP32_UNIT_154_BIT_2 (1UL << 2)
#define ESP32_UNIT_154_BIT_3 (1UL << 3)
#define ESP32_UNIT_154_BIT_4 (1UL << 4)
#define ESP32_UNIT_154_BIT_5 (1UL << 5)
#define ESP32_UNIT_154_BIT_6 (1UL << 6)
#define ESP32_UNIT_154_BIT_7 (1UL << 7)
#define ESP32_UNIT_154_BIT_8 (1UL << 8)
#define ESP32_UNIT_154_BIT_9 (1UL << 9)
#define ESP32_UNIT_154_BIT_10 (1UL << 10)
#define ESP32_UNIT_154_BIT_11 (1UL << 11)
#define ESP32_UNIT_154_BIT_12 (1UL << 12)
#define ESP32_UNIT_154_BIT_13 (1UL << 13)
#define ESP32_UNIT_154_BIT_14 (1UL << 14)
#define ESP32_UNIT_154_BIT_15 (1UL << 15)
#define ESP32_UNIT_154_BIT_16 (1UL << 16)
#define ESP32_UNIT_154_BIT_17 (1UL << 17)
#define ESP32_UNIT_154_BIT_18 (1UL << 18)
#define ESP32_UNIT_154_BIT_19 (1UL << 19)
#define ESP32_UNIT_154_BIT_20 (1UL << 20)
#define ESP32_UNIT_154_BIT_21 (1UL << 21)
#define ESP32_UNIT_154_BIT_22 (1UL << 22)
#define ESP32_UNIT_154_BIT_23 (1UL << 23)
#define ESP32_UNIT_154_BIT_24 (1UL << 24)
#define ESP32_UNIT_154_BIT_25 (1UL << 25)
#define ESP32_UNIT_154_BIT_26 (1UL << 26)
#define ESP32_UNIT_154_BIT_27 (1UL << 27)
#define ESP32_UNIT_154_BIT_28 (1UL << 28)
#define ESP32_UNIT_154_BIT_29 (1UL << 29)
#define ESP32_UNIT_154_BIT_30 (1UL << 30)
#define ESP32_UNIT_154_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_155_TypeDef;
#define ESP32_UNIT_155 ((ESP32_UNIT_155_TypeDef *)(0x3FF40000UL + 155 * 0x400UL))

#define ESP32_UNIT_155_BIT_0 (1UL << 0)
#define ESP32_UNIT_155_BIT_1 (1UL << 1)
#define ESP32_UNIT_155_BIT_2 (1UL << 2)
#define ESP32_UNIT_155_BIT_3 (1UL << 3)
#define ESP32_UNIT_155_BIT_4 (1UL << 4)
#define ESP32_UNIT_155_BIT_5 (1UL << 5)
#define ESP32_UNIT_155_BIT_6 (1UL << 6)
#define ESP32_UNIT_155_BIT_7 (1UL << 7)
#define ESP32_UNIT_155_BIT_8 (1UL << 8)
#define ESP32_UNIT_155_BIT_9 (1UL << 9)
#define ESP32_UNIT_155_BIT_10 (1UL << 10)
#define ESP32_UNIT_155_BIT_11 (1UL << 11)
#define ESP32_UNIT_155_BIT_12 (1UL << 12)
#define ESP32_UNIT_155_BIT_13 (1UL << 13)
#define ESP32_UNIT_155_BIT_14 (1UL << 14)
#define ESP32_UNIT_155_BIT_15 (1UL << 15)
#define ESP32_UNIT_155_BIT_16 (1UL << 16)
#define ESP32_UNIT_155_BIT_17 (1UL << 17)
#define ESP32_UNIT_155_BIT_18 (1UL << 18)
#define ESP32_UNIT_155_BIT_19 (1UL << 19)
#define ESP32_UNIT_155_BIT_20 (1UL << 20)
#define ESP32_UNIT_155_BIT_21 (1UL << 21)
#define ESP32_UNIT_155_BIT_22 (1UL << 22)
#define ESP32_UNIT_155_BIT_23 (1UL << 23)
#define ESP32_UNIT_155_BIT_24 (1UL << 24)
#define ESP32_UNIT_155_BIT_25 (1UL << 25)
#define ESP32_UNIT_155_BIT_26 (1UL << 26)
#define ESP32_UNIT_155_BIT_27 (1UL << 27)
#define ESP32_UNIT_155_BIT_28 (1UL << 28)
#define ESP32_UNIT_155_BIT_29 (1UL << 29)
#define ESP32_UNIT_155_BIT_30 (1UL << 30)
#define ESP32_UNIT_155_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_156_TypeDef;
#define ESP32_UNIT_156 ((ESP32_UNIT_156_TypeDef *)(0x3FF40000UL + 156 * 0x400UL))

#define ESP32_UNIT_156_BIT_0 (1UL << 0)
#define ESP32_UNIT_156_BIT_1 (1UL << 1)
#define ESP32_UNIT_156_BIT_2 (1UL << 2)
#define ESP32_UNIT_156_BIT_3 (1UL << 3)
#define ESP32_UNIT_156_BIT_4 (1UL << 4)
#define ESP32_UNIT_156_BIT_5 (1UL << 5)
#define ESP32_UNIT_156_BIT_6 (1UL << 6)
#define ESP32_UNIT_156_BIT_7 (1UL << 7)
#define ESP32_UNIT_156_BIT_8 (1UL << 8)
#define ESP32_UNIT_156_BIT_9 (1UL << 9)
#define ESP32_UNIT_156_BIT_10 (1UL << 10)
#define ESP32_UNIT_156_BIT_11 (1UL << 11)
#define ESP32_UNIT_156_BIT_12 (1UL << 12)
#define ESP32_UNIT_156_BIT_13 (1UL << 13)
#define ESP32_UNIT_156_BIT_14 (1UL << 14)
#define ESP32_UNIT_156_BIT_15 (1UL << 15)
#define ESP32_UNIT_156_BIT_16 (1UL << 16)
#define ESP32_UNIT_156_BIT_17 (1UL << 17)
#define ESP32_UNIT_156_BIT_18 (1UL << 18)
#define ESP32_UNIT_156_BIT_19 (1UL << 19)
#define ESP32_UNIT_156_BIT_20 (1UL << 20)
#define ESP32_UNIT_156_BIT_21 (1UL << 21)
#define ESP32_UNIT_156_BIT_22 (1UL << 22)
#define ESP32_UNIT_156_BIT_23 (1UL << 23)
#define ESP32_UNIT_156_BIT_24 (1UL << 24)
#define ESP32_UNIT_156_BIT_25 (1UL << 25)
#define ESP32_UNIT_156_BIT_26 (1UL << 26)
#define ESP32_UNIT_156_BIT_27 (1UL << 27)
#define ESP32_UNIT_156_BIT_28 (1UL << 28)
#define ESP32_UNIT_156_BIT_29 (1UL << 29)
#define ESP32_UNIT_156_BIT_30 (1UL << 30)
#define ESP32_UNIT_156_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_157_TypeDef;
#define ESP32_UNIT_157 ((ESP32_UNIT_157_TypeDef *)(0x3FF40000UL + 157 * 0x400UL))

#define ESP32_UNIT_157_BIT_0 (1UL << 0)
#define ESP32_UNIT_157_BIT_1 (1UL << 1)
#define ESP32_UNIT_157_BIT_2 (1UL << 2)
#define ESP32_UNIT_157_BIT_3 (1UL << 3)
#define ESP32_UNIT_157_BIT_4 (1UL << 4)
#define ESP32_UNIT_157_BIT_5 (1UL << 5)
#define ESP32_UNIT_157_BIT_6 (1UL << 6)
#define ESP32_UNIT_157_BIT_7 (1UL << 7)
#define ESP32_UNIT_157_BIT_8 (1UL << 8)
#define ESP32_UNIT_157_BIT_9 (1UL << 9)
#define ESP32_UNIT_157_BIT_10 (1UL << 10)
#define ESP32_UNIT_157_BIT_11 (1UL << 11)
#define ESP32_UNIT_157_BIT_12 (1UL << 12)
#define ESP32_UNIT_157_BIT_13 (1UL << 13)
#define ESP32_UNIT_157_BIT_14 (1UL << 14)
#define ESP32_UNIT_157_BIT_15 (1UL << 15)
#define ESP32_UNIT_157_BIT_16 (1UL << 16)
#define ESP32_UNIT_157_BIT_17 (1UL << 17)
#define ESP32_UNIT_157_BIT_18 (1UL << 18)
#define ESP32_UNIT_157_BIT_19 (1UL << 19)
#define ESP32_UNIT_157_BIT_20 (1UL << 20)
#define ESP32_UNIT_157_BIT_21 (1UL << 21)
#define ESP32_UNIT_157_BIT_22 (1UL << 22)
#define ESP32_UNIT_157_BIT_23 (1UL << 23)
#define ESP32_UNIT_157_BIT_24 (1UL << 24)
#define ESP32_UNIT_157_BIT_25 (1UL << 25)
#define ESP32_UNIT_157_BIT_26 (1UL << 26)
#define ESP32_UNIT_157_BIT_27 (1UL << 27)
#define ESP32_UNIT_157_BIT_28 (1UL << 28)
#define ESP32_UNIT_157_BIT_29 (1UL << 29)
#define ESP32_UNIT_157_BIT_30 (1UL << 30)
#define ESP32_UNIT_157_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_158_TypeDef;
#define ESP32_UNIT_158 ((ESP32_UNIT_158_TypeDef *)(0x3FF40000UL + 158 * 0x400UL))

#define ESP32_UNIT_158_BIT_0 (1UL << 0)
#define ESP32_UNIT_158_BIT_1 (1UL << 1)
#define ESP32_UNIT_158_BIT_2 (1UL << 2)
#define ESP32_UNIT_158_BIT_3 (1UL << 3)
#define ESP32_UNIT_158_BIT_4 (1UL << 4)
#define ESP32_UNIT_158_BIT_5 (1UL << 5)
#define ESP32_UNIT_158_BIT_6 (1UL << 6)
#define ESP32_UNIT_158_BIT_7 (1UL << 7)
#define ESP32_UNIT_158_BIT_8 (1UL << 8)
#define ESP32_UNIT_158_BIT_9 (1UL << 9)
#define ESP32_UNIT_158_BIT_10 (1UL << 10)
#define ESP32_UNIT_158_BIT_11 (1UL << 11)
#define ESP32_UNIT_158_BIT_12 (1UL << 12)
#define ESP32_UNIT_158_BIT_13 (1UL << 13)
#define ESP32_UNIT_158_BIT_14 (1UL << 14)
#define ESP32_UNIT_158_BIT_15 (1UL << 15)
#define ESP32_UNIT_158_BIT_16 (1UL << 16)
#define ESP32_UNIT_158_BIT_17 (1UL << 17)
#define ESP32_UNIT_158_BIT_18 (1UL << 18)
#define ESP32_UNIT_158_BIT_19 (1UL << 19)
#define ESP32_UNIT_158_BIT_20 (1UL << 20)
#define ESP32_UNIT_158_BIT_21 (1UL << 21)
#define ESP32_UNIT_158_BIT_22 (1UL << 22)
#define ESP32_UNIT_158_BIT_23 (1UL << 23)
#define ESP32_UNIT_158_BIT_24 (1UL << 24)
#define ESP32_UNIT_158_BIT_25 (1UL << 25)
#define ESP32_UNIT_158_BIT_26 (1UL << 26)
#define ESP32_UNIT_158_BIT_27 (1UL << 27)
#define ESP32_UNIT_158_BIT_28 (1UL << 28)
#define ESP32_UNIT_158_BIT_29 (1UL << 29)
#define ESP32_UNIT_158_BIT_30 (1UL << 30)
#define ESP32_UNIT_158_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CONF, INT_RAW, INT_ST, INT_ENA, INT_CLR, STATUS, CTRL, VALUE, DATA_IN, DATA_OUT, FIFO, TIMER_LOAD, TIMER_CNT, TIMER_ALARMA; } ESP32_UNIT_159_TypeDef;
#define ESP32_UNIT_159 ((ESP32_UNIT_159_TypeDef *)(0x3FF40000UL + 159 * 0x400UL))

#define ESP32_UNIT_159_BIT_0 (1UL << 0)
#define ESP32_UNIT_159_BIT_1 (1UL << 1)
#define ESP32_UNIT_159_BIT_2 (1UL << 2)
#define ESP32_UNIT_159_BIT_3 (1UL << 3)
#define ESP32_UNIT_159_BIT_4 (1UL << 4)
#define ESP32_UNIT_159_BIT_5 (1UL << 5)
#define ESP32_UNIT_159_BIT_6 (1UL << 6)
#define ESP32_UNIT_159_BIT_7 (1UL << 7)
#define ESP32_UNIT_159_BIT_8 (1UL << 8)
#define ESP32_UNIT_159_BIT_9 (1UL << 9)
#define ESP32_UNIT_159_BIT_10 (1UL << 10)
#define ESP32_UNIT_159_BIT_11 (1UL << 11)
#define ESP32_UNIT_159_BIT_12 (1UL << 12)
#define ESP32_UNIT_159_BIT_13 (1UL << 13)
#define ESP32_UNIT_159_BIT_14 (1UL << 14)
#define ESP32_UNIT_159_BIT_15 (1UL << 15)
#define ESP32_UNIT_159_BIT_16 (1UL << 16)
#define ESP32_UNIT_159_BIT_17 (1UL << 17)
#define ESP32_UNIT_159_BIT_18 (1UL << 18)
#define ESP32_UNIT_159_BIT_19 (1UL << 19)
#define ESP32_UNIT_159_BIT_20 (1UL << 20)
#define ESP32_UNIT_159_BIT_21 (1UL << 21)
#define ESP32_UNIT_159_BIT_22 (1UL << 22)
#define ESP32_UNIT_159_BIT_23 (1UL << 23)
#define ESP32_UNIT_159_BIT_24 (1UL << 24)
#define ESP32_UNIT_159_BIT_25 (1UL << 25)
#define ESP32_UNIT_159_BIT_26 (1UL << 26)
#define ESP32_UNIT_159_BIT_27 (1UL << 27)
#define ESP32_UNIT_159_BIT_28 (1UL << 28)
#define ESP32_UNIT_159_BIT_29 (1UL << 29)
#define ESP32_UNIT_159_BIT_30 (1UL << 30)
#define ESP32_UNIT_159_BIT_31 (1UL << 31)
#ifdef __cplusplus
}
#endif
#endif
